{
  "head": {
    "title": "API d'édition de document Java | Modifier PDF, Word, Excel, Epub",
    "description": "API d'édition de document Java pour modifier, traduire et enregistrer des pages de documents à partir de formats PDF, Microsoft Word, Excel, Présentations, Visio et Image."
  },
  "header": {
    "title_1": "Modifier les documents",
    "title_2": "via l'API Java",
    "description": "API de l'éditeur puissant pour manipuler les fichiers PDF, Microsoft Office, HTML et image.",
    "words": {
      "for": "pour"
    }
  },
  "actions": {
    "main": "Téléchargement gratuit de maven",
    "alt": "Licence",
    "title": "Prêt à commencer?",
    "description": "Essayez les fonctionnalités GroupDocs.Editor gratuitement ou demandez une licence."
  },
  "release": {
    "title": "Version {0} publié",
    "notes": "Voyez ce qui est nouveau",
    "downloads": "Téléchargements"
  },
  "overview": {
    "title": "GroupDocs.Editor en un coup d'œil",
    "description": "API pour modifier, traduire et enregistrer des documents, des diapositives et des diagrammes dans les applications Java.",
    "feature_1": {
      "title": "Modifier sans effort plusieurs documents en Java",
      "description": "Modifiez de manière transparente plusieurs fichiers PDF et Office avec la prise en charge d'un large éventail de formats. GroupDocs.Editor pour Java rend l'édition de documents rapidement et sans tracas."
    },
    "feature_2": {
      "title": "Traduire des documents en HTML / CSS",
      "description": "Traduire les documents en balisage HTML / CSS compatible avec les éditeurs WYSIWYG, permettant une modification de documents facile et efficace dans un environnement Web."
    },
    "feature_3": {
      "title": "Enregistrer les documents édités dans divers formats",
      "description": "Enregistrez vos documents modifiés à leur format d'origine ou exportez-les vers d'autres formats tels que PDF, garantissant la flexibilité et la compatibilité."
    }
  },
  "formats": {
    "title": "Formats de fichiers pris en charge",
    "description": "GroupDocs.Editor for Java prend en charge les opérations avec les [formats de fichiers] suivants (https://docs.groupdocs.com/editor/java/supported-document-formits/).",
    "groups": {
      "title_1": "Formats Microsoft Office",
      "title_2": "Documents",
      "title_3": "Autres formats",
      "format_documents": "Documents",
      "format_images": "Images",
      "format_web": "Web",
      "format_archives": "Archives"
    }
  },
  "features": {
    "title": "GroupDocs.",
    "description": "Modifier, traduire et enregistrer et sauver les documents PDF et Office.",
    "feature_1": {
      "title": "Modifier les fichiers",
      "content": "Modifiez le contenu de divers formats de documents, notamment PDF, DOCX, XLSX, PPTX, etc."
    },
    "feature_2": {
      "title": "Traduire par HTML / CSS",
      "content": "Convertissez des documents en HTML / CSS pour une modification facile avec des éditeurs WYSIWYG comme Ckeditor ou TinyMCE."
    },
    "feature_3": {
      "title": "Enregistrer les documents édités",
      "content": "Enregistrez le HTML / CSS modifié dans le format de document d'origine ou l'exportation vers PDF."
    },
    "feature_4": {
      "title": "Extraire les informations sur les documents",
      "content": "Extraire des informations telles que le nombre de pages, la taille et l'état de chiffrement à partir des documents."
    },
    "feature_5": {
      "title": "Prise en charge de divers formats",
      "content": "Modifiez un large éventail de formats de documents, y compris les fichiers Microsoft Office, les PDF, etc."
    },
    "feature_6": {
      "title": "Protection contre les mots de passe",
      "content": "Modifiez facilement les documents protégés par mot de passe."
    },
    "feature_7": {
      "title": "Encodage de documents personnalisés",
      "content": "Spécifiez le codage du document lors des processus d'édition et de sauvegarde."
    },
    "feature_8": {
      "title": "Extraction de police",
      "content": "Extraire les polices des documents à utiliser dans le processus d'édition."
    },
    "feature_9": {
      "title": "Aperçu des pages",
      "content": "Générez des représentations d'image des pages de documents pour mieux comprendre le contenu et la structure."
    }
  },
  "code_samples": {
    "title": "Échantillons de code",
    "description": "Certains cas d'utilisation de GroupDocDocs. Editor pour les opérations Java.",
    "sample_1": {
      "title": "Modifier le contenu de fichier DOCX spécifique",
      "content_1": "La fonction [d'édition de document] (https://docs.groupdocs.com/editor/java/edit-document/) vous permet de charger, modifier et enregistrer des fichiers docx.",
      "content_2": "Voici un exemple de la façon d'atteindre l'édition de documents à l'aide de Java:",
      "code_title": "Comment modifier les fichiers docx en java"
    },
    "sample_2": {
      "title": "Modifier les champs de formulaire dans un document Word",
      "content_1": "Modifiez facilement les champs de formulaire dans un document Word à l'aide de GroupDocs.Editor pour Java.",
      "content_2": "Voici comment modifier les champs de formulaire dans un document Word à l'aide de Java:",
      "code_title": "Comment modifier les champs de formulaire dans un document Word en utilisant GroupDocs.Editor pour Java"
    }
  },
  "platforms": {
    "title": "Indépendance de la plate-forme",
    "description": "GroupDocs.Editor for Java prend en charge les systèmes d'exploitation, les cadres et les gestionnaires de package suivants."
  },
  "code": {
    "title": "Modifier les fichiers de documents dans Java",
    "more": "Plus d'exemples",
    "notes": "Voyez ce qui est nouveau"
  }
}