{
  "head": {
    "title": "Java Document Editing API | Edit PDF, Word, Excel, PowerPoint",
    "description": "Java document editing API to load, edit and save document pages from PDF, Microsoft Word, Excel, PowerPoint, eBook and email formats."
  },
  "header": {
    "title_1": "Edit documents",
    "title_2": "via Java API",
    "description": "Powerful editor API to manipulate Microsoft Office, PDF, HTML, eBook and email files.",
    "words": {
      "for": "for"
    }
  },
  "actions": {
    "main": "Free Maven Download",
    "alt": "Licensing",
    "title": "Ready to get started?",
    "description": "Try GroupDocs.Editor features for free or request a license."
  },
  "release": {
    "title": "Version {0} released",
    "notes": "See what’s new",
    "downloads": "Downloads"
  },
  "overview": {
	"glance": "at a glance",
    "description": "API to edit, convert, and save documents, spreadsheets, slides, and e-books in Java applications.",
    "feature_1": {
      "title": "Effortlessly edit multiple documents in Java",
      "description1": "Seamlessly edit multiple PDF and Office files with support for a wide range of formats.",
	  "description2": "makes document editing fast and hassle-free."
    },
    "feature_2": {
      "title": "Convert documents to HTML/CSS",
      "description": "Convert documents to pure HTML/CSS markup compatible with WYSIWYG editors, allowing easy and efficient document editing in a web environment."
    },
    "feature_3": {
      "title": "Save edited documents in various formats",
      "description": "Save your edited documents back to their original format or export them to other formats such as PDF, ensuring flexibility and compatibility."
    }
  },
  "formats": {
    "title": "Supported file formats",
    "description": "GroupDocs.Editor supports operations with the following file formats on import and export",
	"full_list": "full list",
    "groups": {
      "title_1": "Microsoft Office formats",
      "title_2": "Other document formats",
      "title_3": "Web-related formats",
      "fixed_layout": "Fixed-layout formats",
	  "export_only": "export only",
	  "delimited_text_table": "Delimited text tables",
	  "arbitrary_separator": "arbitrary separator",
	  "other_tables": "Other table formats",
      "format_markup": "Markup",
      "format_email": "Email formats"
    }
  },
  "features": {
    "features": "Main features",
    "description": "Seamlessly load, edit and save in different formats Office documents, Emails, eBooks, and PDF.",
    "feature_1": {
      "title": "Edit files",
      "content": "Edit the content of various document formats including PDF, DOCX, XLSX, PPTX, and more."
    },
    "feature_2": {
      "title": "Translate to HTML/CSS",
      "content": "Convert documents to HTML/CSS for easy editing with WYSIWYG editors like CKEditor or TinyMCE."
    },
    "feature_3": {
      "title": "Save edited documents",
      "content": "Save the edited HTML/CSS back to the original document format or export to PDF."
    },
    "feature_4": {
      "title": "Extract document information",
      "content": "Extract information such as page count, size, and encryption status from documents."
    },
    "feature_5": {
      "title": "Support for various formats",
      "content": "Edit a wide range of document formats including Microsoft Office files, PDFs, and more."
    },
    "feature_6": {
      "title": "Password protection",
      "content": "Load and edit password-protected documents with ease, and protecting the output documents with password protection."
    },
    "feature_7": {
      "title": "Edit email",
      "content": "Edit and save the email messages and letters in MSG, EML, EMLX, MBOX and many other formats, including editing metadata like Subject, To, CC, BCC, From, Title, Date and so on."
    },
    "feature_8": {
      "title": "Font extraction",
      "content": "Extract fonts from WordProcessing documents for use in the editing process."
    },
    "feature_9": {
      "title": "Preview pages",
      "content": "Generate image representations of document pages to better understand content and structure."
    }
  },
  "code_samples": {
    "title": "Code samples",
    "description": "Some use cases of typical operations using",
	"sample_1": {
		"title": "Replace text in DOCX",
		"description": "This example shows loading and editing a content of the input DOCX file programmatically by replacing text content on another. After that the modified document content is saved back as a new DOCX document.",
		"code_title": "Edit input DOCX by replacing text and save it back to DOCX",
		"comment_1": "Load input document by path and specify load options if necessary",
		"comment_2": "Open document for edit and obtain the \"EditableDocument\"",
		"comment_3": "Replace text - this emulates the content editing",
		"comment_4": "Create new \"EditableDocument\" instance from edited content",
		"comment_5": "Prepare save options with desired output formatX",
		"comment_6": "Save edited document content to DOCX",
		"comment_7": "Dispose all resources",
	},
	"sample_4": {
		"title": "Edit content of particular Excel worksheet",
		"description": "The Spreadsheet document (like XLS, XLSX, XLSM, ODS and so on) may have one or more worksheets (tabs). GroupDocs.Editor allows to edit content of one worksheet at a time. After being edited, this worksheet may be saved to the separate Spreadsheet document (where only this specific worksheet will be saved), or the edited worksheet can be inserted back to the original document, where it can either replace the original worksheet or be saved together, along with original one. This example shows loading XLSX document, editing its 2nd worksheet and saving it as a new separate document in XLSX and CSV formats.",
		"code_title": "Edit particular worksheet of XLSX and save as XLSX and CSV",
		"comment_1": "Load input XLSX by path and specify load options if necessary",
		"comment_2": "Create and adjust the edit options - set 2nd worksheet to edit",
		"comment_3": "Open this 2nd worksheet for edit and obtain the \"EditableDocument\"",
		"comment_4": "Replace text - this emulates the content editing",
		"comment_5": "Create new \"EditableDocument\" instance from edited worksheet",
		"comment_6": "Save edited worksheet to new XLSX document",
		"comment_7": "Save edited worksheet to new CSV document with comma (,) delimiter/separator",
		"comment_8": "Dispose all resources",
	}
  },
  "platforms": {
    "title": "Platform independence",
    "description": "GroupDocs.Editor for Java supports the following operating systems, frameworks, and package managers."
  },
  "code": {
    "title": "Edit documents in .NET",
    "more": "More examples",
    "notes": "See what’s new",
	"comment_1": "Pass source document to initialize the Editor",
	"comment_2": "Open document for edit",
	"comment_3": "Get document as HTML",
	"comment_4": "Edit document contents",
	"comment_5": "Load edited document from HTML",
	"comment_6": "Save edited document to file with desired format",
  }
}
