{
  "head": {
    "title": "C# .NET API редагування документа | Редагувати PDF, Word, Excel, Epub",
    "description": "C# .NET API редагування документів для редагування, перекладу та збереження сторінок документів із PDF, Microsoft Word, Excel, презентації, Visio та форматів зображень."
  },
  "header": {
    "title_1": "Редагувати документи",
    "title_2": "через .NET API",
    "description": "Потужний редактор API для маніпулювання PDF, Microsoft Office, HTML та файлів зображень.",
    "words": {
      "for": "для"
    }
  },
  "actions": {
    "main": "Безкоштовне завантаження Nuget",
    "alt": "Ліцензування",
    "title": "Готові розпочати?",
    "description": "Спробуйте функції groupdocs.editor безкоштовно або подайте запит на ліцензію."
  },
  "release": {
    "title": "Версія {0} випущена",
    "notes": "Подивіться, що нового",
    "downloads": "Завантаження"
  },
  "overview": {
    "title": "GroupDocs.editor з першого погляду",
    "description": "API для редагування, перекладу та збереження документів, слайдів та діаграм у .NET додатків.",
    "feature_1": {
      "title": "Без особливих зусиль редагувати кілька документів у C#",
      "description": "Безперешкодно редагувати кілька PDF та офісних файлів із підтримкою широкого спектру форматів. GroupDocs.editor для .NET робить редагування документів швидким та безпроблемним."
    },
    "feature_2": {
      "title": "Перекладіть документи на HTML/CSS",
      "description": "Перекладіть документи на розмітку HTML/CSS, сумісну з редакторами WYSIWYG, що дозволяє легко та ефективно редагувати документи у веб -середовищі."
    },
    "feature_3": {
      "title": "Зберегти відредаговані документи в різних форматах",
      "description": "Збережіть свої відредаговані документи до їх первісного формату або експортуйте їх на інші формати, такі як PDF, забезпечуючи гнучкість та сумісність."
    }
  },
  "formats": {
    "title": "Підтримувані формати файлів",
    "description": "GroupDocs.editor для .NET підтримує операції з наступними [Формати файлів] (https://docs.groupdocs.com/editor/net/supported-document-formats/).",
    "groups": {
      "title_1": "Формати Microsoft Office",
      "title_2": "Інші формати документів",
      "title_3": "Формати, пов'язані з веб-сайтом",
      "fixed_layout": "Форми з фіксованим шарами",
      "export_only": "лише експорт",
      "delimited_text_table": "Розмежовані текстові таблиці",
      "arbitrary_separator": "довільний сепаратор",
      "other_tables": "Інші формати таблиці",
      "format_images": "Зображення",
      "format_markup": "Розмітка",
      "format_email": "Формати електронної пошти"
    }
  },
  "features": {
    "title": "Особливості GroupDocs.editor",
    "description": "Безперешкодно редагувати та зберігати в різних форматах офісних документів, електронних листів, електронних книгах та PDF.",
    "feature_1": {
      "title": "Редагувати файли",
      "content": "Відредагуйте вміст різних форматів документів, включаючи PDF, DOCX, XLSX, PPTX тощо."
    },
    "feature_2": {
      "title": "Перекласти на HTML/CSS",
      "content": "Перетворити документи в HTML/CSS для легкого редагування за допомогою редакторів WYSIWYG, таких як CKeditor або Tinymce."
    },
    "feature_3": {
      "title": "Зберегти відредаговані документи",
      "content": "Збережіть відредагований HTML/CSS назад до оригінального формату документа або експорту до PDF."
    },
    "feature_4": {
      "title": "Виписати інформацію про документ",
      "content": "Витягніть інформацію, таку як кількість сторінок, розмір та статус шифрування з документів."
    },
    "feature_5": {
      "title": "Підтримка різних форматів",
      "content": "Відредагуйте широкий спектр форматів документів, включаючи файли Microsoft Office, PDF -файли тощо."
    },
    "feature_6": {
      "title": "Захист пароля",
      "content": "З легкості завантажувати та редагувати захищені паролем документи та захищати вихідні документи із захистом пароля."
    },
    "feature_7": {
      "title": "Редагувати електронну пошту",
      "content": "Редагувати та зберігати повідомлення та листи електронної пошти в MSG, EML, EMLX, Mbox та багатьох інших форматах, включаючи редагування метаданих, як предмет, до CC, BCC, від, назва, дата тощо."
    },
    "feature_8": {
      "title": "Видалення шрифту",
      "content": "Витягніть шрифти з документів, що обробляють Word, для використання в процесі редагування."
    },
    "feature_9": {
      "title": "Сторінки попереднього перегляду",
      "content": "Створити зображення зображень сторінок документів для кращого розуміння вмісту та структури."
    }
  },
  "code_samples": {
    "title": "Зразки коду",
    "description": "Деякі випадки типового груповогоDocs.editor для .NET операцій.",
    "sample_1": {
      "title": "Відредагуйте особливий робочий аркуш XLSX та збережіть його окремо та як частину оригінального документа",
      "content_1": "У документі електронної таблиці (наприклад, XLS, XLSX, XLSM, ODS тощо) може мати один або кілька робочих таблиць (вкладок). GroupDocs.editor дозволяє редагувати вміст одного робочого аркуша одночасно. Після редагування цей робочий аркуш може бути збережений до окремого документа з електронною таблицею (де буде збережено лише цей конкретний робочий аркуш), або GroupDocs.editor може вставити редагований робочий аркуш назад до оригінального документа, де він може замінити оригінальний робочий аркуш, або бути збереженим разом, а також оригінальний. Ось приклад того, як зберегти відредагований робочий аркуш усіма трьома способами. Детальніше про це [тут] (https://docs.groupdocs.com/editor/net/inserting-edited-worksheet-into-Existing-spreadsheet/).",
      "code_title": "Редагувати особливий робочий аркуш XLSX",
      "comment_1": "Створіть клас редактора, завантажуючи вхідний документ як шлях або потік",
      "comment_2": "Створіть та відрегулюйте параметри редагування",
      "comment_3": "Виберіть вкладку (робочий аркуш) для редагування на 0 індекс. Наприклад, редагувати 2 -й вкладку",
      "comment_4": "Відкрийте документ для редагування та отримання редагування"
    },
    "sample_2": {
      "title": "Редагувати захищений від пароля DOCX та збережіть його як захищений від пароля DOCX та PDF",
      "content_1": "GroupDocs.editor дозволяє співпрацювати з зашифрованими документами, захищеними паролем - він може відкрити такі файли, а також застосовувати захист пароля до вихідних документів. Цей приклад показує, як вказати пароль для редагування вхідного документа Docx, відредагуйте його вміст, а потім зберегти його у вихідному DOCX та PDF, а також захистити ці файли DOCX та PDF з різними паролями. Детальніше про це [тут] (https://docs.groupdocs.com/editor/net/output-format-and-password/).",
      "code_title": "Редагувати захищений від пароля DOCX та збережіть його як захищений від пароля DOCX та PDF"
    }
  },
  "platforms": {
    "title": "Незалежність платформи",
    "description": "GroupDocs.editor для .NET підтримує наступні операційні системи, рамки та менеджерів пакетів."
  },
  "code": {
    "title": "Редагувати файли документів у .NET",
    "more": "Більше прикладів",
    "notes": "Подивіться, що нового",
    "comment_1": "Створіть клас редактора, завантажуючи вхідний документ за його шляхом або потоком",
    "comment_2": "Відкрийте документ для редагування та отримання редагування",
    "comment_3": "Отримайте вміст документа як рядок, вбудований на Base64, з розміткою HTML та CSS всередині",
    "comment_4": "Надішліть цю розмітку HTML Wysiwyg-Editor, редагувати там та отримати відредагований вміст",
    "comment_5": "Створіть редагування з відредагованим вмістом документа",
    "comment_6": "Вкажіть параметри збереження та формат, а також збережіть відредагований документ у файлі або потоці",
    "comment_inner": "вміст документа після редагування"
  }
}