{
  "head": {
    "title": "C# .NET DOCUMTER Редактирование API | Редактировать PDF, Word, Excel, Epub",
    "description": "C# .NET EDITITION API API для редактирования, перевода и сохранения страниц документов из PDF, Microsoft Word, Excel, презентаций, VISIO и форматов изображений."
  },
  "header": {
    "title_1": "Редактировать документы",
    "title_2": "через .NET API",
    "description": "Мощный редактор API для манипулирования PDF, Microsoft Office, HTML и изображений.",
    "words": {
      "for": "для"
    }
  },
  "actions": {
    "main": "Бесплатно скачать Nuget",
    "alt": "Лицензирование",
    "title": "Готовы начать работу?",
    "description": "Попробуйте функции GroupDocs.editor бесплатно или запросите лицензию."
  },
  "release": {
    "title": "Версия {0} выпущена",
    "notes": "Посмотрите, что нового",
    "downloads": "Загрузки"
  },
  "overview": {
    "glance": "с первого взгляда",
    "description": "API для редактирования, перевода и сохранения документов, слайдов и диаграмм в приложениях .NET.",
    "feature_1": {
      "title": "Легко редактировать несколько документов в C#",
      "description1": "Безусловно редактировать несколько файлов PDF и офисных файлов с поддержкой широкого спектра форматов.",
      "description2": "делает документы быстро и без проблем."
    },
    "feature_2": {
      "title": "Перевести документы в HTML/CSS",
      "description": "Перевести документы на разметку HTML/CSS, совместимая с редакторами Wysiwyg, позволяя легко и эффективно редактировать документы в веб -среде."
    },
    "feature_3": {
      "title": "Сохранить отредактированные документы в различных форматах",
      "description": "Сохраните свои отредактированные документы обратно в их первоначальный формат или экспортируют их в другие форматы, такие как PDF, обеспечивая гибкость и совместимость."
    }
  },
  "formats": {
    "title": "Поддерживаемые форматы файлов",
    "description": "поддерживает операции со следующими",
    "file_formats": "Форматы файлов",
    "groups": {
      "title_1": "Microsoft Office Formats",
      "title_2": "Другие форматы документов",
      "title_3": "Связанные с Интернетом форматы",
      "fixed_layout": "Форматы с фиксированным лайатом",
      "export_only": "только экспорт",
      "delimited_text_table": "Разграниченные текстовые таблицы",
      "arbitrary_separator": "произвольный сепаратор",
      "other_tables": "Другие форматы таблицы",
      "format_images": "Изображения",
      "format_markup": "Разметка",
      "format_email": "Форматы электронной почты"
    }
  },
  "features": {
    "features": "функции",
    "description": "Бесполезно редактировать и сохранять в различных форматах офисных документов, электронных писем, электронных книг и PDF.",
    "feature_1": {
      "title": "Редактировать файлы",
      "content": "Измените содержание различных форматов документов, включая PDF, DOCX, XLSX, PPTX и многое другое."
    },
    "feature_2": {
      "title": "Перевести на HTML/CSS",
      "content": "Конвертируйте документы в HTML/CSS для удобного редактирования с помощью редакторов Wysiwyg, таких как Ckeditor или Tinymce."
    },
    "feature_3": {
      "title": "Сохранить отредактированные документы",
      "content": "Сохраните отредактированный HTML/CSS обратно в исходный формат документа или экспорт в PDF."
    },
    "feature_4": {
      "title": "Извлечь информацию о документе",
      "content": "Извлеките информацию, такую ​​как количество страниц, размер и статус шифрования из документов."
    },
    "feature_5": {
      "title": "Поддержка различных форматов",
      "content": "Отредактируйте широкий спектр форматов документов, включая файлы Microsoft Office, PDFS и многое другое."
    },
    "feature_6": {
      "title": "Защита пароля",
      "content": "Загрузите и редактируйте документы, защищенные паролем, с легкостью и защита выходных документов с защитой пароля."
    },
    "feature_7": {
      "title": "Редактировать электронную почту",
      "content": "Отредактируйте и сохраните сообщения электронной почты и буквы в MSG, EML, EMLX, Mbox и многих других форматах, включая редактирование метаданных, таких как субъект, CC, BCC, от, название, дата и так далее."
    },
    "feature_8": {
      "title": "Извлечение шрифта",
      "content": "Извлечь шрифты из документов WordProcessing для использования в процессе редактирования."
    },
    "feature_9": {
      "title": "Предварительный просмотр страниц",
      "content": "Создать изображения страниц документов, чтобы лучше понять контент и структуру."
    }
  },
  "code_samples": {
    "title": "Образцы кода",
    "description": "Некоторые варианты использования типичных операций с использованием",
    "sample_1": {
      "title": "Изменить конкретный рабочий лист XLSX и сохранить его отдельно и как часть оригинального документа",
      "content_1": "Документ электронной таблицы (например, XLS, XLSX, XLSM, ODS и так далее) может иметь один или несколько рабочих листов (вкладки). GroupDocs.editor позволяет редактировать контент одного рабочего листа за раз. После отредактирования этот рабочий лист может быть сохранен в отдельном документе электронной таблицы (где будет сохранен только этот конкретный рабочий лист), или GroupDocs.editor может вставить отредактированный рабочий лист обратно в оригинальный документ, где он может заменить оригинальный рабочий лист, либо сохранен вместе с оригинальным. Ниже приведен пример того, как сохранить отредактированный рабочий лист во всех трех способах. Подробнее об этом",
      "here": "здесь",
      "code_title": "Изменить конкретный рабочий лист XLSX",
      "comment_1": "Создать класс редактора путем загрузки входного документа в качестве пути или потока",
      "comment_2": "Создать и настроить параметры редактирования",
      "comment_3": "Выберите вкладку (рабочий лист), чтобы отредактировать по индексу на основе 0. Например, отредактируйте 2 -й вкладку",
      "comment_4": "Открыть документ для редактирования и получить EditableDocument"
    },
    "sample_2": {
      "title": "Редактировать защищенный паролем DOCX и сохранить его в качестве защищенного паролем DOCX и PDF",
      "content_1": "GroupDocs.editor позволяет работать с зашифрованными документами, защищенными паролем - он может открывать такие файлы, а также применять защиту пароля к выходным документам. В этом примере показано, как указать пароль для редактирования документа DOCX входного документа, отредактировать его контент, а затем сохранить его в вывод DOCX и PDF, а также для защиты этих файлов DOCX и PDF с различными паролями. Подробнее об этом",
      "here": "здесь",
      "code_title": "Редактировать защищенный паролем DOCX и сохранить его в качестве защищенного паролем DOCX и PDF"
    }
  },
  "platforms": {
    "title": "Независимость платформы",
    "description": "GroupDocs.editor для .NET поддерживает следующие операционные системы, фреймворки и менеджеры пакетов."
  },
  "code": {
    "title": "Редактировать файлы документов в .net",
    "more": "Больше примеров",
    "notes": "Посмотрите, что нового",
    "comment_1": "Создать класс редактора, загрузив входной документ по своему пути или потоку",
    "comment_2": "Открыть документ для редактирования и получить EditableDocument",
    "comment_3": "Получить содержимое документа в виде строки, встроенной Base64 с разметом HTML и CSS внутри",
    "comment_4": "Отправьте эту разметку в HTML Wysiwyg-Editor, отредактируйте и получите отредактированный контент",
    "comment_5": "Создать EditableDocument из отредактированного содержимого документа",
    "comment_6": "Укажите параметры сохранения и формат, и сохранить отредактированный документ в файле или потоке",
    "comment_inner": "Содержание документа после редактирования"
  }
}