{
  "head": {
    "title": "C# .NET Document Editor API | แก้ไข PDF, Word, Excel, PowerPoint",
    "description": "C# .NET Document Editor API เพื่อแก้ไขแปลและบันทึกหน้าเอกสารจาก PDF, Microsoft Word, Excel, PowerPoint, ebook และรูปแบบอีเมล"
  },
  "header": {
    "title_1": "แก้ไขเอกสาร",
    "title_2": "ผ่าน. NET API",
    "description": "ENTEN DOCION EDITOR API ที่ทรงพลังเพื่อจัดการกับ Microsoft Office, PDF, HTML, EBOOK และไฟล์อีเมล",
    "words": {
      "for": "สำหรับ"
    }
  },
  "actions": {
    "main": "ดาวน์โหลด Nuget ฟรี",
    "alt": "การออกใบอนุญาต",
    "title": "พร้อมที่จะเริ่มต้น?",
    "description": "ลองใช้คุณสมบัติ GroupDocs.Editor ฟรีหรือขอใบอนุญาต"
  },
  "release": {
    "title": "เวอร์ชัน {0} เปิดตัว",
    "notes": "ดูมีอะไรใหม่",
    "downloads": "การดาวน์โหลด"
  },
  "overview": {
    "glance": "อย่างเหลือบ",
    "description": "API เพื่อแก้ไขแปลงและบันทึกเอกสารสเปรดชีตสไลด์และหนังสืออิเล็กทรอนิกส์ในแอปพลิเคชัน. NET",
    "feature_1": {
      "title": "แก้ไขเอกสารหลายฉบับได้อย่างง่ายดายใน C#",
      "description1": "แก้ไขไฟล์ PDF และสำนักงานหลายไฟล์ได้อย่างราบรื่นด้วยการสนับสนุนสำหรับรูปแบบที่หลากหลาย",
      "description2": "ทำให้การแก้ไขเอกสารอย่างรวดเร็วและไม่ยุ่งยาก"
    },
    "feature_2": {
      "title": "แปลงเอกสารเป็น HTML/CSS",
      "description": "แปลงเอกสารเป็นมาร์กอัพ HTML/CSS บริสุทธิ์ที่เข้ากันได้กับตัวแก้ไข WYSIWYG ช่วยให้การแก้ไขเอกสารง่ายและมีประสิทธิภาพในสภาพแวดล้อมเว็บ"
    },
    "feature_3": {
      "title": "บันทึกเอกสารที่แก้ไขในรูปแบบต่างๆ",
      "description": "บันทึกเอกสารที่แก้ไขของคุณกลับไปเป็นรูปแบบดั้งเดิมหรือส่งออกไปยังรูปแบบอื่น ๆ เช่น PDF เพื่อให้มั่นใจถึงความยืดหยุ่นและความเข้ากันได้"
    }
  },
  "formats": {
    "title": "รูปแบบไฟล์ที่รองรับ",
    "description": "GroupDocs.Editor รองรับการดำเนินงานด้วยรูปแบบไฟล์ต่อไปนี้เกี่ยวกับการนำเข้าและส่งออก",
    "full_list": "รายการทั้งหมด",
    "groups": {
      "title_1": "รูปแบบ Microsoft Office",
      "title_2": "รูปแบบเอกสารอื่น ๆ",
      "title_3": "รูปแบบที่เกี่ยวข้องกับเว็บ",
      "fixed_layout": "รูปแบบ layout คงที่",
      "export_only": "ส่งออกเท่านั้น",
      "delimited_text_table": "ตารางข้อความคั่น",
      "arbitrary_separator": "ตัวแยกตามอำเภอใจ",
      "other_tables": "รูปแบบตารางอื่น ๆ",
      "format_markup": "มาร์กอัป",
      "format_email": "รูปแบบอีเมล"
    }
  },
  "features": {
    "features": "คุณสมบัติหลัก",
    "description": "โหลด, แก้ไขและบันทึกในรูปแบบที่แตกต่างกันเอกสารสำนักงาน, อีเมล, ebooks และ PDF",
    "feature_1": {
      "title": "แก้ไขไฟล์",
      "content": "แก้ไขเนื้อหาของรูปแบบเอกสารต่าง ๆ รวมถึง PDF, DOCX, XLSX, PPTX และอื่น ๆ"
    },
    "feature_2": {
      "title": "แปลเป็น html/css",
      "content": "แปลงเอกสารเป็น HTML/CSS เพื่อให้ง่ายต่อการแก้ไขด้วยบรรณาธิการ WYSIWYG เช่น CKEditor หรือ Tinymce"
    },
    "feature_3": {
      "title": "บันทึกเอกสารที่แก้ไข",
      "content": "บันทึก HTML/CSS ที่แก้ไขกลับไปยังรูปแบบเอกสารต้นฉบับหรือส่งออกไปยัง PDF"
    },
    "feature_4": {
      "title": "แยกข้อมูลเอกสาร",
      "content": "แยกข้อมูลเช่นจำนวนหน้าขนาดและสถานะการเข้ารหัสจากเอกสาร"
    },
    "feature_5": {
      "title": "สนับสนุนรูปแบบต่างๆ",
      "content": "แก้ไขรูปแบบเอกสารที่หลากหลายรวมถึงไฟล์ Microsoft Office, PDF และอื่น ๆ"
    },
    "feature_6": {
      "title": "การป้องกันรหัสผ่าน",
      "content": "โหลดและแก้ไขเอกสารที่ป้องกันด้วยรหัสผ่านได้อย่างง่ายดายและปกป้องเอกสารเอาต์พุตด้วยการป้องกันรหัสผ่าน"
    },
    "feature_7": {
      "title": "แก้ไขอีเมล",
      "content": "แก้ไขและบันทึกข้อความอีเมลและตัวอักษรในผงชูรส, EML, EMLX, Mbox และรูปแบบอื่น ๆ อีกมากมายรวมถึงการแก้ไขข้อมูลเมตาเช่นหัวข้อ, TO, CC, BCC, จาก, ชื่อ, วันที่และอื่น ๆ"
    },
    "feature_8": {
      "title": "การสกัดแบบอักษร",
      "content": "แยกฟอนต์จากเอกสารการประมวลผลคำเพื่อใช้ในกระบวนการแก้ไข"
    },
    "feature_9": {
      "title": "หน้าตัวอย่าง",
      "content": "สร้างภาพการแสดงภาพของหน้าเอกสารเพื่อทำความเข้าใจเนื้อหาและโครงสร้างที่ดีขึ้น"
    }
  },
  "code_samples": {
    "title": "ตัวอย่างรหัส",
    "description": "บางกรณีการใช้งานของการดำเนินการทั่วไปโดยใช้",
    "sample_1": {
      "title": "แทนที่ข้อความใน docx",
      "description": "ตัวอย่างนี้แสดงการโหลดและแก้ไขเนื้อหาของไฟล์ DOCX อินพุตโดยทางโปรแกรมโดยการแทนที่เนื้อหาข้อความบนอื่น หลังจากนั้นเนื้อหาเอกสารที่แก้ไขจะถูกบันทึกกลับมาเป็นเอกสาร DOCX ใหม่",
      "code_title": "แก้ไขอินพุต docx โดยแทนที่ข้อความและบันทึกกลับไปที่ docx",
      "comment_1": "โหลดเอกสารอินพุตตามเส้นทางและระบุตัวเลือกการโหลดหากจำเป็น",
      "comment_2": "เปิดเอกสารสำหรับแก้ไขและรับ \"EditableDocument\"",
      "comment_3": "แทนที่ข้อความ - สิ่งนี้เลียนแบบการแก้ไขเนื้อหา",
      "comment_4": "สร้างอินสแตนซ์ \"EditableDocument\" ใหม่จากเนื้อหาที่แก้ไข",
      "comment_5": "เตรียมตัวเลือกบันทึกด้วย output formatx ที่ต้องการ",
      "comment_6": "บันทึกเนื้อหาเอกสารที่แก้ไขไปยัง DOCX",
      "comment_7": "กำจัดทรัพยากรทั้งหมด"
    },
    "sample_4": {
      "title": "แก้ไขเนื้อหาของแผ่นงาน Excel โดยเฉพาะ",
      "description": "เอกสารสเปรดชีต (เช่น XLS, XLSX, XLSM, ODS และอื่น ๆ ) อาจมีเวิร์กชีท (แท็บ) อย่างน้อยหนึ่งแผ่น GroupDocs.editor อนุญาตให้แก้ไขเนื้อหาของแผ่นงานหนึ่งครั้งในแต่ละครั้ง หลังจากได้รับการแก้ไขแผ่นงานนี้อาจถูกบันทึกลงในเอกสารสเปรดชีตแยกต่างหาก (ซึ่งจะมีการบันทึกแผ่นงานเฉพาะนี้เท่านั้น) หรือแผ่นงานแก้ไขสามารถแทรกกลับไปยังเอกสารต้นฉบับได้ซึ่งสามารถแทนที่แผ่นงานดั้งเดิมหรือบันทึกไว้ด้วยกัน ตัวอย่างนี้แสดงการโหลดเอกสาร XLSX แก้ไขแผ่นงานที่ 2 และบันทึกเป็นเอกสารใหม่แยกต่างหากในรูปแบบ XLSX และ CSV",
      "code_title": "แก้ไขแผ่นงานเฉพาะของ XLSX และบันทึกเป็น XLSX และ CSV",
      "comment_1": "โหลดอินพุต XLSX ตามเส้นทางและระบุตัวเลือกโหลดหากจำเป็น",
      "comment_2": "สร้างและปรับตัวเลือกแก้ไข - ตั้งค่าแผ่นงานที่ 2 เป็นแก้ไข",
      "comment_3": "เปิดแผ่นงานที่ 2 นี้เพื่อแก้ไขและรับ \"EditableDocument\"",
      "comment_4": "แทนที่ข้อความ - สิ่งนี้เลียนแบบการแก้ไขเนื้อหา",
      "comment_5": "สร้างอินสแตนซ์ \"EditableDocument\" ใหม่จากแผ่นงานที่แก้ไขแล้ว",
      "comment_6": "บันทึกแผ่นงานแก้ไขไปยังเอกสาร XLSX ใหม่",
      "comment_7": "บันทึกแผ่นงานที่แก้ไขไปยังเอกสาร CSV ใหม่ด้วยเครื่องหมายจุลภาค (,) คั่น/ตัวคั่น",
      "comment_8": "กำจัดทรัพยากรทั้งหมด"
    },
    "sample_2": {
      "title": "แทนที่ข้อความใน PDF",
      "description": "ตัวอย่างนี้แสดงการโหลดและแก้ไขเนื้อหาของไฟล์ PDF อินพุตโดยทางโปรแกรมโดยการแทนที่เนื้อหาข้อความบนอื่น หลังจากนั้นเนื้อหาเอกสารที่แก้ไขจะถูกบันทึกกลับเป็นเอกสาร PDF ใหม่",
      "code_title": "แก้ไขอินพุต PDF โดยแทนที่ข้อความและบันทึกกลับไปที่ PDF",
      "comment_1": "โหลดไฟล์ PDF ตามเส้นทางและระบุตัวเลือกโหลด PDF",
      "comment_2": "เปิดเอกสารสำหรับแก้ไขและรับ \"EditableDocument\"",
      "comment_3": "แทนที่ข้อความ - สิ่งนี้เลียนแบบการแก้ไขเนื้อหา",
      "comment_4": "สร้างอินสแตนซ์ \"EditableDocument\" ใหม่จากเนื้อหาที่แก้ไข",
      "comment_5": "บันทึกเนื้อหาเอกสารที่แก้ไขไปยัง PDF",
      "comment_6": "กำจัดทรัพยากรทั้งหมด"
    }
  },
  "platforms": {
    "title": "ความเป็นอิสระของแพลตฟอร์ม",
    "description": "รองรับระบบปฏิบัติการเฟรมเวิร์กและผู้จัดการแพ็คเกจ"
  },
  "code": {
    "title": "แก้ไขเอกสารใน. NET",
    "more": "ตัวอย่างเพิ่มเติม",
    "notes": "ดูมีอะไรใหม่",
    "comment_1": "เอกสารแหล่งที่มาเพื่อเริ่มต้นโปรแกรมแก้ไข",
    "comment_2": "เปิดเอกสารสำหรับแก้ไข",
    "comment_3": "รับเอกสารเป็น html",
    "comment_4": "แก้ไขเนื้อหาเอกสาร",
    "comment_5": "โหลดเอกสารที่แก้ไขจาก HTML",
    "comment_6": "บันทึกเอกสารที่แก้ไขเป็นไฟล์ด้วยรูปแบบที่ต้องการ"
  }
}