{
  "head": {
    "title": "API de l'éditeur de documents C# .NET | Modifier Word Excel PowerPoint Web XML en utilisant HTML",
    "description": "API de l'éditeur de documents C# .NET pour charger les formats de fichiers Microsoft Word, Excel, PowerPoint, PDF, XML, Web et texte en HTML, manipuler et reconvertir au format d'origine."
  },
  "header": {
    "title": "API .NET pour modifier des documents à l'aide de HTML",
    "description": "Développer des applications .NET, à intégrer à l'éditeur HTML, récupérer le document pris en charge, modifier et convertir au format d'origine."
  },
  "Submenu": {
    "middle": {
      "button_overview": {
        "text": "Aperçu"
      },
      "button_features": {
        "text": "Fonctionnalités"
      },
      "button_support": {
        "text": "Soutien"
      },
      "button_livedemo": {
        "text": "Démo en direct"
      },
      "button_pricing": {
        "text": "Tarification"
      }
    }
  },
  "Overview": {
    "content": "L'API GroupDocs.Editor pour .NET vous aide à créer des applications C#, ASP.NET et d'autres applications .NET simples et faciles à utiliser qui s'intègrent facilement aux éditeurs HTML populaires (à la fois open-source et payants) pour convertir, éditer et manipuler des documents de formats de fichiers populaires. Notre API .NET Editor vous permet de charger le document, de le convertir en HTML, de pousser le HTML vers un éditeur HTML externe et, une fois la manipulation effectuée, d'enregistrer le HTML dans son format de fichier d'origine. Vous pouvez également récupérer séparément les ressources jointes à n'importe quel document. Il fonctionne avec toutes sortes de documents, tels que ceux pour Microsoft Word, Excel, PowerPoint, PDF, XPS, OpenDocument, Texte, Web, Email, e-Book et plus encore.",
    "tab1": {
      "description": "Voici un aperçu de GroupDocs.Editor pour .NET",
      "title": "Manipuler à l'aide de HTML",
      "content1": "Charger le document pris en charge",
      "content2": "Modifier le contenu à l'aide de HTML",
      "content3": "Modifier les styles associés",
      "content4": "Convertir au format d'origine"
    },
    "tab2": {
      "description": "GroupDocs.Editor pour .NET prend en charge les [formats de fichier] suivants (https://docs.groupdocs.com/editor/java/supported-document-formats/)",
      "title": "Autres familles de formats",
      "content1": "Formats OpenDocument",
      "content2": "Formats à mise en page fixe",
      "content3": "Formats Web",
      "content4": "Formats de livres électroniques (e-Book)"
    },
    "tab3": {
      "description": "GroupDocs.Editor pour .NET prend en charge les systèmes d'exploitation, les cadres et les gestionnaires de packages suivants",
      "title_os": "Systèmes d'exploitation",
      "title_frameworks": "Cadres pris en charge",
      "title_packman": "Gestionnaires de packages",
      "title_devenv": "Environnements de développement"
    }
  },
  "Features": {
    "title": "GroupDocs.Editor pour les fonctionnalités .NET",
    "feature_loop": {
      "1": "Intégration facile avec n'importe quel éditeur HTML",
      "2": "Convertir un document en HTML DOM",
      "3": "Récupérer le contenu HTML du flux de documents",
      "4": "Obtenez du contenu HTML et ses ressources intégrées",
      "5": "Obtenir le contenu de la balise de corps HTML à partir du document",
      "6": "Obtenir les feuilles de style CSS du document HTML",
      "7": "Parcourez le contenu HTML et enregistrez ses ressources",
      "8": "Récupérer le DOM HTML à partir du contenu de la chaîne et convertir en document",
      "9": "HTML DOM avec conversion des ressources",
      "10": "Modifier des documents de différents formats en HTML",
      "11": "Conversion précise",
      "12": "Appliquer la protection en lecture et/ou en écriture au document résultant",
      "13": "Paginez les documents de traitement de texte et modifiez-les dans n'importe quel éditeur WYSIWYG",
      "14": "Indépendant de la base de données (DB) et de l'interface utilisateur (UI)",
      "15": "Puissantes fonctionnalités de traitement XML",
      "16": "Récupérer OTF (Open Type Fonts) à partir des documents d'entrée et exporter vers le document résultant",
      "17": "Traiter les images raster et vectorielles en interne dans les formats de document d'entrée pris en charge",
      "18": "Insérer le contenu de la feuille de calcul modifiée dans la feuille de calcul d'origine à la position souhaitée",
      "19": "Modifier les diapositives et les insérer dans la feuille de calcul résultante",
      "20": "Incorporer des polices dans le document de traitement de texte résultant lors de l'enregistrement"
    },
    "more_features_loop": {
      "title1": "Conversion précise vers et depuis HTML DOM",
      "content1": "GroupDocs.Editor pour l'API .NET permet à vos applications .NET de récupérer un document au format pris en charge et de le convertir en un modèle d'objet de document (DOM) HTML avec l'extraction des ressources attachées, telles que CSS. Vous pouvez ensuite apporter les modifications au code HTML à l'aide de votre éditeur HTML préféré. Une fois que vous avez terminé l'édition, GroupDocs.Editor pour l'API .NET vous permet de reconvertir avec précision ce DOM HTML dans le fichier d'origine.",
      "title2": "Charger et extraire des ressources externes",
      "content2": "L'API GroupDocs.Editor pour .NET est capable de récupérer les ressources externes attachées aux documents pris en charge, tels que les images, les polices, le CSS, etc. Les ressources extraites peuvent ensuite être chargées, parcourues et enregistrées séparément du document HTML résultant. Cela vous donne une sortie plus facilement gérée.",
      "title3": "Appliquer des effets de texte dans les formats de fichier de traitement de texte",
      "content3": "L'API de l'éditeur de documents GroupDocs permet d'ajouter des effets de texte complexes (ombre, effet 3D, contour, lueur, gravure, relief) tout en travaillant avec les formats de traitement de documents Microsoft Word pris en charge. Cette fonctionnalité est activée automatiquement et peut être observée lors du traitement du document avec de tels effets de texte.",
      "title4": "Puissantes fonctionnalités de manipulation XML",
      "content4-1": "À l'aide de GroupDocs.Editor pour l'API .NET, vous pouvez ouvrir, afficher et modifier des documents XML. Notre API d'édition offre une prise en charge et une reconnaissance spéciales des balises XML, des attributs avec leurs valeurs, des déclarations XML, des sections CDATA, des définitions DOCTYPE et d'autres entités spécifiques XML. Vous pouvez personnaliser les paramètres de police et de couleur pour chaque entité distincte dans la structure XML.",
      "content4-2": "La fonctionnalité XML Converter est suffisamment intelligente pour afficher les erreurs dans le fichier XML et comment les corriger. Le mécanisme de reconnaissance d'URI et d'e-mail analyse les attributs XML et représente les URI et les adresses e-mail détectés à l'intérieur de la balise A sous forme de liens afin qu'ils puissent être modifiés en tant que lien, et non en tant que texte dans le fichier HTML résultant."
    }
  },
  "Solutions": {
    "title": "GroupDocs.Editor propose des API d'édition de documents pour d'autres environnements de développement populaires"
  }
}