{
  "head": {
    "title": "C# .NET ตัวแก้ไขเอกสาร API | แก้ไข Word Excel PowerPoint Web XML โดยใช้ HTML",
    "description": "API ตัวแก้ไขเอกสาร C# .NET เพื่อโหลด Microsoft Word, Excel, PowerPoint, PDF, XML, รูปแบบไฟล์เว็บและข้อความเป็น HTML จัดการและแปลงกลับเป็นรูปแบบดั้งเดิม"
  },
  "header": {
    "title": ".NET API เพื่อแก้ไขเอกสารโดยใช้ HTML",
    "description": "พัฒนาแอปพลิเคชัน .NET เพื่อผสานรวมกับโปรแกรมแก้ไข HTML ดึงเอกสารที่รองรับ แก้ไขและแปลงเป็นรูปแบบต้นฉบับ"
  },
  "Submenu": {
    "middle": {
      "button_overview": {
        "text": "ภาพรวม"
      },
      "button_features": {
        "text": "คุณสมบัติ"
      },
      "button_support": {
        "text": "สนับสนุน"
      },
      "button_livedemo": {
        "text": "สาธิตสด"
      },
      "button_pricing": {
        "text": "ราคา"
      }
    }
  },
  "Overview": {
    "content": "GroupDocs.Editor สำหรับ .NET API ช่วยให้คุณสร้าง C#, ASP.NET และแอปพลิเคชัน .NET อื่นๆ ที่ใช้งานง่ายและสะดวก ซึ่งรวมเข้ากับโปรแกรมแก้ไข HTML ยอดนิยม (ทั้งแบบโอเพ่นซอร์สและแบบชำระเงิน) เพื่อแปลง แก้ไข และจัดการเอกสารของ รูปแบบไฟล์ยอดนิยม .NET Editor API ของเราให้คุณโหลดเอกสาร แปลงเป็น HTML พุช HTML เป็น HTML Editor ภายนอก และเมื่อจัดการเสร็จแล้ว จะบันทึก HTML เป็นรูปแบบไฟล์ดั้งเดิม คุณยังสามารถดึงทรัพยากรที่แนบมากับเอกสารแยกกันได้ ใช้งานได้กับเอกสารทุกประเภท เช่น Microsoft Word, Excel, PowerPoint, PDF, XPS, OpenDocument, Text, Web, Email, e-Book และอื่นๆ",
    "tab1": {
      "description": "ต่อไปนี้เป็นภาพรวมของ GroupDocs.Editor สำหรับ .NET",
      "title": "จัดการโดยใช้ HTML",
      "content1": "โหลดเอกสารที่รองรับ",
      "content2": "แก้ไขเนื้อหาโดยใช้ HTML",
      "content3": "แก้ไขรูปแบบที่เกี่ยวข้อง",
      "content4": "แปลงเป็นรูปแบบดั้งเดิม"
    },
    "tab2": {
      "description": "GroupDocs.Editor สำหรับ .NET รองรับ [รูปแบบไฟล์] ต่อไปนี้ (https://docs.groupdocs.com/editor/java/supported-document-formats/)",
      "title": "ตระกูลรูปแบบอื่นๆ",
      "content1": "รูปแบบ OpenDocument",
      "content2": "รูปแบบเค้าโครงคงที่",
      "content3": "รูปแบบเว็บ",
      "content4": "รูปแบบหนังสืออิเล็กทรอนิกส์ (e-Book)"
    },
    "tab3": {
      "description": "GroupDocs.Editor สำหรับ .NET รองรับระบบปฏิบัติการ กรอบงาน & ตัวจัดการแพ็คเกจต่อไปนี้",
      "title_os": "ระบบปฏิบัติการ",
      "title_frameworks": "กรอบงานที่รองรับ",
      "title_packman": "ผู้จัดการแพ็คเกจ",
      "title_devenv": "สภาพแวดล้อมการพัฒนา"
    }
  },
  "Features": {
    "title": "GroupDocs.Editor สำหรับ .NET Features",
    "feature_loop": {
      "1": "ผสานรวมกับโปรแกรมแก้ไข HTML ใด ๆ ได้ง่าย",
      "2": "แปลงเอกสารเป็น HTML DOM",
      "3": "ดึงเนื้อหา HTML จากสตรีมเอกสาร",
      "4": "รับเนื้อหา HTML และทรัพยากรที่ฝังตัว",
      "5": "รับเนื้อหาแท็กเนื้อหา HTML จากเอกสาร",
      "6": "รับสไตล์ชีต CSS ของเอกสาร HTML",
      "7": "สำรวจเนื้อหา HTML และบันทึกทรัพยากร",
      "8": "ดึง HTML DOM จากเนื้อหาสตริง & แปลงเป็นเอกสาร",
      "9": "HTML DOM พร้อมกับการแปลงทรัพยากร",
      "10": "แก้ไขเอกสารรูปแบบต่างๆ ใน ​​HTML",
      "11": "การแปลงที่แม่นยำ",
      "12": "ใช้การป้องกันการอ่านและ/หรือการเขียนกับเอกสารผลลัพธ์",
      "13": "แบ่งหน้าเอกสารการประมวลผลคำและแก้ไขใน WYSIWYG Editors",
      "14": "ฐานข้อมูล (DB) & ส่วนต่อประสานผู้ใช้ (UI) ไม่เชื่อเรื่องพระเจ้า",
      "15": "คุณสมบัติการประมวลผล XML อันทรงพลัง",
      "16": "ดึง OTF (แบบอักษรแบบเปิด) จากเอกสารอินพุตและส่งออกไปยังเอกสารผลลัพธ์",
      "17": "ประมวลผลภาพแรสเตอร์และเวกเตอร์ภายในรูปแบบเอกสารอินพุตที่รองรับ",
      "18": "แทรกเนื้อหาของเวิร์กชีตที่แก้ไขแล้วลงในสเปรดชีตต้นฉบับในตำแหน่งที่ต้องการ",
      "19": "แก้ไขสไลด์และแทรกลงในสเปรดชีตที่เป็นผลลัพธ์",
      "20": "ฝังแบบอักษรในเอกสารการประมวลผลคำที่เป็นผลลัพธ์ขณะบันทึก"
    },
    "more_features_loop": {
      "title1": "การแปลงที่ถูกต้องเป็นและจาก HTML DOM",
      "content1": "GroupDocs.Editor สำหรับ .NET API ช่วยให้แอปพลิเคชัน .NET ของคุณสามารถดึงเอกสารที่มีรูปแบบที่รองรับและแปลงเป็น HTML Document Object Model (DOM) พร้อมกับการแยกทรัพยากรที่แนบมา เช่น CSS จากนั้น คุณสามารถทำการแก้ไข HTML โดยใช้ตัวแก้ไข HTML ที่คุณชื่นชอบ เมื่อคุณแก้ไขเสร็จแล้ว GroupDocs.Editor สำหรับ .NET API จะช่วยให้คุณแปลง HTML DOM นี้กลับเป็นไฟล์ต้นฉบับได้อย่างแม่นยำ",
      "title2": "โหลดและแยกทรัพยากรภายนอก",
      "content2": "GroupDocs.Editor สำหรับ .NET API สามารถดึงทรัพยากรภายนอกที่แนบมากับเอกสารที่รองรับ เช่น รูปภาพ แบบอักษร CSS และอื่นๆ จากนั้น ทรัพยากรที่ดึงมาจะสามารถโหลด ข้ามผ่าน และบันทึกแยกจากเอกสาร HTML ที่เป็นผลลัพธ์ได้ สิ่งนี้ช่วยให้คุณจัดการเอาต์พุตได้ง่ายขึ้น",
      "title3": "ใช้เอฟเฟกต์ข้อความภายในรูปแบบไฟล์ประมวลผลคำ",
      "content3": "API ตัวแก้ไขเอกสาร GroupDocs ช่วยเพิ่มเอฟเฟกต์ข้อความที่ซับซ้อน (เงา, เอฟเฟกต์ 3 มิติ, โครงร่าง, เรืองแสง, แกะสลัก, ลายนูน) ในขณะที่ทำงานกับรูปแบบการประมวลผลเอกสาร Microsoft Word ที่รองรับ คุณลักษณะนี้เปิดใช้งานโดยอัตโนมัติซึ่งสามารถสังเกตได้เมื่อมีการประมวลผลเอกสารที่มีเอฟเฟกต์ข้อความดังกล่าว",
      "title4": "คุณสมบัติการจัดการ XML ที่มีประสิทธิภาพ",
      "content4-1": "การใช้ GroupDocs.Editor สำหรับ .NET API คุณสามารถเปิด ดู และแก้ไขเอกสาร XML ได้ API การแก้ไขของเราให้การสนับสนุนพิเศษและการรับรู้แท็ก XML แอตทริบิวต์พร้อมกับค่า การประกาศ XML ส่วน CDATA คำจำกัดความ DOCTYPE และเอนทิตีเฉพาะ XML อื่นๆ คุณสามารถปรับแต่งการตั้งค่าแบบอักษรและสีสำหรับทุกเอนทิตีที่แตกต่างกันในโครงสร้าง XML",
      "content4-2": "ฟีเจอร์ XML Converter นั้นฉลาดพอที่จะแสดงข้อผิดพลาดในไฟล์ XML และวิธีแก้ไข กลไก URI และตัวจำแนกอีเมลจะสแกนแอตทริบิวต์ XML และแสดง URI และที่อยู่อีเมลที่ตรวจพบภายในแท็ก A เป็นลิงก์ เพื่อให้สามารถแก้ไขได้เป็นลิงก์ ไม่ใช่เป็นข้อความภายในไฟล์ HTML ที่เป็นผลลัพธ์"
    }
  },
  "Solutions": {
    "title": "GroupDocs.Editor เสนอ API การแก้ไขเอกสารสำหรับสภาพแวดล้อมการพัฒนายอดนิยมอื่นๆ"
  }
}