{
    "head": {
        "title": "API редактора документів Java | Редагувати Word Excel PowerPoint Web XML текстові файли за допомогою HTML",
        "description": "API редактора документів для Java. Завантажити Microsoft Word, Excel, PowerPoint, e-Book, XML, веб та текстові файли в HTML, відредагувати та конвертувати назад у вихідний формат після правки."
    },
	"header": {
		"title": "Редагувати документи через HTML за допомогою Java API",
		"description": "Інтегруйте Java-застосунки із HTML-редактором, аби редагувати документи та конвертувати їх назад у початковий формат."
	},
	"Submenu": {
		"middle" : {
			"button_overview": {
				"text": "Огляд"
			},
			"button_features": {
				"text": "Функції"
			},
			"button_support": {
				"text": "Підтримка"
			},
			"button_livedemo": {
				"text": "Живі демонстрації"
			},
			"button_pricing": {
				"text": "Ціни"
			}
		}
	},
	"Overview": {
		"content": "GroupDocs.Editor for Java API дозволяє редагувати документи у їх HTML-представленні. API підтримує кілька форматів документів та може бути інтегроване із любим зовнішнім, відкритим чи платним HTML-редактором. API редактору завантажить документи, конвертує їх у HTML, відправить HTML у зовнішній користувацький інтефейс, а потім збереже цей відредагований HTML у формат вихідного документу після обробки. Його також можна використовувати для створення різних електронних таблиць Microsoft Word, Excel, файлов PowerPoint, форматів OpenDocument, документів XML та TXT.",
		"tab1": {
			"description": "Нижче наводиться огляд GroupDocs.Editor for Java",
			"title": "Управління за допомогою HTML",
			"content1": "Завантажити підтримуваний документ",
			"content2": "Редагувати контент за допомогою HTML",
			"content3": "Редагувати зв'язані стилі",
			"content4": "Конвертувати у початковий формат"
		},
		"tab2": {
			"description": "GroupDocs.Editor for Java підтримує наступні [формати файлів](https://docs.groupdocs.com/editor/java/supported-document-formats/)",
			"title": "Інші сімейства форматів",
			"content1": "Формати OpenDocument",
			"content2": "Формати електронної почти",
			"content3": "Веб-формати",
			"content4": "Формати електронних книг (e-Book)"
		},
		"tab3": {
			"description": "GroupDocs.Editor for Java підтримує наступні операційні системи, фреймворки та менеджери пакетів",
			"title_os": "Операційні системи",
			"title_frameworks": "Підтримувані фреймворки",
			"title_packman": "Інструменти автоматизації збірки",
			"title_devenv": "Середовища розробки"
		}
	},
	"Features": {
		"title": "Можливості GroupDocs.Editor for Java",
		"feature_loop": {
			"1": "Проста інтеграція із HTML-редактором",
			"2": "Конверитація документу у HTML DOM",
			"3": "Екстрагування вмісту HTML із потоку із вмістом документу",
			"4": "Завантажте, редагуйте та зберігайте формати файлів Word, Excel и PowerPoint",
			"5": "Екстрагування HTML разом із вбудованими елементами",
			"6": "Імпорт, перегляд та редагування XML-документів",
			"7": "Обхід HTML-контенту та збереження вбудованих ресурсів",
			"8": "Перегляд, редагування та збереження текстових документів у посторінковому режимі",
			"9": "Отримання вмісту тегу HTML BODY із файлу",
			"10": "Видобути вміст CSS із файлу HTML",
			"11": "Використовуйте вміст текстової строки для отримання HTML DOM і перетворення його у файл",
			"12": "Перетворення HTML DOM із вбудованими елементами",
			"13": "Перетворення файлів кількох форматів у HTML для редагування",
			"14": "Отримання метаінформації про вхідні документи без їх редагування",
			"15": "Збереження відредагованих документів у форматі звичайного текстового файлу",
			"16": "Точність конвертації",
			"17": "Застосувати пароль до вихідного документу",
			"18": "Незалежність від баз даних",
			"19": "Незалежність від користувацького інтерфейсу",
			"20": "Підтримує Metered-ліцензування"
		},
		"more_features_loop": {
			"title1": "Точна конвертація у HTML DOM та із нього",
			"content1": "Використання GroupDocs.Editor for Java дозволяє створювати додатки на Java, котрі завантажують документ, що належить до одного із підтримуваних форматів файлів, для конвертації його у об'єктну модель документу HTML (DOM) разом із пов'язаними із ним ресурсами, наприклад, CSS. Окрім того, наш Java API редактору дозволяє редагувати HTML в любому із популярних HTML-редакторів. Після внесення необхідних змін GroupDocs.Editor for Java допоможе вам переконвертувати отриманий HTML-код назад у оригінальний формат файлу.",
			"title2": "Завантаження та вибірка асоційованих елементів",
			"content2": "GroupDocs.Editor for Java API дозволяє екстрагувати зв'язані елементи із документів підтримуваних форматів, таких як зображення, CSS, шрифти тощо. Потім ви можете завантажити ці екстраговані пов'язані елементи, переглянути їх та зберегти окремо від концевого HTML-файлу і отримати добре керований вивід."
		}
	},
	"Solutions": {
		"title": "GroupDocs.Editor пропонує API редагування документів для інших популярних середовищ розробки."
	}
}