{
    "head": {
        "title": "API редактора документов на C# .NET | Редактировать Word Excel PowerPoint Web XML с помощью HTML",
        "description": "Редактор документов с API на C# .NET позволяет загружать документы Microsoft Word, Excel, PowerPoint, PDF, XML, веб-ориентированные и тектовые файлы в HTML, редактировать их в браузере и конвертировать назад в исходный формат."
    },
	"header": {
		"title": ".NET API для редактирования документов с использованием HTML",
		"description": "Разрабатывайте .NET-приложения, интегрируйте их с HTML-редактором, загружайте документы поддерживаемых форматов, редактируйте их и конвертируйте назад в исходный формат."
	},
	"Submenu": {
		"middle" : {
			"button_overview": {
				"text": "Обзор"
			},
			"button_features": {
				"text": "Функции"
			},
			"button_support": {
				"text": "Поддержка"
			},
			"button_livedemo": {
				"text": "Живие примеры"
			},
			"button_pricing": {
				"text": "Цены"
			}
		}
	},
	"Overview": {
		"content": "GroupDocs.Editor for .NET API помогает создавать простые и удобные в использовании приложения C#, ASP.NET и другие приложения .NET, которые легко интегрируются с популярными HTML-редакторами (как с открытым исходным кодом, так и платными) для преобразования, редактирования и управления документами популярных форматов файлов. Наш API-интерфейс редактора .NET позволяет загружать документ, преобразовывать его в HTML, передавать HTML во внешний WYSIWYG-редактор HTML и после завершения манипуляции сохранять HTML в исходном формате файла. Вы также можете отдельно получать ресурсы, прикрепленные к любому документу. Он работает со всеми видами документов, например, для Microsoft Word, Excel, PowerPoint, PDF, XPS, OpenDocument, Text, Web, Email, e-Book и т. д.",
		"tab1": {
			"description": "Ниже приведен обзор для GroupDocs.Editor for .NET",
			"title": "Управление с помощью HTML",
			"content1": "Загрузить поддерживаемый документ",
			"content2": "Отредактировать содержимое в HTML",
			"content3": "Отредактировать связанные стили",
			"content4": "Конвертировать в исходный формат"
		},
		"tab2": {
			"description": "GroupDocs.Editor for .NET поддерживает следующие [форматы файлов](https://docs.groupdocs.com/editor/java/supported-document-formats/)",
			"title": "Другие семейства форматов",
			"content1": "Форматы OpenDocument",
			"content2": "Формати с фиксированной разметкой",
			"content3": "Веб-ориентированные форматы",
			"content4": "Форматы электронных книг (e-Book)"
		},
		"tab3": {
			"description": "GroupDocs.Editor for .NET поддерживает следующие операционные системы, фреймворки и менеджеры пакетов",
			"title_os": "Операционные системы",
			"title_frameworks": "Поддерживаемые фреймворки",
			"title_packman": "Менеджеры пакетов",
			"title_devenv": "Среды разработки"
		}
	},
	"Features": {
		"title": "Функциональные особенности GroupDocs.Editor for .NET",
		"feature_loop": {
			"1": "Простая интеграция с любым HTML-редактором",
			"2": "Конвертирование документа в HTML DOM",
			"3": "Извлечь HTML-контент из потока с содержимым документа",
			"4": "Получить HTML-контент и его встроенные ресурсы",
			"5": "Получить содержимое тэга HTML BODY из разметки документа",
			"6": "Получить таблицы стилей CSS из HTML-документа",
			"7": "Просматривайте HTML-контент и сохраняйте его ресурсы",
			"8": "Получить HTML DOM из строкового содержимого и преобразовать в документ",
			"9": "HTML DOM вместе с преобразованием ресурсов",
			"10": "Редактировать документы различных форматов в HTML",
			"11": "Точное преобразование",
			"12": "Применить защиту от чтения и/или записи к результирующему документу",
			"13": "Разбивайте текстовые документы на страницы и редактируйте в любых WYSIWYG-редакторах",
			"14": "Независим от базы данных (DB) и пользовательского интерфейса (UI)",
			"15": "Мощные функции обработки XML",
			"16": "Извлечение шрифтов OTF (Open Type Fonts) из входного документа и экспорт их в выходной документ",
			"17": "Внутренняя обработка векторных и растровых изображений в рамках поддерживаемых форматов файлов",
			"18": "Внедрение содержимого отредактированного рабочего листа в исходную электронную таблицу в нужном месте",
			"19": "Редактирование слайдов и их внедрение в результирующую презентацию",
			"20": "Внедрение шрифтов в результирующий текстовый документ при сохранении"
		},
		"more_features_loop": {
			"title1": "Точная конвертация в HTML DOM и из него",
			"content1": "GroupDocs.Editor for .NET API позволяет приложениям .NET извлекать документ поддерживаемого формата и преобразовывать его в объектную модель документа HTML (DOM) вместе с извлечением присоединенных ресурсов, таких как CSS и изображения. Затем вы можете внести изменения в HTML, используя свой любимый HTML-редактор. Когда вы закончите редактирование, GroupDocs.Editor for .NET API позволит вам точно преобразовать этот HTML DOM обратно в исходный файл.",
			"title2": "Загрузка и извлечение внешних ресурсов",
			"content2": "GroupDocs.Editor для .NET API может извлекать внешние ресурсы, прикрепленные к поддерживаемым документам, такие как изображения, шрифты, CSS и многое другое. Полученные ресурсы затем можно загружать, просматривать и сохранять отдельно от результирующего HTML-документа. Это позволяет вам более гибко и точно управлять выводом (отображением) частей и компонентов документа.",
			"title3": "Применение текстовых эффектов в форматах файлов Word Processing",
			"content3": "GroupDocs.Editor для .NET API позволяет добавлять сложные текстовые эффекты (Тень, 3D-эффект, Контур, Свечение, Гравировка, Тиснение) при работе с поддерживаемыми форматами обработки документов Microsoft Word. Эта функция включается автоматически, что можно наблюдать при обработке документа с такими текстовыми эффектами.",
			"title4": "Мощные функции работы с XML",
			"content4-1": "С помощью  GroupDocs.Editor for .NET API вы можете открывать, просматривать и редактировать XML-документы. Наш API редактирования предлагает специальную поддержку и распознавание тегов XML, атрибутов вместе с их значениями, объявлений XML, разделов CDATA, определений DOCTYPE и других объектов, специфичных для XML. Вы можете настроить параметры шрифта и цвета для каждого отдельного объекта в структуре XML.",
			"content4-2": "Функция XML Converter достаточно умна, чтобы показать ошибки в файле XML и способы их исправления. Механизм распознавания URI и электронной почты сканирует XML-атрибуты и представляет обнаруженные URI и адреса электронной почты внутри тега A в виде ссылок, поэтому их можно редактировать как ссылку, а не как текст в результирующем HTML-файле."
		}
	},
	"Solutions": {
		"title": "GroupDocs.Editor предлагает API редактирования документов для других популярных сред разработки."
	}	
}