{
  "head": {
    "title": "Çareseriya Guherandina Belge | Li ser API-yên Premise û Serlêdanên Belaş",
    "description": "Guhertina Belgeyê ji bo Microsoft Office, OpenDocument, PDF û Pelên din Formên Pelê bi karanîna API-yên Premise bikar tînin an Serlêdana Edîtorê Belgeya Serhêl bikar bînin."
  },
  "header": {
    "title": "Çareseriya Guhertina Belge",
    "description": "Edîtorê belgeyê ku pelên pelên Microsoft Office, OpenOffice, PDF, HTML û pelên din ên pelgeyê manîpule bike."
  },
  "APIs": {
    "API_loop_high_code": {
      "title": "GroupDocs.Editor API-yên Koda Bilind Tê de",
      "label": "Hemî API-yên Koda Bilind bibînin",
      "API_product_net": {
        "content": "Li ser Premise .NET API-ya ku ji serlêdana we re dibe alîkar ku hûn belgeyan bibînin, biguherînin û dûv re veguherînin."
      },
      "API_product_java": {
        "content": "API-ya guherandinê ya belgeyê ji bo Microsoft Office, OpenOffice, HTML û belgeyên din ên ku di nav sepanên xwe yên Java-yê de manîpule bikin."
      }
    },
    "API_loop_low_code": {
      "title": "GroupDocs.Editor API-yên Kodên Kêm Include",
      "label": "Hemî API-yên Code Low-ê bibînin",
      "Cloud_SDK_net": {
        "content": "Di sepanên .NET de bi karanîna Cloud SDK-ê ji bo .NET-ê taybetmendiyên guherandina formatên belgeyên bihêz zêde bikin. Belgeyên MS Office, Web û XML biguherînin."
      },
      "Cloud_SDK_java": {
        "content": "Edîtorê belgeya pêşkeftî SDK ji bo serîlêdanên Java-yê ku li ser her platformê ku bikaribe gazî API-yên REST bike, formatên pelên belgeyên standard ên pîşesaziyê biguherîne."
      }
    },
    "API_loop_no_code": {
      "title": "GroupDocs.Edîtor No Sepanên Kodê Têde Ne",
      "label": "Hemî Serlêdanên No Kodê bibînin",
      "Total": {
        "content": "Serlêdana serhêl a belaş-based Web-ê ku ji Office & OpenOffice formatên pelan ên populer biguherîne."
      },
      "DOCX": {
        "content": "Serlêdana edîtorê belaş ku belgeyên Microsoft Word-ê serhêl bibînin û biguherînin."
      },
      "PDF": {
        "content": "Her amûrek, her gerokek bikar bînin ku pelên PDF û XPS bibînin an biguherînin."
      }
    }
  }
}