{
  "head": {
    "title": "C# .NET Document Editor API | Upravte Word Excel PowerPoint Web XML pomocí HTML",
    "description": "API editoru dokumentů C# .NET pro načtení formátů Microsoft Word, Excel, PowerPoint, PDF, XML, web a textové soubory do HTML, manipulaci a převod zpět do původního formátu."
  },
  "header": {
    "title": ".NET API pro úpravu dokumentů pomocí HTML",
    "description": "Vyvíjejte aplikace .NET, integrujte je s editorem HTML, načtěte podporovaný dokument, upravujte a převádějte do původního formátu."
  },
  "Submenu": {
    "middle": {
      "button_overview": {
        "text": "Přehled"
      },
      "button_features": {
        "text": "Funkce"
      },
      "button_support": {
        "text": "Podpěra, podpora"
      },
      "button_livedemo": {
        "text": "Živá ukázka"
      },
      "button_pricing": {
        "text": "Ceny"
      }
    }
  },
  "Overview": {
    "content": "GroupDocs.Editor for .NET API vám pomůže vytvořit jednoduché a snadno použitelné aplikace C#, ASP.NET a další .NET aplikace, které se snadno integrují s oblíbenými editory HTML (jak open source, tak placenými) pro převod, úpravu a manipulaci s dokumenty. populární formáty souborů. Naše .NET Editor API umožňuje načíst dokument, převést jej do HTML, odeslat HTML do externího HTML editoru, a jakmile je manipulace hotová, uloží HTML do původního formátu souboru. Můžete také samostatně načíst zdroje připojené k libovolnému dokumentu. Pracuje se všemi druhy dokumentů, jako je například Microsoft Word, Excel, PowerPoint, PDF, XPS, OpenDocument, text, web, e-mail, e-kniha a další.",
    "tab1": {
      "description": "Následuje přehled GroupDocs.Editoru pro .NET",
      "title": "Manipulujte pomocí HTML",
      "content1": "Načíst podporovaný dokument",
      "content2": "Upravujte obsah pomocí HTML",
      "content3": "Upravit související styly",
      "content4": "Převést do původního formátu"
    },
    "tab2": {
      "description": "GroupDocs.Editor pro .NET podporuje následující [formáty souborů](https://docs.groupdocs.com/editor/java/supported-document-formats/)",
      "title": "Rodiny jiných formátů",
      "content1": "Formáty OpenDocument",
      "content2": "Formáty s pevným rozložením",
      "content3": "Webové formáty",
      "content4": "Formáty elektronické knihy (e-Book)."
    },
    "tab3": {
      "description": "GroupDocs.Editor pro .NET podporuje následující operační systémy, rámce a správce balíčků",
      "title_os": "Operační systémy",
      "title_frameworks": "Podporované rámce",
      "title_packman": "Správci balíčků",
      "title_devenv": "Vývojová prostředí"
    }
  },
  "Features": {
    "title": "Funkce GroupDocs.Editor pro .NET",
    "feature_loop": {
      "1": "Snadná integrace s jakýmkoli HTML editorem",
      "2": "Převést dokument do HTML DOM",
      "3": "Načtení obsahu HTML ze streamu dokumentů",
      "4": "Získejte obsah HTML a jeho vložené zdroje",
      "5": "Získejte obsah značky HTML Body z dokumentu",
      "6": "Získejte šablony stylů CSS dokumentu HTML",
      "7": "Procházejte obsah HTML a ukládejte jeho zdroje",
      "8": "Načíst HTML DOM z obsahu řetězce a převést na dokument",
      "9": "HTML DOM spolu s konverzí zdrojů",
      "10": "Upravujte dokumenty různých formátů v HTML",
      "11": "Přesný převod",
      "12": "Použijte ochranu proti čtení a/nebo zápisu na výsledný dokument",
      "13": "Stránkování dokumentů pro zpracování textu a úpravy v libovolném editoru WYSIWYG",
      "14": "Databáze (DB) a uživatelské rozhraní (UI) Agnostic",
      "15": "Výkonné funkce zpracování XML",
      "16": "Načtení OTF (písma otevřeného typu) ze vstupních dokumentů a export do výsledného dokumentu",
      "17": "Zpracovávejte rastrové a vektorové obrázky interně v rámci podporovaných formátů vstupních dokumentů",
      "18": "Vložte obsah upraveného sešitu do původní tabulky na požadované místo",
      "19": "Upravte snímky a vložte je do výsledné tabulky",
      "20": "Vložit písma do výsledného dokumentu pro zpracování textu při ukládání"
    },
    "more_features_loop": {
      "title1": "Přesný převod do az HTML DOM",
      "content1": "GroupDocs.Editor for .NET API umožňuje vašim .NET aplikacím načíst dokument podporovaného formátu a převést jej na HTML Document Object Model (DOM) spolu s extrakcí připojených zdrojů, jako je CSS. Poté můžete provést úpravy kódu HTML pomocí svého oblíbeného editoru HTML. Jakmile dokončíte úpravy, GroupDocs.Editor for .NET API vám umožní přesně převést tento HTML DOM zpět na původní soubor.",
      "title2": "Načíst a extrahovat externí zdroje",
      "content2": "GroupDocs.Editor for .NET API je schopen načíst externí zdroje připojené k podporovaným dokumentům, jako jsou obrázky, písma, CSS a další. Načtené prostředky pak lze načíst, procházet a ukládat odděleně od výsledného dokumentu HTML. Získáte tak snadněji spravovaný výstup.",
      "title3": "Použít textové efekty ve formátech souborů textového editoru",
      "content3": "API editoru dokumentů GroupDocs umožňuje přidávat komplexní textové efekty (Stín, 3D efekt, Obrys, Záře, Engrave, Emboss) při práci s podporovanými formáty zpracování dokumentů Microsoft Word. Tato funkce je automaticky povolena, což lze pozorovat při zpracování dokumentu s takovými textovými efekty.",
      "title4": "Výkonné funkce pro manipulaci s XML",
      "content4-1": "Pomocí GroupDocs.Editor for .NET API můžete otevírat, prohlížet a upravovat dokumenty XML. Naše editační API nabízí speciální podporu a rozpoznávání XML tagů, atributů spolu s jejich hodnotami, XML deklarace, CDATA sekce, DOCTYPE definice a další XML specifické entity. Jste schopni přizpůsobit nastavení písma a barvy pro každou odlišnou entitu ve struktuře XML.",
      "content4-2": "Funkce XML Converter je dostatečně inteligentní, aby zobrazila chyby v souboru XML a jak je opravit. Mechanismus URI a rozpoznávání e-mailů skenuje atributy XML a představuje zjištěné URI a e-mailové adresy uvnitř značky A jako odkazy, takže je lze upravit jako odkaz, nikoli jako text ve výsledném souboru HTML."
    }
  },
  "Solutions": {
    "title": "GroupDocs.Editor nabízí rozhraní API pro úpravu dokumentů pro další populární vývojová prostředí"
  }
}