{
    "head": {
        "title": "API редактора документів на C# .NET | Редагувати Word Excel PowerPoint Web XML текстові файли за допомогою HTML",
        "description": "Редактор документів с API на C# .NET дозволяє завантажувати документи Microsoft Word, Excel, PowerPoint, PDF, XML, веб-орієнтовані та текстові файли у HTML, редагувати їх у браузері та конвертувати назад у початковий формат."
    },
	"header": {
		"title": ".NET API для редагування документів із використанням HTML",
		"description": "Розробляйте .NET-застосунки, інтегруйте їх із HTML-редактором, завантажуйте документи підтримуваних форматів, редагуйте їх і конвертуйте назад в початковий формат."
	},
	"Submenu": {
		"middle" : {
			"button_overview": {
				"text": "Огляд"
			},
			"button_features": {
				"text": "Функції"
			},
			"button_support": {
				"text": "Підтримка"
			},
			"button_livedemo": {
				"text": "Живі демонстрації"
			},
			"button_pricing": {
				"text": "Ціни"
			}
		}
	},
	"Overview": {
		"content": "GroupDocs.Editor for .NET API допомагає створювати прості та зручні у використанні застосунки C#, ASP.NET та інші застосунки .NET, котрі легко інтегруються із популярними HTML-редакторами (як із відкритим вихідним кодом, так і платними) для перетворення, редагування та управління документами популярних форматів файлів. Наш API-інтерфейс редактора .NET дозволяє завантажувати документ, перетворити його у HTML, передати цей HTML у завнішній WYSIWYG-редактор HTML-розмітки і опісля завершення маніпуляції зберегти HTML у початковому форматі файлу. Ви також можете окремо отримати ресурси, прикріплені до любого документа. Він працює із всіма видами документів, наприклад, для Microsoft Word, Excel, PowerPoint, PDF, XPS, OpenDocument, Text, Web, Email, e-Book і т. д.",
		"tab1": {
			"description": "Нижче наводиться огляд GroupDocs.Editor for .NET",
			"title": "Управління за допомогою HTML",
			"content1": "Завантажити підтримуваний документ",
			"content2": "Редагувати контент за допомогою HTML",
			"content3": "Редагувати зв'язані стилі",
			"content4": "Конвертувати у початковий формат"
		},
		"tab2": {
			"description": "GroupDocs.Editor for .NET підтримує наступні [формати файлів](https://docs.groupdocs.com/editor/java/supported-document-formats/)",
			"title": "Інші сімейства форматів",
			"content1": "Формати OpenDocument",
			"content2": "Формати із фіксованою розміткою",
			"content3": "Веб-формати",
			"content4": "Формати електронних книг (e-Book)"
		},
		"tab3": {
			"description": "GroupDocs.Editor for .NET підтримує наступні операційні системи, фреймворки та менеджери пакетів",
			"title_os": "Операційні системи",
			"title_frameworks": "Підтримувані фреймворки",
			"title_packman": "Менеджери пакетів",
			"title_devenv": "Середовища розробки"
		}
	},
	"Features": {
		"title": "Можливості GroupDocs.Editor for .NET",
		"feature_loop": {
			"1": "Проста інтеграція із любим HTML-редактором",
			"2": "Конверитація документу у HTML DOM",
			"3": "Екстрагування вмісту HTML із потоку із вмістом документу",
			"4": "Отримати HTML-контент та його вбудовані ресурси",
			"5": "Отримання вмісту тегу HTML BODY із розмітки документу",
			"6": "Отримання таблиць стилів CSS із HTML-документу",
			"7": "Переглядайте HTML-контент і зберігайте його ресурси",
			"8": "Отримання HTML DOM із вмісту строки та перетворення його у документ",
			"9": "HTML DOM разом із перетворенням ресурсів",
			"10": "Редагувати документи різних форматів у HTML",
			"11": "Точність конвертації",
			"12": "Застосувати захист від читання та/або запису до вихідного документа",
			"13": "Разбивайте текстові документи на сторінки і редагуйте в любих WYSIWYG-редакторах",
			"14": "Незалежність від баз даних (DB) та користувацького інтерфейсу (UI)",
			"15": "Потужні функції обробки XML",
			"16": "Екстрагування шрифтів OTF (Open Type Fonts) із вхідного документа та експорт їх у вихідний документ",
			"17": "Внутрішня обробка векторних та растрових зображень у рамках підтримуваних форматів файлів",
			"18": "Ін'єкція вмісту відредагованого робочого листа у початкову електронну таблицю в потрібному місці",
			"19": "Редагування слайдів та їх ін'єкція у вихідну презентацію",
			"20": "Ін'єкція шрифтів у вихідний текстовий документ під час збереження"
		},
		"more_features_loop": {
			"title1": "Точна конвертація у HTML DOM та із нього",
			"content1": "GroupDocs.Editor for .NET API дозволяє додаткам .NET завантажувати документ із списка форматів, що підтримуються, та конвертувати його в об'єктну модель документа HTML (DOM) разом із екстрагуванням приєднаних ресурсів, таких як CSS та зображення. Після чого можливо внести зміни в HTML, використовуючи свій улюблений HTML-редактор. Коли ви закінчите редагування, GroupDocs.Editor for .NET API дозволить вам точно конвертувати цей HTML DOM назад у початковий файл.",
			"title2": "Завантаження та екстрагування зовнішніх ресурсів",
			"content2": "GroupDocs.Editor для .NET API может екстрагувати зовнішні ресурси, прикріплені до підтримуваним документам, такі як зображення, шрифти, CSS і багато чого іншого. Отримані ресурси потім можна завантажувати, переглядати і зберігати окремо від вихідного HTML-документа. Це дозволяє вам більш гнучко і точно керувати виводом (відображенням) частин і компонентів документа.",
			"title3": "Застосування текстових ефектів у форматах файлів Word Processing",
			"content3": "GroupDocs.Editor для .NET API дозволяє додавати складні текстові ефекти (Тінь, 3D-ефект, Контур, Світіння, Гравірування, Тиснення) при работі із підтримуваними форматами обробки документів Microsoft Word. Ця функція вмикається автоматично, що можна спостерігати при обробці документа із такими текстовими ефектами.",
			"title4": "Потужні функції роботи із XML",
			"content4-1": "Із допомогою  GroupDocs.Editor for .NET API ви можете відкривати, переглядати та редагувати XML-документи. Наш API редагування містить спеціальну підтримку та розпізнавання тегів XML, атрибутів разом із їх значеннями, оголошень XML, розділів CDATA, визначень DOCTYPE та других об'єктів, специфічних для XML. Ви можете налаштувати параметри шрифта і кольору для кожного окремого об'єкту у структурі XML.",
			"content4-2": "Функція XML Converter достатньо розумна, щоби показати помилки у файлі XML та способи їх виправлення. Механізм розпізнавання URI та електронної пошти сканує XML-атрибути і представляє виявлені URI та адреса електроннрої пошти всередині тегу A у виді посилань, тому їх можна редагувати як посилання, а не як текст в результуючому HTML-файлі."
		}
	},
	"Solutions": {
		"title": "GroupDocs.Editor надає API редагування документів для інших популярних середовищ розробки."
	}	
}