{
  "head": {
    "title": "Java Document Editor API | Cuir Comhaid Téacs XML Gréasáin Word in Eagar ag baint úsáide as HTML",
    "description": "Eagarthóir doiciméad api do java. Luchtaigh comhaid Microsoft Word, XML, gréasáin & téacs go HTML agus tiontaigh ar ais go dtí an bhunfhormáid tar éis ionramhála."
  },
  "header": {
    "title": "Cuir Doiciméid in Eagar trí HTML Ag Úsáid Java API",
    "description": "Comhtháthaigh feidhmchláir Java le heagarthóir HTML chun doiciméid a láimhseáil agus a thiontú ar ais go dtí an bhunfhormáid."
  },
  "Submenu": {
    "middle": {
      "button_overview": {
        "text": "Forbhreathnú"
      },
      "button_features": {
        "text": "Gnéithe"
      },
      "button_support": {
        "text": "Tacaíocht"
      },
      "button_livedemo": {
        "text": "Taispeántas beo"
      },
      "button_pricing": {
        "text": "Praghsáil"
      }
    }
  },
  "Overview": {
    "content": "Cumasaíonn GroupDocs.Editor do Java API eagarthóireacht doiciméad i bhfoirm HTML. Tacaíonn API le formáidí éagsúla doiciméad agus is féidir é a chomhtháthú le haon eagarthóir HTML seachtrach, foinse oscailte nó íoctha. Déanfaidh Eagarthóir API próiseáil ar dhoiciméid a luchtú, é a thiontú go HTML, HTML a sholáthar chuig Chomhéadain Seachtrach agus ansin HTML a shábháil chuig an doiciméad bunaidh tar éis ionramhála. Is féidir é a úsáid freisin chun doiciméid éagsúla Microsoft Word, Excel, comhaid PowerPoint, formáidí OpenDocument, XML agus TXT a ghiniúint.",
    "tab1": {
      "description": "Seo a leanas forbhreathnú ar GroupDocs.Editor do Java",
      "title": "Ionramháil Ag baint úsáide as HTML",
      "content1": "Luchtaigh Doiciméad Tacaithe",
      "content2": "Cuir Ábhar in Eagar ag úsáid HTML",
      "content3": "Cuir Stíleanna Gaolmhara in Eagar",
      "content4": "Tiontaigh go Formáid Bhunaidh"
    },
    "tab2": {
      "description": "Tacaíonn GroupDocs.Editor le haghaidh Java le [formáidí comhaid] (https://docs.groupdocs.com/editor/java/supported-document-formats/)",
      "title": "Teaghlaigh i bhformáid eile",
      "content1": "Formáidí OpenDocument",
      "content2": "Formáidí ríomhphoist",
      "content3": "Formáidí gréasáin",
      "content4": "Formáidí leictreonacha leabhar (ríomhleabhar)."
    },
    "tab3": {
      "description": "Tacaíonn GroupDocs.Editor le haghaidh Java le Córais Oibriúcháin, Creataí & Bainisteoirí Pacáiste",
      "title_os": "Córais oibriúcháin",
      "title_frameworks": "Creataí Tacaithe",
      "title_packman": "Tógáil Uirlis Uathoibrithe",
      "title_devenv": "Timpeallachtaí Forbartha"
    }
  },
  "Features": {
    "title": "GroupDocs.Editor le haghaidh Gnéithe Java",
    "feature_loop": {
      "1": "Comhtháthú Eagarthóir HTML Éasca",
      "2": "Comhshó Doiciméad go HTML DOM",
      "3": "Sliocht Ábhar HTML as Sruth Doiciméad",
      "4": "Luchtaigh, Cuir & Sábháil Formáidí Comhaid Word, Excel & PowerPoint",
      "5": "Faigh HTML chomh maith le Eilimintí Leabaithe",
      "6": "Iompórtáil, Féach ar agus Cuir Doiciméid XML in Eagar",
      "7": "Seachbhóthar Ábhar HTML & Sábháil Acmhainní Leabaithe",
      "8": "Féach ar, Cuir in Eagar agus Sábháil Doiciméid Phróiseála Focal sa Mhód Leathanach",
      "9": "Faigh Ábhar Clib Coirp HTML ó Chomhad",
      "10": "Sliocht Ábhar CSS de Chomhad HTML",
      "11": "Úsáid Ábhar Teaghrán chun HTML DOM a Fháil & Tiontaigh go Comhad",
      "12": "Tiontaigh HTML DOM le Eilimintí Leabaithe",
      "13": "Tiontaigh Comhaid d'Ilfhormáidí i HTML le haghaidh Eagarthóireachta",
      "14": "Faigh Meta Faisnéise ar Dhoiciméid Ionchuir gan Eagarthóireacht",
      "15": "Sábháil Doiciméid Atheagraithe i bhFormáid Ghnáthchomhaid Téacs",
      "16": "Cruinneas Tiontaithe",
      "17": "Cuir Pasfhocal i bhFeidhm ar Dhoiciméad Aschuir",
      "18": "Bunachar Sonraí (DB) Agnostic",
      "19": "Comhéadan Úsáideora (UI) Agnostic",
      "20": "Tacaíonn sé le Ceadúnú Méadraithe"
    },
    "more_features_loop": {
      "title1": "Tiontaigh go cruinn chuig agus ó HTML DOM",
      "content1": "Trí úsáid a bhaint as GroupDocs.Editor do Java is féidir leat feidhmchláir a thógáil i Java a luchtaíonn doiciméad d’fhormáid comhaid tacaithe chun é a thiontú go Múnla Oibiachta Doiciméid HTML (DOM) mar aon leis na heilimintí a bhaineann leis, m.sh. CSS. Ina theannta sin, ligeann ár n-Eagarthóir Java API duit an HTML a chur in eagar in aon cheann de na heagarthóirí HTML a bhfuil tóir orthu. Tar éis do chuid modhnuithe riachtanacha a dhéanamh, cabhraíonn GroupDocs.Editor do Java leat an HTML iarmhartach seo a thiontú ar ais go dtí an bhunfhormáid chomhaid.",
      "title2": "Luchtaigh & Faigh Eilimintí Comhlachaithe",
      "content2": "Cuireann GroupDocs.Editor le haghaidh Java API ar do chumas na heilimintí gaolmhara a fháil ó dhoiciméid de bhformáidí tacaithe, mar íomhánna, CSS, clónna & níos mó. Ansin is féidir leat na heilimintí gaolmhara seo a luchtú, iad a thrasnú agus iad a shábháil ar leithligh ón gcomhad HTML deiridh, agus aschur dea-bhainistithe a bheith agat."
    }
  },
  "Solutions": {
    "title": "Cuireann GroupDocs.Editor APInna eagarthóireachta doiciméad ar fáil do thimpeallachtaí forbartha eile a bhfuil tóir orthu"
  }
}