{
  "head": {
    "title": "Құжатты өңдеу шешімі | Premise API және тегін қолданбаларда",
    "description": "Microsoft Office, OpenDocument, PDF және басқа файл пішімдері үшін On Premise API интерфейстерін пайдалана отырып құжатты өңдеу немесе Online Document Editor қолданбасын пайдаланыңыз."
  },
  "header": {
    "title": "Құжатты өңдеу шешімі",
    "description": "Microsoft Office, OpenOffice, PDF, HTML және басқа құжат файл пішімдерін өңдеуге арналған құжат редакторы."
  },
  "APIs": {
    "API_loop_high_code": {
      "title": "GroupDocs.Editor Жоғары код API интерфейстерін қамтиды",
      "label": "Барлық жоғары код API интерфейстерін қараңыз",
      "API_product_net": {
        "content": "Бағдарламаға құжаттарды көруге, өңдеуге және түрлендіруге көмектесетін Premise .NET API."
      },
      "API_product_java": {
        "content": "Microsoft Office, OpenOffice, HTML және Java негізіндегі қолданбаларыңызда манипуляциялау үшін басқа құжаттарға арналған құжаттарды өңдеу API."
      }
    },
    "API_loop_low_code": {
      "title": "GroupDocs.Editor Төмен код API интерфейстерін қамтиды",
      "label": "Барлық төмен код API интерфейстерін қараңыз",
      "Cloud_SDK_net": {
        "content": ".NET үшін Cloud SDK көмегімен .NET қолданбаларында қуатты құжат пішімдерін өңдеу мүмкіндіктерін қосыңыз. MS Office, Web және XML құжаттарын өңдеу."
      },
      "Cloud_SDK_java": {
        "content": "REST API интерфейстерін шақыруға қабілетті кез келген платформада салалық стандартты құжат файл пішімдерін өңдеуге арналған Java қолданбаларына арналған кеңейтілген құжат редакторы SDK."
      }
    },
    "API_loop_no_code": {
      "title": "GroupDocs.Editor Код қолданбаларын қамтымайды",
      "label": "Барлық кодсыз қолданбаларды қараңыз",
      "Total": {
        "content": "Office және OpenOffice қызметтерінен танымал файл пішімдерін өңдеуге арналған веб-негізделген тегін онлайн қолданба."
      },
      "DOCX": {
        "content": "Microsoft Word құжаттарын онлайн режимінде көруге және өңдеуге арналған тегін редактор қолданбасы."
      },
      "PDF": {
        "content": "PDF және XPS құжаттарын көру немесе өңдеу үшін кез келген құрылғыны, кез келген браузерді пайдаланыңыз."
      }
    }
  }
}