{
  "head": {
    "title": "API за редактор на документи на Java | Редактирайте Word Web XML текстови файлове с помощта на HTML",
    "description": "API за редактор на документи за Java. Заредете Microsoft Word, XML, уеб и текстови файлове в HTML и конвертирайте обратно в оригиналния формат след манипулация."
  },
  "header": {
    "title": "Редактирайте документи чрез HTML с помощта на Java API",
    "description": "Интегрирайте Java приложения с HTML редактор, за да манипулирате документи и да конвертирате обратно в оригиналния формат."
  },
  "Submenu": {
    "middle": {
      "button_overview": {
        "text": "Преглед"
      },
      "button_features": {
        "text": "Характеристика"
      },
      "button_support": {
        "text": "поддържа"
      },
      "button_livedemo": {
        "text": "Демо на живо"
      },
      "button_pricing": {
        "text": "Ценообразуване"
      }
    }
  },
  "Overview": {
    "content": "GroupDocs.Editor за Java API позволява редактиране на документи под формата на HTML. API поддържа множество формати на документи и може да бъде интегриран с всеки външен, с отворен код или платен HTML редактор. API на редактора ще обработва, за да зареди документи, да ги преобразува в HTML, да предостави HTML на външен потребителски интерфейс и след това да запази HTML в оригиналния документ след манипулация. Може да се използва и за генериране на различни Microsoft Word, Excel електронни таблици, PowerPoint файлове, OpenDocument формати, XML и TXT документи.",
    "tab1": {
      "description": "Следва общ преглед на GroupDocs.Editor за Java",
      "title": "Манипулирайте с помощта на HTML",
      "content1": "Заредете поддържан документ",
      "content2": "Редактирайте съдържание с помощта на HTML",
      "content3": "Редактиране на свързани стилове",
      "content4": "Конвертиране в оригинален формат"
    },
    "tab2": {
      "description": "GroupDocs.Editor за Java поддържа следните [файлови формати](https://docs.groupdocs.com/editor/java/supported-document-formats/)",
      "title": "Други форматни семейства",
      "content1": "OpenDocument формати",
      "content2": "Имейл формати",
      "content3": "Уеб формати",
      "content4": "Формати на електронни книги (e-Book)."
    },
    "tab3": {
      "description": "GroupDocs.Editor за Java поддържа следните операционни системи, рамки и мениджъри на пакети",
      "title_os": "Операционна система",
      "title_frameworks": "Поддържани рамки",
      "title_packman": "Инструмент за автоматизация на изграждане",
      "title_devenv": "Среди за разработка"
    }
  },
  "Features": {
    "title": "GroupDocs.Editor за функции на Java",
    "feature_loop": {
      "1": "Лесно интегриране на HTML редактор",
      "2": "Преобразуване на документ в HTML DOM",
      "3": "Извличане на HTML съдържание от документен поток",
      "4": "Зареждане, редактиране и запазване на файлови формати на Word, Excel и PowerPoint",
      "5": "Извличане на HTML заедно с вградени елементи",
      "6": "Импортирайте, преглеждайте и редактирайте XML документи",
      "7": "Заобикаляне на HTML съдържание и запазване на вградени ресурси",
      "8": "Преглеждайте, редактирайте и запазвайте текстообработващи документи в пагинален режим",
      "9": "Вземете съдържанието на HTML Body Tag от файла",
      "10": "Извличане на CSS съдържание на HTML файл",
      "11": "Използвайте съдържание на низ, за ​​да получите HTML DOM и да конвертирате във файл",
      "12": "Конвертирайте HTML DOM с вградени елементи",
      "13": "Конвертирайте файлове с множество формати в HTML за редактиране",
      "14": "Вземете мета информация за входни документи без редактиране",
      "15": "Запазете редактираните документи във файлов формат с обикновен текст",
      "16": "Точност на преобразуване",
      "17": "Прилагане на парола към изходния документ",
      "18": "База данни (DB) Agnostic",
      "19": "Агностичен потребителски интерфейс (UI).",
      "20": "Поддържа Metered Licensing"
    },
    "more_features_loop": {
      "title1": "Прецизно конвертиране към и от HTML DOM",
      "content1": "Използването на GroupDocs.Editor за Java ви позволява да създавате приложения в Java, които зареждат документ с поддържан файлов формат, за да го конвертират в HTML Document Object Model (DOM) заедно със свързаните с него елементи, например CSS. Освен това, нашият редактор Java API ви позволява да редактирате HTML във всеки от популярните HTML редактори. След като направите необходимите промени, GroupDocs.Editor за Java ви помага да конвертирате този получен HTML обратно в оригиналния му файлов формат.",
      "title2": "Зареждане и извличане на асоциирани елементи",
      "content2": "API на GroupDocs.Editor за Java ви позволява да извличате свързаните елементи от документи с поддържани формати, като изображения, CSS, шрифтове и други. След това можете да заредите тези извлечени свързани елементи, да ги обходите и да ги запишете отделно от крайния HTML файл и да имате добре управляван изход."
    }
  },
  "Solutions": {
    "title": "GroupDocs.Editor предлага API за преглед на документи за други популярни среди за разработка"
  }
}