{
  "head": {
    "title": "Interfejs API edytora dokumentów C# .NET | Edytuj Word Excel PowerPoint Web XML za pomocą HTML",
    "description": "Interfejs API edytora dokumentów C# .NET do ładowania formatów plików Microsoft Word, Excel, PowerPoint, PDF, XML, internetowych i tekstowych do HTML, manipulacji i konwersji z powrotem do oryginalnego formatu."
  },
  "header": {
    "title": ".NET API do edycji dokumentów za pomocą HTML",
    "description": "Twórz aplikacje .NET, aby zintegrować się z edytorem HTML, pobrać obsługiwane dokumenty, edytować i konwertować do oryginalnego formatu."
  },
  "Submenu": {
    "middle": {
      "button_overview": {
        "text": "Przegląd"
      },
      "button_features": {
        "text": "Cechy"
      },
      "button_support": {
        "text": "Wspierać się"
      },
      "button_livedemo": {
        "text": "Demo na żywo"
      },
      "button_pricing": {
        "text": "cennik"
      }
    }
  },
  "Overview": {
    "content": "GroupDocs.Editor dla .NET API pomaga tworzyć proste i łatwe w użyciu aplikacje C#, ASP.NET i inne .NET, które łatwo integrują się z popularnymi edytorami HTML (zarówno open-source, jak i płatnymi) w celu konwertowania, edytowania i manipulowania dokumentami popularne formaty plików. Nasz interfejs API edytora .NET umożliwia ładowanie dokumentu, konwertowanie go do formatu HTML, przesyłanie kodu HTML do zewnętrznego edytora HTML, a po zakończeniu manipulacji zapisuje kod HTML w oryginalnym formacie pliku. Możesz także osobno pobrać zasoby dołączone do dowolnego dokumentu. Współpracuje z wszelkiego rodzaju dokumentami, takimi jak Microsoft Word, Excel, PowerPoint, PDF, XPS, OpenDocument, Text, Web, Email, e-Book i inne.",
    "tab1": {
      "description": "Poniżej znajduje się omówienie GroupDocs.Editor dla platformy .NET",
      "title": "Manipuluj używając HTML",
      "content1": "Załaduj obsługiwany dokument",
      "content2": "Edytuj zawartość za pomocą HTML",
      "content3": "Edytuj powiązane style",
      "content4": "Konwertuj na oryginalny format"
    },
    "tab2": {
      "description": "GroupDocs.Editor dla .NET obsługuje następujące [formaty plików](https://docs.groupdocs.com/editor/java/supported-document-formats/)",
      "title": "Inne rodziny formatów",
      "content1": "Formaty OpenDocument",
      "content2": "Formaty o stałym układzie",
      "content3": "Formaty internetowe",
      "content4": "Formaty książek elektronicznych (e-booków)"
    },
    "tab3": {
      "description": "GroupDocs.Editor dla .NET obsługuje następujące systemy operacyjne, frameworki i menedżery pakietów",
      "title_os": "System operacyjny",
      "title_frameworks": "Obsługiwane frameworki",
      "title_packman": "Menedżerowie pakietów",
      "title_devenv": "Środowiska programistyczne"
    }
  },
  "Features": {
    "title": "GroupDocs.Editor dla funkcji .NET",
    "feature_loop": {
      "1": "Łatwa integracja z dowolnym edytorem HTML",
      "2": "Konwertuj dokument na HTML DOM",
      "3": "Pobierz zawartość HTML ze strumienia dokumentów",
      "4": "Pobierz zawartość HTML i jej zasoby osadzone",
      "5": "Uzyskaj treść znacznika treści HTML z dokumentu",
      "6": "Pobierz arkusze stylów CSS dokumentu HTML",
      "7": "Przeszukuj zawartość HTML i zapisuj jej zasoby",
      "8": "Pobierz DOM HTML z zawartości ciągu i przekonwertuj na dokument",
      "9": "HTML DOM wraz z konwersją zasobów",
      "10": "Edytuj dokumenty w różnych formatach w HTML",
      "11": "Dokładna konwersja",
      "12": "Zastosuj ochronę odczytu i/lub zapisu do wynikowego dokumentu",
      "13": "Przetwarzaj strony na strony dokumentów i edytuj je w dowolnych edytorach WYSIWYG",
      "14": "Baza danych (DB) i interfejs użytkownika (UI) Agnostic",
      "15": "Potężne funkcje przetwarzania XML",
      "16": "Pobierz OTF (czcionki typu otwartego) z dokumentów wejściowych i eksportuj do dokumentu wynikowego",
      "17": "Przetwarzanie obrazów rastrowych i wektorowych wewnętrznie w obsługiwanych formatach dokumentów wejściowych",
      "18": "Wstaw zawartość edytowanego arkusza do oryginalnego arkusza kalkulacyjnego w żądanym miejscu",
      "19": "Edytuj slajdy i wstaw je do wynikowego arkusza kalkulacyjnego",
      "20": "Osadź czcionki w wynikowym dokumencie przetwarzania tekstu podczas zapisywania"
    },
    "more_features_loop": {
      "title1": "Dokładna konwersja do iz HTML DOM",
      "content1": "GroupDocs.Editor dla interfejsu .NET API umożliwia aplikacjom .NET pobranie dokumentu w obsługiwanym formacie i przekonwertowanie go na obiektowy model dokumentu HTML (DOM) wraz z wyodrębnieniem dołączonych zasobów, takich jak CSS. Następnie możesz wprowadzić modyfikacje w kodzie HTML za pomocą swojego ulubionego edytora HTML. Po zakończeniu edycji GroupDocs.Editor for .NET API umożliwia dokładne przekonwertowanie tego modelu DOM HTML z powrotem do oryginalnego pliku.",
      "title2": "Załaduj i wyodrębnij zasoby zewnętrzne",
      "content2": "GroupDocs.Editor dla .NET API może pobierać zewnętrzne zasoby dołączone do obsługiwanych dokumentów, takie jak obrazy, czcionki, CSS i inne. Pobrane zasoby można następnie wczytywać, przeglądać i zapisywać oddzielnie od wynikowego dokumentu HTML. Daje to łatwiejsze zarządzanie danymi wyjściowymi.",
      "title3": "Zastosuj efekty tekstowe w formatach plików do przetwarzania tekstu",
      "content3": "Interfejs API edytora dokumentów GroupDocs umożliwia dodawanie złożonych efektów tekstowych (cień, efekt 3D, kontur, blask, grawerowanie, płaskorzeźba) podczas pracy z obsługiwanymi formatami przetwarzania dokumentów Microsoft Word. Ta funkcja jest włączana automatycznie, co można zaobserwować podczas przetwarzania dokumentu z takimi efektami tekstowymi.",
      "title4": "Potężne funkcje manipulacji XML",
      "content4-1": "Korzystając z GroupDocs.Editor dla .NET API, możesz otwierać, wyświetlać i edytować dokumenty XML. Nasz interfejs API do edycji oferuje specjalną obsługę i rozpoznawanie znaczników XML, atrybutów wraz z ich wartościami, deklaracji XML, sekcji CDATA, definicji DOCTYPE i innych jednostek specyficznych dla XML. Jesteś w stanie dostosować ustawienia czcionek i kolorów dla każdej odrębnej encji w strukturze XML.",
      "content4-2": "Funkcja konwertera XML jest wystarczająco inteligentna, aby pokazać błędy w pliku XML i sposoby ich naprawy. Mechanizm rozpoznawania identyfikatorów URI i wiadomości e-mail skanuje atrybuty XML i przedstawia wykryte identyfikatory URI i adresy e-mail w znaczniku A jako łącza, dzięki czemu można je edytować jako łącze, a nie jako tekst w wynikowym pliku HTML."
    }
  },
  "Solutions": {
    "title": "GroupDocs.Editor oferuje interfejsy API do edycji dokumentów dla innych popularnych środowisk programistycznych"
  }
}