{
  "head": {
    "title": "API dell'editor di documenti .NET C# | Modifica Word Excel PowerPoint Web XML utilizzando HTML",
    "description": "API dell'editor di documenti C# .NET per caricare i formati di file Microsoft Word, Excel, PowerPoint, PDF, XML, Web e di testo in HTML, manipolare e riconvertire nel formato originale."
  },
  "header": {
    "title": "API .NET per modificare documenti utilizzando HTML",
    "description": "Sviluppa applicazioni .NET, per integrarsi con l'editor HTML, recuperare documenti supportati, modificare e convertire in formato originale."
  },
  "Submenu": {
    "middle": {
      "button_overview": {
        "text": "Panoramica"
      },
      "button_features": {
        "text": "Caratteristiche"
      },
      "button_support": {
        "text": "Supporto"
      },
      "button_livedemo": {
        "text": "Dimostrazione dal vivo"
      },
      "button_pricing": {
        "text": "Prezzo"
      }
    }
  },
  "Overview": {
    "content": "GroupDocs.Editor per .NET API ti aiuta a creare applicazioni C#, ASP.NET e altre applicazioni .NET semplici e facili da usare che si integrano facilmente con i più diffusi editor HTML (sia open source che a pagamento) per convertire, modificare e manipolare documenti di formati di file popolari. La nostra API .NET Editor ti consente di caricare il documento, convertirlo in HTML, inviare HTML a un editor HTML esterno e, una volta completata la manipolazione, salvare l'HTML nel suo formato di file originale. Puoi anche recuperare separatamente le risorse allegate a qualsiasi documento. Funziona con tutti i tipi di documenti, come quelli per Microsoft Word, Excel, PowerPoint, PDF, XPS, OpenDocument, Text, Web, Email, e-Book e altro ancora.",
    "tab1": {
      "description": "Di seguito è riportata una panoramica di GroupDocs.Editor per .NET",
      "title": "Manipola usando HTML",
      "content1": "Carica documento supportato",
      "content2": "Modifica contenuto utilizzando HTML",
      "content3": "Modifica stili correlati",
      "content4": "Converti in formato originale"
    },
    "tab2": {
      "description": "GroupDocs.Editor per .NET supporta i seguenti [formati di file](https://docs.groupdocs.com/editor/java/supported-document-formats/)",
      "title": "Altre famiglie di formati",
      "content1": "Formati OpenDocument",
      "content2": "Formati a layout fisso",
      "content3": "Formati web",
      "content4": "Formati di libri elettronici (e-Book)."
    },
    "tab3": {
      "description": "GroupDocs.Editor per .NET supporta i seguenti sistemi operativi, framework e gestori di pacchetti",
      "title_os": "Sistemi operativi",
      "title_frameworks": "Framework supportati",
      "title_packman": "Gestori di pacchetti",
      "title_devenv": "Ambienti di sviluppo"
    }
  },
  "Features": {
    "title": "GroupDocs.Editor per le funzionalità .NET",
    "feature_loop": {
      "1": "Facile integrazione con qualsiasi editor HTML",
      "2": "Converti documento in DOM HTML",
      "3": "Recupera contenuto HTML da Document Stream",
      "4": "Ottieni contenuto HTML e le sue risorse integrate",
      "5": "Ottieni il contenuto del tag corpo HTML dal documento",
      "6": "Ottieni fogli di stile CSS del documento HTML",
      "7": "Attraversa il contenuto HTML e salva le sue risorse",
      "8": "Recupera il DOM HTML dal contenuto della stringa e converti in documento",
      "9": "DOM HTML insieme alla conversione delle risorse",
      "10": "Modifica documenti di vari formati in HTML",
      "11": "Conversione accurata",
      "12": "Applicare la protezione in lettura e/o scrittura al documento risultante",
      "13": "Impagina documenti di elaborazione testi e modificali in qualsiasi editor WYSIWYG",
      "14": "Database (DB) e interfaccia utente (UI) Agnostic",
      "15": "Potenti funzionalità di elaborazione XML",
      "16": "Recupera OTF (Open Type Fonts) dai documenti di input ed esporta nel documento risultante",
      "17": "Elabora immagini raster e vettoriali internamente all'interno dei formati di documenti di input supportati",
      "18": "Inserisci il contenuto del foglio di lavoro modificato nel foglio di lavoro originale in una posizione desiderata",
      "19": "Modifica le diapositive e inseriscile nel foglio di calcolo risultante",
      "20": "Incorpora i caratteri nel documento di elaborazione testi risultante durante il salvataggio"
    },
    "more_features_loop": {
      "title1": "Conversione accurata da e verso HTML DOM",
      "content1": "GroupDocs.Editor per l'API .NET consente alle applicazioni .NET di recuperare un documento di formato supportato e convertirlo in un modello DOM (Document Object Model) HTML insieme all'estrazione di risorse allegate, come CSS. È quindi possibile apportare le modifiche all'HTML utilizzando il proprio editor HTML preferito. Una volta che hai finito con la modifica, GroupDocs.Editor per .NET API ti consente di convertire accuratamente questo DOM HTML nel file originale.",
      "title2": "Carica ed estrai risorse esterne",
      "content2": "GroupDocs.Editor per .NET API è in grado di recuperare le risorse esterne allegate ai documenti supportati, come immagini, font, CSS e altro. Le risorse recuperate possono quindi essere caricate, attraversate e salvate separatamente dal documento HTML risultante. Questo ti dà un output più facile da gestire.",
      "title3": "Applicare effetti di testo nei formati di file di elaborazione testi",
      "content3": "L'API dell'editor di documenti GroupDocs consente di aggiungere effetti di testo complessi (Ombra, effetto 3D, Contorno, Bagliore, Incisione, Rilievo) mentre si lavora con i formati di elaborazione dei documenti Microsoft Word supportati. Questa funzione è abilitata automaticamente e può essere osservata durante l'elaborazione del documento con tali effetti di testo.",
      "title4": "Potenti funzionalità di manipolazione XML",
      "content4-1": "Utilizzando GroupDocs.Editor per .NET API puoi aprire, visualizzare e modificare documenti XML. La nostra API di editing offre supporto speciale e riconoscimento di tag XML, attributi insieme ai loro valori, dichiarazioni XML, sezioni CDATA, definizioni DOCTYPE e altre entità specifiche XML. Puoi personalizzare le impostazioni del carattere e del colore per ogni entità distinta nella struttura XML.",
      "content4-2": "La funzione Convertitore XML è abbastanza intelligente da mostrare gli errori nel file XML e come risolverli. Il meccanismo di riconoscimento dell'URI e della posta elettronica esegue la scansione degli attributi XML e rappresenta gli URI e gli indirizzi e-mail rilevati all'interno del tag A come collegamenti in modo che possano essere modificati come collegamenti, non come testo all'interno del file HTML risultante."
    }
  },
  "Solutions": {
    "title": "GroupDocs.Editor offre API di modifica dei documenti per altri ambienti di sviluppo popolari"
  }
}