{
  "head": {
    "title": "C# .NET Document Editor API | Breyttu Word Excel PowerPoint Web XML með HTML",
    "description": "C# .NET skjalaritara API til að hlaða Microsoft Word, Excel, PowerPoint, PDF, XML, vef- og textaskráarsnið í HTML, vinna og breyta aftur í upprunalegt snið."
  },
  "header": {
    "title": ".NET API til að breyta skjölum með HTML",
    "description": "Þróaðu .NET forrit, til að samþætta HTML ritstjóra, sækja stutt skjal, breyta og breyta í upprunalegt snið."
  },
  "Submenu": {
    "middle": {
      "button_overview": {
        "text": "Yfirlit"
      },
      "button_features": {
        "text": "Eiginleikar"
      },
      "button_support": {
        "text": "Stuðningur"
      },
      "button_livedemo": {
        "text": "Sýning í beinni"
      },
      "button_pricing": {
        "text": "Verðlag"
      }
    }
  },
  "Overview": {
    "content": "GroupDocs.Editor fyrir .NET API hjálpar þér að smíða einföld og auðveld í notkun C#, ASP.NET og önnur .NET forrit sem auðvelt er að samþætta vinsælum HTML ritlum (bæði opnum og greiddum) til að umbreyta, breyta og vinna með skjöl af vinsæl skráarsnið. .NET Editor API okkar gerir þér kleift að hlaða skjalinu, umbreyta því í HTML, ýta HTML yfir í ytri HTML ritstjóra og þegar meðhöndluninni er lokið vistarðu HTML á upprunalega skráarsniðið. Þú getur líka sótt tilföng sérstaklega sem fylgja hvaða skjali sem er. Það virkar með alls kyns skjölum, svo sem fyrir Microsoft Word, Excel, PowerPoint, PDF, XPS, OpenDocument, texta, vef, tölvupóst, rafbók og fleira.",
    "tab1": {
      "description": "Eftirfarandi er yfirlit yfir GroupDocs.Editor fyrir .NET",
      "title": "Vinna með HTML",
      "content1": "Hlaða stutt skjal",
      "content2": "Breyttu efni með HTML",
      "content3": "Breyta tengdum stílum",
      "content4": "Umbreyta í upprunalegt snið"
    },
    "tab2": {
      "description": "GroupDocs.Editor fyrir .NET styður eftirfarandi [skráarsnið](https://docs.groupdocs.com/editor/java/supported-document-formats/)",
      "title": "Önnur snið fjölskyldur",
      "content1": "OpenDocument snið",
      "content2": "Föst uppsetning snið",
      "content3": "Vefsnið",
      "content4": "Rafbók (rafbók) snið"
    },
    "tab3": {
      "description": "GroupDocs.Editor fyrir .NET styður eftirfarandi stýrikerfi, ramma og pakkastjóra",
      "title_os": "Stýrikerfi",
      "title_frameworks": "Stutt rammar",
      "title_packman": "Pakkastjórar",
      "title_devenv": "Þróunarumhverfi"
    }
  },
  "Features": {
    "title": "GroupDocs.Editor fyrir .NET eiginleikar",
    "feature_loop": {
      "1": "Auðveld samþætting við hvaða HTML ritstjóra sem er",
      "2": "Umbreyttu skjali í HTML DOM",
      "3": "Sæktu HTML efni úr Document Stream",
      "4": "Fáðu HTML efni og innbyggð auðlindir þess",
      "5": "Fáðu HTML Body Tag efni úr skjali",
      "6": "Fáðu CSS stílblöð af HTML skjali",
      "7": "Farðu yfir HTML-efni og vistaðu auðlindir þess",
      "8": "Sæktu HTML DOM úr innihaldi strengja og umbreyttu í skjal",
      "9": "HTML DOM ásamt auðlindaviðskiptum",
      "10": "Breyttu skjölum af ýmsum sniðum í HTML",
      "11": "Nákvæm umbreyting",
      "12": "Notaðu les- og/eða skrifvörn á skjal sem myndast",
      "13": "Síðu ritvinnsluskjöl og breyttu í hvaða WYSIWYG ritstjóra sem er",
      "14": "Gagnagrunnur (DB) & notendaviðmót (UI) Agnostic",
      "15": "Öflugir XML vinnslu eiginleikar",
      "16": "Sæktu OTF (Open Type leturgerðir) úr innsláttarskjölum og flyttu út í skjöl sem myndast",
      "17": "Vinndu raster og vektormyndir innbyrðis í studdum inntaksskjalasniðum",
      "18": "Settu innihald breytts vinnublaðs inn í upprunalega töflureiknið á æskilegri staðsetningu",
      "19": "Breyttu skyggnum og settu þær inn í töflureikni sem myndast",
      "20": "Fella leturgerðir inn í ritvinnsluskjal sem myndast meðan þú vistar"
    },
    "more_features_loop": {
      "title1": "Nákvæm umbreyting til og frá HTML DOM",
      "content1": "GroupDocs.Editor fyrir .NET API gerir .NET forritunum þínum kleift að sækja skjal á studdu sniði og breyta því í HTML Document Object Model (DOM) ásamt útdrætti meðfylgjandi auðlinda, svo sem CSS. Þú getur síðan gert breytingar á HTML með uppáhalds HTML ritlinum þínum. Þegar þú ert búinn með klippinguna gerir GroupDocs.Editor fyrir .NET API þér kleift að umbreyta þessu HTML DOM nákvæmlega aftur í upprunalegu skrána.",
      "title2": "Hlaða og draga út ytri auðlindir",
      "content2": "GroupDocs.Editor fyrir .NET API er fær um að sækja ytri auðlindir sem fylgja studdum skjölum, svo sem myndir, leturgerðir, CSS og fleira. Síðan er hægt að hlaða niður tilföngum, fara yfir og vista aðskilið frá HTML skjalinu sem myndast. Þetta gefur þér auðveldara stjórnað úttak.",
      "title3": "Notaðu textaáhrif í ritvinnsluskráarsniðum",
      "content3": "Forritaskil GroupDocs skjalaritara gerir kleift að bæta við flóknum textaáhrifum (Shadow, 3D effect, Outline, Glow, Engrave, Emboss) meðan unnið er með studdum Microsoft Word skjalavinnslusniðum. Þessi eiginleiki er sjálfvirkur virkur sem hægt er að sjá þegar skjalið með slíkum textaáhrifum er unnið.",
      "title4": "Öflugir eiginleikar í XML-meðferð",
      "content4-1": "Með því að nota GroupDocs.Editor fyrir .NET API geturðu opnað, skoðað og breytt XML skjölum. Ritstjórnar-API okkar býður upp á sérstakan stuðning og viðurkenningu á XML-merkjum, eiginleikum ásamt gildum þeirra, XML-yfirlýsingum, CDATA-hlutum, DOCTYPE-skilgreiningum og öðrum XML-sértækum aðilum. Þú getur sérsniðið letur- og litastillingar fyrir hvern sérstakan aðila í XML uppbyggingu.",
      "content4-2": "XML Breytir eiginleiki er nógu snjall til að sýna villur í XML skránni og hvernig á að laga þær. URI- og tölvupóstgreiningarkerfið skannar XML-eiginleika og táknar uppgötvað URI og netföng inni í A-merkinu sem tengla svo hægt sé að breyta þeim sem hlekk, ekki sem texta í HTML-skránni sem myndast."
    }
  },
  "Solutions": {
    "title": "GroupDocs.Editor býður upp á skjalavinnsluforritaskil fyrir önnur vinsæl þróunarumhverfi"
  }
}