{
  "head": {
    "title": "C# .NET Document Editor API | Edit Word Excel PowerPoint Web XML menggunakan HTML",
    "description": "API editor dokumen C# .NET untuk memuatkan Microsoft Word, Excel, PowerPoint, PDF, XML, web dan format fail teks ke dalam HTML, memanipulasi & menukar kembali kepada format asal."
  },
  "header": {
    "title": ".NET API untuk Mengedit Dokumen Menggunakan HTML",
    "description": "Membangunkan Aplikasi .NET, untuk Disepadukan dengan Editor HTML, Ambil Dokumen Disokong, Edit dan Tukar kepada Format Asal."
  },
  "Submenu": {
    "middle": {
      "button_overview": {
        "text": "Gambaran keseluruhan"
      },
      "button_features": {
        "text": "ciri-ciri"
      },
      "button_support": {
        "text": "Sokongan"
      },
      "button_livedemo": {
        "text": "Demo Langsung"
      },
      "button_pricing": {
        "text": "penentuan harga"
      }
    }
  },
  "Overview": {
    "content": "GroupDocs.Editor untuk API .NET membantu anda membina C#, ASP.NET dan aplikasi .NET yang ringkas dan mudah digunakan yang mudah disepadukan dengan editor HTML popular (kedua-dua sumber terbuka & berbayar) untuk menukar, mengedit dan memanipulasi dokumen format fail yang popular. API Editor .NET kami membolehkan anda memuatkan dokumen, menukarnya kepada HTML, menolak HTML ke Editor HTML luaran dan setelah manipulasi selesai, menyimpan HTML ke format fail asalnya. Anda juga boleh mengambil sumber yang dilampirkan secara berasingan dengan mana-mana dokumen. Ia berfungsi dengan semua jenis dokumen, seperti itu untuk Microsoft Word, Excel, PowerPoint, PDF, XPS, OpenDocument, Teks, Web, E-mel, e-Book dan banyak lagi.",
    "tab1": {
      "description": "Berikut ialah gambaran keseluruhan GroupDocs.Editor untuk .NET",
      "title": "Manipulasi Menggunakan HTML",
      "content1": "Muatkan Dokumen yang Disokong",
      "content2": "Edit Kandungan menggunakan HTML",
      "content3": "Edit Gaya Berkaitan",
      "content4": "Tukar kepada Format Asal"
    },
    "tab2": {
      "description": "GroupDocs.Editor untuk .NET menyokong mengikuti [format fail](https://docs.groupdocs.com/editor/java/supported-document-formats/)",
      "title": "Keluarga format lain",
      "content1": "Format OpenDocument",
      "content2": "Format susun atur tetap",
      "content3": "Format web",
      "content4": "Format buku elektronik (e-Book)."
    },
    "tab3": {
      "description": "GroupDocs.Editor untuk .NET menyokong Sistem Operasi, Rangka Kerja & Pengurus Pakej",
      "title_os": "Sistem operasi",
      "title_frameworks": "Rangka Kerja yang Disokong",
      "title_packman": "Pengurus Pakej",
      "title_devenv": "Persekitaran Pembangunan"
    }
  },
  "Features": {
    "title": "GroupDocs.Editor untuk Ciri .NET",
    "feature_loop": {
      "1": "Integrasi Mudah dengan mana-mana HTML-editor",
      "2": "Tukar Dokumen kepada HTML DOM",
      "3": "Ambil Kandungan HTML daripada Strim Dokumen",
      "4": "Dapatkan Kandungan HTML & Sumber Terbenamnya",
      "5": "Dapatkan Kandungan Tag Badan HTML daripada Dokumen",
      "6": "Dapatkan helaian gaya CSS Dokumen HTML",
      "7": "Lintas Kandungan HTML dan Simpan Sumbernya",
      "8": "Ambil HTML DOM daripada Kandungan Rentetan & Tukar kepada Dokumen",
      "9": "HTML DOM bersama-sama dengan Penukaran Sumber",
      "10": "Edit Dokumen Pelbagai Format dalam HTML",
      "11": "Penukaran Tepat",
      "12": "Gunakan Perlindungan Baca dan/atau Tulis pada Dokumen Hasil",
      "13": "Halamankan Dokumen Pemprosesan Perkataan dan Edit dalam Mana-mana Editor WYSIWYG",
      "14": "Pangkalan Data (DB) & Antara Muka Pengguna (UI) Agnostik",
      "15": "Ciri Pemprosesan XML yang Berkuasa",
      "16": "Dapatkan OTF (Fon Jenis Terbuka) daripada Dokumen Input dan Eksport ke Dokumen Hasil",
      "17": "Proses Imej Raster dan Vektor Secara Dalaman dalam Format Dokumen Input yang Disokong",
      "18": "Sisipkan Kandungan Lembaran Kerja yang Diedit ke dalam Hamparan Asal pada Kedudukan Yang Diingini",
      "19": "Edit Slaid dan masukkannya ke dalam Hamparan yang terhasil",
      "20": "Benamkan Fon dalam Dokumen Pemprosesan Kata Terhasil semasa Menyimpan"
    },
    "more_features_loop": {
      "title1": "Penukaran Tepat ke dan dari HTML DOM",
      "content1": "GroupDocs.Editor untuk API .NET membolehkan aplikasi .NET anda mengambil dokumen format yang disokong dan menukarnya kepada Model Objek Dokumen HTML (DOM) bersama-sama dengan pengekstrakan sumber yang dilampirkan, seperti CSS. Anda kemudian boleh membuat pengubahsuaian pada HTML menggunakan Editor HTML kegemaran anda. Sebaik sahaja anda selesai dengan pengeditan, GroupDocs.Editor untuk .NET API membolehkan anda menukar DOM HTML ini kembali kepada fail asal dengan tepat.",
      "title2": "Muat & Ekstrak Sumber Luaran",
      "content2": "GroupDocs.Editor untuk API .NET mampu mengambil sumber luaran yang dilampirkan pada dokumen yang disokong, seperti imej, fon, CSS dan banyak lagi. Sumber yang diambil kemudiannya boleh dimuatkan, dilalui dan disimpan secara berasingan daripada dokumen HTML yang terhasil. Ini memberi anda output yang lebih mudah diuruskan.",
      "title3": "Gunakan Kesan Teks dalam Format Fail Pemprosesan Perkataan",
      "content3": "API penyunting dokumen GroupDocs mendayakan menambah kesan teks yang kompleks (Bayang-bayang, kesan 3D, Garis Besar, Cahaya, Ukir, Timbul) semasa bekerja dengan format pemprosesan dokumen Microsoft Word yang disokong. Ciri ini didayakan secara automatik yang boleh diperhatikan apabila dokumen dengan kesan teks sedemikian diproses.",
      "title4": "Ciri Manipulasi XML yang Berkuasa",
      "content4-1": "Menggunakan GroupDocs.Editor untuk .NET API anda boleh membuka, melihat dan mengedit dokumen XML. API penyuntingan kami menawarkan sokongan dan pengecaman khas teg XML, atribut berserta nilainya, pengisytiharan XML, bahagian CDATA, takrifan DOCTYPE dan entiti khusus XML yang lain. Anda boleh menyesuaikan tetapan fon dan warna untuk setiap entiti yang berbeza dalam struktur XML.",
      "content4-2": "Ciri Penukar XML cukup pintar untuk menunjukkan ralat dalam fail XML dan cara membetulkannya. Mekanisme URI dan pengecam e-mel mengimbas atribut XML dan mewakili URI dan alamat e-mel yang dikesan dalam teg A sebagai pautan supaya ia boleh diedit sebagai pautan, bukan sebagai teks dalam fail HTML yang terhasil."
    }
  },
  "Solutions": {
    "title": "GroupDocs.Editor menawarkan API penyuntingan dokumen untuk persekitaran pembangunan popular yang lain"
  }
}