{
  "head": {
    "title": "C# .NET Document Editor API | ویرایش Word Excel PowerPoint Web XML با استفاده از HTML",
    "description": "API ویرایشگر اسناد C#.NET برای بارگیری فرمت های مایکروسافت ورد، اکسل، پاورپوینت، PDF، XML، وب و فرمت های فایل متنی در HTML، دستکاری و تبدیل مجدد به فرمت اصلی."
  },
  "header": {
    "title": "NET API برای ویرایش اسناد با استفاده از HTML",
    "description": "برنامه های دات نت را برای ادغام با ویرایشگر HTML، واکشی سند پشتیبانی شده، ویرایش و تبدیل به فرمت اصلی توسعه دهید."
  },
  "Submenu": {
    "middle": {
      "button_overview": {
        "text": "بررسی اجمالی"
      },
      "button_features": {
        "text": "امکانات"
      },
      "button_support": {
        "text": "پشتیبانی"
      },
      "button_livedemo": {
        "text": "نسخه نمایشی زنده"
      },
      "button_pricing": {
        "text": "قیمت گذاری"
      }
    }
  },
  "Overview": {
    "content": "GroupDocs.Editor for .NET API به شما کمک می کند تا برنامه های ساده و آسان با استفاده از C#، ASP.NET و دیگر برنامه های دات نت بسازید که به راحتی با ویرایشگرهای محبوب HTML (چه منبع باز و چه پولی) برای تبدیل، ویرایش و دستکاری اسناد ادغام می شوند. فرمت های فایل محبوب API ویرایشگر دات نت ما به شما امکان می دهد سند را بارگیری کنید، آن را به HTML تبدیل کنید، HTML را به ویرایشگر HTML خارجی فشار دهید و پس از انجام دستکاری، HTML را در قالب فایل اصلی ذخیره کنید. همچنین می توانید منابع پیوست شده با هر سند را به طور جداگانه واکشی کنید. این با انواع اسناد مانند مایکروسافت ورد، اکسل، پاورپوینت، PDF، XPS، OpenDocument، متن، وب، ایمیل، کتاب الکترونیکی و موارد دیگر کار می کند.",
    "tab1": {
      "description": "در زیر یک نمای کلی از GroupDocs.Editor برای دات نت ارائه شده است",
      "title": "دستکاری با استفاده از HTML",
      "content1": "بارگذاری سند پشتیبانی شده",
      "content2": "ویرایش محتوا با استفاده از HTML",
      "content3": "ویرایش سبک های مرتبط",
      "content4": "تبدیل به فرمت اصلی"
    },
    "tab2": {
      "description": "GroupDocs.Editor برای دات نت از [فرمت های فایل] زیر پشتیبانی می کند (https://docs.groupdocs.com/editor/java/supported-document-formats/)",
      "title": "خانواده های قالب دیگر",
      "content1": "فرمت های اسناد باز",
      "content2": "فرمت های طرح بندی ثابت",
      "content3": "فرمت های وب",
      "content4": "فرمت های کتاب الکترونیکی (کتاب الکترونیکی)."
    },
    "tab3": {
      "description": "GroupDocs.Editor برای دات نت از سیستم عامل ها، فریم ورک ها و مدیران بسته زیر پشتیبانی می کند",
      "title_os": "سیستم های عامل",
      "title_frameworks": "چارچوب های پشتیبانی شده",
      "title_packman": "مدیران بسته",
      "title_devenv": "محیط های توسعه"
    }
  },
  "Features": {
    "title": "GroupDocs.Editor برای ویژگی های NET",
    "feature_loop": {
      "1": "ادغام آسان با هر ویرایشگر HTML",
      "2": "تبدیل سند به HTML DOM",
      "3": "محتوای HTML را از جریان سند واکشی کنید",
      "4": "محتوای HTML و منابع جاسازی شده آن را دریافت کنید",
      "5": "محتوای تگ بدنه HTML را از سند دریافت کنید",
      "6": "شیوه نامه های CSS سند HTML را دریافت کنید",
      "7": "از محتوای HTML عبور کنید و منابع آن را ذخیره کنید",
      "8": "واکشی HTML DOM از محتوای رشته و تبدیل به سند",
      "9": "HTML DOM همراه با تبدیل منابع",
      "10": "ویرایش اسناد با فرمت های مختلف در HTML",
      "11": "تبدیل دقیق",
      "12": "حفاظت خواندن و/یا نوشتن را برای سند حاصل اعمال کنید",
      "13": "اسناد پردازش کلمه را صفحه بندی کنید و در هر ویرایشگر WYSIWYG ویرایش کنید",
      "14": "پایگاه داده (DB) و رابط کاربری (UI) Agnostic",
      "15": "ویژگی های پردازش XML قدرتمند",
      "16": "بازیابی OTF (فونت های نوع باز) از اسناد ورودی و صادرات به سند نتیجه",
      "17": "تصاویر شطرنجی و برداری را به صورت داخلی در قالب‌های سند ورودی پشتیبانی‌شده پردازش کنید",
      "18": "درج محتویات کاربرگ ویرایش شده در صفحه گسترده اصلی در یک موقعیت دلخواه",
      "19": "اسلایدها را ویرایش کنید و آنها را در صفحه گسترده وارد کنید",
      "20": "در حین ذخیره کردن، فونت‌ها را در سند پردازش ورد نتیجه جاسازی کنید"
    },
    "more_features_loop": {
      "title1": "تبدیل دقیق به و از HTML DOM",
      "content1": "GroupDocs.Editor for .NET API برنامه‌های NET. شما را قادر می‌سازد تا سندی با فرمت پشتیبانی شده واکشی کرده و آن را به یک مدل شی سند HTML (DOM) همراه با استخراج منابع پیوست شده، مانند CSS، تبدیل کنند. سپس می توانید با استفاده از ویرایشگر HTML مورد علاقه خود تغییراتی را در HTML ایجاد کنید. پس از اتمام ویرایش، GroupDocs.Editor for .NET API به شما امکان می دهد تا این HTML DOM را به طور دقیق به فایل اصلی تبدیل کنید.",
      "title2": "بارگیری و استخراج منابع خارجی",
      "content2": "GroupDocs.Editor for .NET API قادر است منابع خارجی متصل به اسناد پشتیبانی شده مانند تصاویر، فونت ها، CSS و موارد دیگر را واکشی کند. سپس منابع واکشی شده را می توان به طور جداگانه از سند HTML حاصل بارگیری، پیمایش و ذخیره کرد. این به شما یک خروجی مدیریت راحت تری می دهد.",
      "title3": "جلوه‌های متنی را در قالب‌های فایل پردازش ورد اعمال کنید",
      "content3": "API ویرایشگر اسناد GroupDocs افزودن جلوه های متنی پیچیده (سایه، جلوه سه بعدی، طرح کلی، درخشش، حکاکی، برجسته) را در حین کار با فرمت های پردازش اسناد Microsoft Word پشتیبانی می کند. این ویژگی به طور خودکار فعال است که می توان آن را در هنگام پردازش سند با چنین جلوه های متنی مشاهده کرد.",
      "title4": "ویژگی های قدرتمند دستکاری XML",
      "content4-1": "با استفاده از GroupDocs.Editor برای NET API می‌توانید اسناد XML را باز، مشاهده و ویرایش کنید. API ویرایش ما پشتیبانی و شناسایی ویژه ای از برچسب های XML، ویژگی ها به همراه مقادیر آنها، اعلان های XML، بخش های CDATA، تعاریف DOCTYPE و سایر موجودیت های خاص XML ارائه می دهد. شما می توانید تنظیمات فونت و رنگ را برای هر موجودیت مجزا در ساختار XML سفارشی کنید.",
      "content4-2": "ویژگی XML Converter به اندازه کافی هوشمند است که خطاهای موجود در فایل XML و نحوه رفع آنها را نشان می دهد. مکانیسم شناسایی URI و ایمیل ویژگی‌های XML را اسکن می‌کند و URI‌ها و آدرس‌های ایمیل شناسایی‌شده در تگ A را به‌عنوان پیوند نشان می‌دهد تا بتوان آن‌ها را به‌عنوان پیوند ویرایش کرد، نه به‌عنوان متن در فایل HTML حاصل."
    }
  },
  "Solutions": {
    "title": "GroupDocs.Editor API های ویرایش اسناد را برای سایر محیط های توسعه محبوب ارائه می دهد"
  }
}