{
    "head": {
        "title": "API редактора документов Java | Редактировать Word Excel PowerPoint Web XML текстовые файлы с помощью HTML",
        "description": "API редактора документов для Java. Загрузить Microsoft Word, Excel, PowerPoint, e-Book, XML, веб и текстовые файлы в HTML, отредактировать и конвертировать обратно в исходный формат после правки."
    },
	"header": {
		"title": "Редактировать документы через HTML с помощью Java API",
		"description": "Интегрируйте Java-приложения с HTML-редактором, чтобы редактировать документы и преобразовывать их обратно в исходный формат."
	},
	"Submenu": {
		"middle" : {
			"button_overview": {
				"text": "Обзор"
			},
			"button_features": {
				"text": "Функции"
			},
			"button_support": {
				"text": "Поддержка"
			},
			"button_livedemo": {
				"text": "Живие демонстрации"
			},
			"button_pricing": {
				"text": "Цены"
			}
		}
	},
	"Overview": {
		"content": "GroupDocs.Editor for Java API позволяет редактировать документы в их HTML-представлении. API поддерживает несколько форматов документов и может быть интегрирован с любым внешним, открытым или платным HTML-редактором. API редактора загрузит документы, преобразует их в HTML, предоставит HTML во внешний пользовательский интерфейс, а затем сохранит HTML в формат исходного документа после обработки. Его также можно использовать для создания различных электронных таблиц Microsoft Word, Excel, файлов PowerPoint, форматов OpenDocument, документов XML и TXT.",
		"tab1": {
			"description": "Ниже приводится обзор GroupDocs.Editor for Java",
			"title": "Управление с помощью HTML",
			"content1": "Загрузить поддерживаемый документ",
			"content2": "Редактировать контент с помощью HTML",
			"content3": "Редактировать связанные стили",
			"content4": "Преобразовать в исходный формат"
		},
		"tab2": {
			"description": "GroupDocs.Editor for Java поддерживает следующие [форматы файлов](https://docs.groupdocs.com/editor/java/supported-document-formats/)",
			"title": "Другие семейства форматов",
			"content1": "Форматы OpenDocument",
			"content2": "Форматы электронной почты",
			"content3": "Веб-форматы",
			"content4": "Форматы электронных книг (e-Book)"
		},
		"tab3": {
			"description": "GroupDocs.Editor for Java поддерживает следующие операционные системы, фреймворки и менеджеры пакетов",
			"title_os": "Операционные системы",
			"title_frameworks": "Поддерживаемые фреймворки",
			"title_packman": "Инструменты автоматизации сборки",
			"title_devenv": "Среды разработки"
		}
	},
	"Features": {
		"title": "Возможности GroupDocs.Editor for Java",
		"feature_loop": {
			"1": "Простая интеграция с HTML-редактором",
			"2": "Преобразование документа в HTML DOM",
			"3": "Извлечение содержимого HTML из потока с содержимым документа",
			"4": "Загружайте, редактируйте и сохраняйте форматы файлов Word, Excel и PowerPoint",
			"5": "Извлечение HTML вместе со встроенными элементам",
			"6": "Импорт, просмотр и редактирование XML-документов",
			"7": "Обход HTML-контента и сохранение встроенных ресурсов",
			"8": "Просмотр, редактирование и сохранение текстовых документов в постраничном режиме",
			"9": "Получить содержимое тэга HTML BODY из файла",
			"10": "Извлечь содержимое CSS из файла HTML",
			"11": "Используйте строковое содержимое для получения HTML DOM и преобразования в файл",
			"12": "Преобразование HTML DOM со встроенными элементами",
			"13": "Преобразование файлов нескольких форматов в HTML для редактирования",
			"14": "Получение метаинформацию входных документов без редактирования",
			"15": "Сохранение отредактированных документов в формате обычного текстового файла",
			"16": "Точность преобразования",
			"17": "Применить пароль к выходному документу",
			"18": "Независим от баз данных",
			"19": "Независим от пользовательского интерфейса",
			"20": "Поддерживает Metered-лицензирование"
		},
		"more_features_loop": {
			"title1": "Точное преобразование в HTML DOM и из него",
			"content1": "Использование GroupDocs.Editor for Java позволяет создавать приложения на Java, которые загружают документ поддерживаемого формата файла для преобразования его в объектную модель документа HTML (DOM) вместе со связанными с ним элементами, например, CSS. Кроме того, наш Java API редактора позволяет редактировать HTML в любом из популярных редакторов HTML. После внесения необходимых изменений GroupDocs.Editor for Java поможет вам преобразовать полученный HTML-код обратно в исходный формат файла.",
			"title2": "Загрузка и выборка ассоциированных элементов",
			"content2": "GroupDocs.Editor for Java API позволяет извлекать связанные элементы из документов поддерживаемых форматов, таких как изображения, CSS, шрифты и многое другое. Затем вы можете загрузить эти извлеченные связанные элементы, просмотреть их и сохранить отдельно от окончательного HTML-файла и получить хорошо управляемый вывод."
		}
	},
	"Solutions": {
		"title": "GroupDocs.Editor предлагает API редактирования документов для других популярных сред разработки."
	}
}