{
  "head": {
    "title": "Java Document Editor API | Επεξεργαστείτε αρχεία κειμένου Word Web XML χρησιμοποιώντας HTML",
    "description": "API επεξεργασίας εγγράφων για Java. Φορτώστε αρχεία Microsoft Word, XML, web και κειμένου σε HTML και μετατρέψτε ξανά στην αρχική μορφή μετά από χειρισμό."
  },
  "header": {
    "title": "Επεξεργασία εγγράφων μέσω HTML χρησιμοποιώντας Java API",
    "description": "Ενσωματώστε εφαρμογές Java με πρόγραμμα επεξεργασίας HTML για χειρισμό εγγράφων και μετατροπή στην αρχική μορφή."
  },
  "Submenu": {
    "middle": {
      "button_overview": {
        "text": "ΣΦΑΙΡΙΚΗ ΕΙΚΟΝΑ"
      },
      "button_features": {
        "text": "Χαρακτηριστικά"
      },
      "button_support": {
        "text": "Υποστήριξη"
      },
      "button_livedemo": {
        "text": "Ζωντανή επίδειξη"
      },
      "button_pricing": {
        "text": "Τιμολόγηση"
      }
    }
  },
  "Overview": {
    "content": "Το GroupDocs.Editor for Java API επιτρέπει την επεξεργασία εγγράφων σε μορφή HTML. Το API υποστηρίζει πολλές μορφές εγγράφων και μπορεί να ενσωματωθεί με οποιοδήποτε εξωτερικό πρόγραμμα επεξεργασίας HTML, ανοιχτού κώδικα ή επί πληρωμή. Το Editor API θα επεξεργαστεί για τη φόρτωση εγγράφων, τη μετατροπή του σε HTML, την παροχή HTML σε εξωτερικό περιβάλλον χρήστη και, στη συνέχεια, την αποθήκευση του HTML στο αρχικό έγγραφο μετά από επεξεργασία. Μπορεί επίσης να χρησιμοποιηθεί για τη δημιουργία διαφορετικών υπολογιστικών φύλλων Microsoft Word, Excel, αρχείων PowerPoint, μορφών OpenDocument, εγγράφων XML και TXT.",
    "tab1": {
      "description": "Ακολουθεί μια επισκόπηση του GroupDocs.Editor για Java",
      "title": "Χειρισμός με χρήση HTML",
      "content1": "Φόρτωση υποστηριζόμενου εγγράφου",
      "content2": "Επεξεργαστείτε το περιεχόμενο χρησιμοποιώντας HTML",
      "content3": "Επεξεργασία σχετικών στυλ",
      "content4": "Μετατροπή σε αρχική μορφή"
    },
    "tab2": {
      "description": "Το GroupDocs.Editor για Java υποστηρίζει τις ακόλουθες [μορφές αρχείων](https://docs.groupdocs.com/editor/java/supported-document-formats/)",
      "title": "Οικογένειες άλλων μορφών",
      "content1": "Μορφές OpenDocument",
      "content2": "Μορφές email",
      "content3": "Μορφές Ιστού",
      "content4": "Μορφές ηλεκτρονικών βιβλίων (e-Book)."
    },
    "tab3": {
      "description": "Το GroupDocs.Editor για Java υποστηρίζει τα ακόλουθα λειτουργικά συστήματα, Frameworks & Package Managers",
      "title_os": "Λειτουργικά συστήματα",
      "title_frameworks": "Υποστηριζόμενα πλαίσια",
      "title_packman": "Εργαλείο Build Automation",
      "title_devenv": "Αναπτυξιακά Περιβάλλοντα"
    }
  },
  "Features": {
    "title": "GroupDocs.Editor για λειτουργίες Java",
    "feature_loop": {
      "1": "Εύκολη ενσωμάτωση επεξεργαστή HTML",
      "2": "Μετατροπή εγγράφου σε HTML DOM",
      "3": "Εξαγωγή περιεχομένου HTML από τη ροή εγγράφων",
      "4": "Φόρτωση, επεξεργασία και αποθήκευση μορφών αρχείων Word, Excel και PowerPoint",
      "5": "Λήψη HTML μαζί με ενσωματωμένα στοιχεία",
      "6": "Εισαγωγή, προβολή και επεξεργασία εγγράφων XML",
      "7": "Παράκαμψη περιεχομένου HTML και αποθήκευση ενσωματωμένων πόρων",
      "8": "Προβολή, επεξεργασία και αποθήκευση εγγράφων επεξεργασίας κειμένου σε σελιδοποίηση",
      "9": "Λάβετε περιεχόμενο της ετικέτας σώματος HTML από το Αρχείο",
      "10": "Εξαγωγή περιεχομένου CSS του αρχείου HTML",
      "11": "Χρησιμοποιήστε το περιεχόμενο συμβολοσειράς για λήψη HTML DOM και μετατροπή σε αρχείο",
      "12": "Μετατροπή HTML DOM με ενσωματωμένα στοιχεία",
      "13": "Μετατροπή αρχείων πολλαπλών μορφών σε HTML για επεξεργασία",
      "14": "Λάβετε μετα-πληροφορίες εγγράφων εισαγωγής χωρίς επεξεργασία",
      "15": "Αποθηκεύστε τα επεξεργασμένα έγγραφα σε μορφή αρχείου απλού κειμένου",
      "16": "Ακρίβεια μετατροπής",
      "17": "Εφαρμογή κωδικού πρόσβασης στο έγγραφο εξόδου",
      "18": "Βάση δεδομένων (DB) Agnostic",
      "19": "Αγνωστική διεπαφή χρήστη (UI).",
      "20": "Υποστηρίζει Metered Licensing"
    },
    "more_features_loop": {
      "title1": "Ακριβής μετατροπή από και προς HTML DOM",
      "content1": "Η χρήση του GroupDocs.Editor για Java σάς επιτρέπει να δημιουργείτε εφαρμογές σε Java που φορτώνουν ένα έγγραφο με υποστηριζόμενη μορφή αρχείου για να το μετατρέψουν σε Μοντέλο αντικειμένου εγγράφου HTML (DOM) μαζί με τα σχετικά στοιχεία του, π.χ. CSS. Επιπλέον, το Editor Java API σας επιτρέπει να επεξεργαστείτε το HTML σε οποιονδήποτε από τους δημοφιλείς επεξεργαστές HTML. Αφού ολοκληρωθούν οι απαιτούμενες τροποποιήσεις, το GroupDocs.Editor για Java σάς βοηθά να μετατρέψετε αυτό το HTML που προκύπτει πίσω στην αρχική του μορφή αρχείου.",
      "title2": "Φόρτωση και ανάκτηση συσχετισμένων στοιχείων",
      "content2": "Το GroupDocs.Editor for Java API σάς δίνει τη δυνατότητα να ανακτήσετε τα σχετικά στοιχεία από έγγραφα υποστηριζόμενων μορφών, όπως εικόνες, CSS, γραμματοσειρές και άλλα. Στη συνέχεια, μπορείτε να φορτώσετε αυτά τα συσχετισμένα στοιχεία που ανακτήθηκαν, να τα διασχίσετε και να τα αποθηκεύσετε ξεχωριστά από το τελικό αρχείο HTML και να έχετε μια καλά διαχειριζόμενη έξοδο."
    }
  },
  "Solutions": {
    "title": "Το GroupDocs.Editor προσφέρει API επεξεργασίας εγγράφων για άλλα δημοφιλή περιβάλλοντα ανάπτυξης"
  }
}