{
  "head": {
    "title": "C# .NET-Dokument-Editor-API | Bearbeiten Sie Word Excel PowerPoint Web XML mit HTML",
    "description": "C# .NET-Dokumenteneditor-API zum Laden von Microsoft Word-, Excel-, PowerPoint-, PDF-, XML-, Web- und Textdateiformaten in HTML, Bearbeiten und Zurückkonvertieren in das Originalformat."
  },
  "header": {
    "title": ".NET-API zum Bearbeiten von Dokumenten mit HTML",
    "description": "Entwickeln Sie .NET-Anwendungen, um sie in den HTML-Editor zu integrieren, unterstützte Dokumente abzurufen, zu bearbeiten und in das Originalformat zu konvertieren."
  },
  "Submenu": {
    "middle": {
      "button_overview": {
        "text": "Überblick"
      },
      "button_features": {
        "text": "Merkmale"
      },
      "button_support": {
        "text": "Die Unterstützung"
      },
      "button_livedemo": {
        "text": "Live-Demo"
      },
      "button_pricing": {
        "text": "Preisgestaltung"
      }
    }
  },
  "Overview": {
    "content": "GroupDocs.Editor für die .NET-API hilft Ihnen, einfache und benutzerfreundliche C#-, ASP.NET- und andere .NET-Anwendungen zu erstellen, die sich problemlos in gängige HTML-Editoren (sowohl Open Source als auch kostenpflichtige) integrieren lassen, um Dokumente zu konvertieren, zu bearbeiten und zu manipulieren beliebte Dateiformate. Mit unserer .NET-Editor-API können Sie Dokumente laden, in HTML konvertieren, HTML an einen externen HTML-Editor senden und nach Abschluss der Bearbeitung den HTML-Code in seinem ursprünglichen Dateiformat speichern. Sie können Ressourcen, die jedem Dokument beigefügt sind, auch separat abrufen. Es funktioniert mit allen Arten von Dokumenten, z. B. für Microsoft Word, Excel, PowerPoint, PDF, XPS, OpenDocument, Text, Web, E-Mail, E-Book und mehr.",
    "tab1": {
      "description": "Nachfolgend finden Sie eine Übersicht über GroupDocs.Editor für .NET",
      "title": "Manipulieren mit HTML",
      "content1": "Unterstütztes Dokument laden",
      "content2": "Bearbeiten Sie Inhalte mit HTML",
      "content3": "Verwandte Stile bearbeiten",
      "content4": "In Originalformat konvertieren"
    },
    "tab2": {
      "description": "GroupDocs.Editor für .NET unterstützt folgende [Dateiformate](https://docs.groupdocs.com/editor/java/supported-document-formats/)",
      "title": "Andere Formatfamilien",
      "content1": "OpenDocument-Formate",
      "content2": "Formate mit festem Layout",
      "content3": "Webformate",
      "content4": "Elektronische Buchformate (e-Book)."
    },
    "tab3": {
      "description": "GroupDocs.Editor für .NET unterstützt folgende Betriebssysteme, Frameworks und Paketmanager",
      "title_os": "Betriebssysteme",
      "title_frameworks": "Unterstützte Frameworks",
      "title_packman": "Paket-Manager",
      "title_devenv": "Entwicklungsumgebungen"
    }
  },
  "Features": {
    "title": "GroupDocs.Editor für .NET-Funktionen",
    "feature_loop": {
      "1": "Einfache Integration mit jedem HTML-Editor",
      "2": "Dokument in HTML-DOM konvertieren",
      "3": "Abrufen von HTML-Inhalten aus dem Dokumentenstrom",
      "4": "Holen Sie sich HTML-Inhalt und seine eingebetteten Ressourcen",
      "5": "Holen Sie sich HTML-Body-Tag-Inhalte aus dem Dokument",
      "6": "Holen Sie sich CSS-Stylesheets des HTML-Dokuments",
      "7": "Durchsuchen Sie HTML-Inhalte und speichern Sie ihre Ressourcen",
      "8": "HTML-DOM aus String-Inhalt abrufen und in Dokument konvertieren",
      "9": "HTML-DOM zusammen mit Ressourcenkonvertierung",
      "10": "Bearbeiten Sie Dokumente verschiedener Formate in HTML",
      "11": "Genaue Konvertierung",
      "12": "Wenden Sie Lese- und/oder Schreibschutz auf das resultierende Dokument an",
      "13": "Paginieren Sie Textverarbeitungsdokumente und bearbeiten Sie sie in beliebigen WYSIWYG-Editoren",
      "14": "Datenbank (DB) & Benutzeroberfläche (UI) Agnostisch",
      "15": "Leistungsstarke XML-Verarbeitungsfunktionen",
      "16": "OTF (Open Type Fonts) aus Eingabedokumenten abrufen und in das resultierende Dokument exportieren",
      "17": "Verarbeiten Sie Raster- und Vektorbilder intern in unterstützten Eingabedokumentformaten",
      "18": "Fügen Sie den Inhalt des bearbeiteten Arbeitsblatts an einer gewünschten Position in das ursprüngliche Arbeitsblatt ein",
      "19": "Bearbeiten Sie Folien und fügen Sie sie in die resultierende Tabelle ein",
      "20": "Betten Sie Schriftarten beim Speichern in das resultierende Textverarbeitungsdokument ein"
    },
    "more_features_loop": {
      "title1": "Präzise Konvertierung zu und von HTML DOM",
      "content1": "GroupDocs.Editor für die .NET-API ermöglicht Ihren .NET-Anwendungen das Abrufen eines Dokuments in einem unterstützten Format und das Konvertieren in ein HTML-Dokumentobjektmodell (DOM) zusammen mit der Extraktion angehängter Ressourcen wie CSS. Sie können dann die Änderungen am HTML mit Ihrem bevorzugten HTML-Editor vornehmen. Sobald Sie mit der Bearbeitung fertig sind, können Sie mit GroupDocs.Editor für die .NET-API dieses HTML-DOM genau wieder in die Originaldatei konvertieren.",
      "title2": "Externe Ressourcen laden und extrahieren",
      "content2": "GroupDocs.Editor für die .NET-API ist in der Lage, die an unterstützte Dokumente angehängten externen Ressourcen wie Bilder, Schriftarten, CSS und mehr abzurufen. Die abgerufenen Ressourcen können dann getrennt von dem resultierenden HTML-Dokument geladen, durchlaufen und gespeichert werden. Dadurch erhalten Sie eine einfacher zu verwaltende Ausgabe.",
      "title3": "Wenden Sie Texteffekte in Textverarbeitungsdateiformaten an",
      "content3": "Die Dokumenteneditor-API von GroupDocs ermöglicht das Hinzufügen komplexer Texteffekte (Schatten, 3D-Effekt, Umriss, Glühen, Gravieren, Prägen) während der Arbeit mit unterstützten Microsoft Word-Dokumentverarbeitungsformaten. Diese Funktion wird automatisch aktiviert, was beobachtet werden kann, wenn das Dokument mit solchen Texteffekten verarbeitet wird.",
      "title4": "Leistungsstarke XML-Manipulationsfunktionen",
      "content4-1": "Mit GroupDocs.Editor für die .NET-API können Sie XML-Dokumente öffnen, anzeigen und bearbeiten. Unsere Bearbeitungs-API bietet spezielle Unterstützung und Erkennung von XML-Tags, Attributen zusammen mit ihren Werten, XML-Deklarationen, CDATA-Abschnitten, DOCTYPE-Definitionen und anderen XML-spezifischen Entitäten. Sie können Schriftart- und Farbeinstellungen für jede einzelne Entität in der XML-Struktur anpassen.",
      "content4-2": "Die XML Converter-Funktion ist intelligent genug, um Fehler in der XML-Datei anzuzeigen und zu beheben. Der URI- und E-Mail-Erkennungsmechanismus scannt XML-Attribute und stellt die erkannten URIs und E-Mail-Adressen innerhalb des A-Tags als Links dar, sodass sie als Link und nicht als Text in der resultierenden HTML-Datei bearbeitet werden können."
    }
  },
  "Solutions": {
    "title": "GroupDocs.Editor bietet Dokumentenbearbeitungs-APIs für andere beliebte Entwicklungsumgebungen"
  }
}