{
  "head": {
    "title": "API biên tập tài liệu C # .NET | Chỉnh sửa Word Excel PowerPoint Web XML bằng HTML",
    "description": "API biên tập tài liệu C # .NET để tải các định dạng tệp Microsoft Word, Excel, PowerPoint, PDF, XML, web và tệp văn bản sang HTML, thao tác và chuyển đổi trở lại định dạng ban đầu."
  },
  "header": {
    "title": ".NET API để chỉnh sửa tài liệu bằng HTML",
    "description": "Phát triển các ứng dụng .NET, để tích hợp với trình soạn thảo HTML, tìm nạp tài liệu được hỗ trợ, chỉnh sửa và chuyển đổi sang định dạng gốc."
  },
  "Submenu": {
    "middle": {
      "button_overview": {
        "text": "Tổng quan"
      },
      "button_features": {
        "text": "Đặc trưng"
      },
      "button_support": {
        "text": "Ủng hộ"
      },
      "button_livedemo": {
        "text": "Bản thử trực tiếp"
      },
      "button_pricing": {
        "text": "Định giá"
      }
    }
  },
  "Overview": {
    "content": "GroupDocs.Editor for .NET API giúp bạn tạo C #, ASP.NET và các ứng dụng .NET khác đơn giản và dễ sử dụng. các định dạng tệp phổ biến. API .NET Editor của chúng tôi cho phép bạn tải tài liệu, chuyển đổi nó sang HTML, đẩy HTML sang HTML Editor bên ngoài và sau khi hoàn tất thao tác, hãy lưu HTML về định dạng tệp gốc của nó. Bạn cũng có thể tìm nạp riêng các tài nguyên được đính kèm với bất kỳ tài liệu nào. Nó hoạt động với tất cả các loại tài liệu, chẳng hạn như cho Microsoft Word, Excel, PowerPoint, PDF, XPS, OpenDocument, Văn bản, Web, Email, Sách điện tử và hơn thế nữa.",
    "tab1": {
      "description": "Sau đây là tổng quan về GroupDocs.Editor cho .NET",
      "title": "Thao tác bằng HTML",
      "content1": "Tải tài liệu được hỗ trợ",
      "content2": "Chỉnh sửa Nội dung bằng HTML",
      "content3": "Chỉnh sửa kiểu có liên quan",
      "content4": "Chuyển đổi sang định dạng gốc"
    },
    "tab2": {
      "description": "GroupDocs.Editor cho .NET hỗ trợ [các định dạng tệp] sau (https://docs.groupdocs.com/editor/java/supported-document-formats/)",
      "title": "Họ định dạng khác",
      "content1": "Định dạng OpenDocument",
      "content2": "Định dạng bố cục cố định",
      "content3": "Định dạng web",
      "content4": "Định dạng sách điện tử (e-Book)"
    },
    "tab3": {
      "description": "GroupDocs.Editor cho .NET hỗ trợ các Hệ điều hành, Khung & Trình quản lý Gói sau",
      "title_os": "Các hệ điều hành",
      "title_frameworks": "Khung được hỗ trợ",
      "title_packman": "Người quản lý gói",
      "title_devenv": "Môi trường phát triển"
    }
  },
  "Features": {
    "title": "GroupDocs.Editor cho các tính năng .NET",
    "feature_loop": {
      "1": "Tích hợp dễ dàng với bất kỳ trình soạn thảo HTML nào",
      "2": "Chuyển đổi tài liệu sang HTML DOM",
      "3": "Tìm nạp nội dung HTML từ luồng tài liệu",
      "4": "Nhận Nội dung HTML và Tài nguyên được Nhúng của nó",
      "5": "Lấy nội dung thẻ nội dung HTML từ tài liệu",
      "6": "Nhận các bảng định kiểu CSS của Tài liệu HTML",
      "7": "Duyệt qua nội dung HTML và lưu tài nguyên của nó",
      "8": "Tìm nạp HTML DOM từ Nội dung chuỗi & Chuyển đổi thành Tài liệu",
      "9": "HTML DOM cùng với Chuyển đổi Tài nguyên",
      "10": "Chỉnh sửa tài liệu của các định dạng khác nhau trong HTML",
      "11": "Chuyển đổi chính xác",
      "12": "Áp dụng Bảo vệ Đọc và / hoặc Ghi cho Tài liệu Kết quả",
      "13": "Phân trang tài liệu xử lý văn bản và chỉnh sửa trong bất kỳ trình chỉnh sửa WYSIWYG nào",
      "14": "Cơ sở dữ liệu (DB) & Giao diện người dùng (UI) bất khả tri",
      "15": "Các tính năng xử lý XML mạnh mẽ",
      "16": "Lấy OTF (Phông chữ kiểu mở) từ Tài liệu đầu vào và Xuất sang Tài liệu kết quả",
      "17": "Xử lý hình ảnh vector và Raster bên trong trong Định dạng tài liệu đầu vào được hỗ trợ",
      "18": "Chèn nội dung của bảng tính đã chỉnh sửa vào bảng tính gốc ở vị trí mong muốn",
      "19": "Chỉnh sửa Trang trình bày và chèn chúng vào Bảng tính kết quả",
      "20": "Nhúng Phông chữ vào Tài liệu Xử lý Văn bản Kết quả trong khi Lưu"
    },
    "more_features_loop": {
      "title1": "Chuyển đổi chính xác đến và từ HTML DOM",
      "content1": "GroupDocs.Editor cho .NET API cho phép các ứng dụng .NET của bạn tìm nạp tài liệu có định dạng được hỗ trợ và chuyển đổi nó thành Mô hình đối tượng tài liệu HTML (DOM) cùng với việc trích xuất các tài nguyên đính kèm, chẳng hạn như CSS. Sau đó, bạn có thể thực hiện các sửa đổi đối với HTML bằng Trình chỉnh sửa HTML yêu thích của mình. Khi bạn hoàn tất việc chỉnh sửa, GroupDocs.Editor cho .NET API cho phép bạn chuyển đổi chính xác DOM HTML này trở lại tệp gốc.",
      "title2": "Tải và trích xuất tài nguyên bên ngoài",
      "content2": "GroupDocs.Editor cho .NET API có khả năng tìm nạp các tài nguyên bên ngoài được đính kèm với các tài liệu được hỗ trợ, chẳng hạn như hình ảnh, phông chữ, CSS và hơn thế nữa. Sau đó, các tài nguyên đã tìm nạp có thể được tải, duyệt và lưu riêng biệt với tài liệu HTML kết quả. Điều này mang lại cho bạn đầu ra dễ dàng quản lý hơn.",
      "title3": "Áp dụng Hiệu ứng Văn bản trong Định dạng Tệp Xử lý Word",
      "content3": "API trình soạn thảo tài liệu GroupDocs cho phép thêm các hiệu ứng văn bản phức tạp (Shadow, 3D effect, Outline, Glow, Engrave, Emboss) trong khi làm việc với các định dạng xử lý tài liệu Microsoft Word được hỗ trợ. Tính năng này được bật tự động có thể được quan sát khi tài liệu với các hiệu ứng văn bản như vậy được xử lý.",
      "title4": "Các tính năng thao tác XML mạnh mẽ",
      "content4-1": "Sử dụng GroupDocs.Editor cho .NET API, bạn có thể mở, xem và chỉnh sửa các tài liệu XML. API chỉnh sửa của chúng tôi cung cấp hỗ trợ đặc biệt và công nhận lại các thẻ XML, thuộc tính cùng với giá trị của chúng, khai báo XML, phần CDATA, định nghĩa DOCTYPE và các thực thể XML cụ thể khác. Bạn có thể tùy chỉnh cài đặt phông chữ và màu sắc cho mọi thực thể riêng biệt trong cấu trúc XML.",
      "content4-2": "Tính năng Chuyển đổi XML đủ thông minh để hiển thị các lỗi trong tệp XML và cách sửa chúng. Cơ chế URI và trình nhận dạng email quét các thuộc tính XML và biểu thị các URI và địa chỉ email được phát hiện bên trong thẻ A dưới dạng liên kết để chúng có thể được chỉnh sửa dưới dạng liên kết, không phải dưới dạng văn bản trong tệp HTML kết quả."
    }
  },
  "Solutions": {
    "title": "GroupDocs.Editor cung cấp các API chỉnh sửa tài liệu cho các môi trường phát triển phổ biến khác"
  }
}