{
  "head": {
    "title": "API do Editor de Documentos Java | Editar arquivos de texto XML da Web do Word usando HTML",
    "description": "API do editor de documentos para Java. Carregue arquivos do Microsoft Word, XML, web e de texto em HTML e converta de volta ao formato original após a manipulação."
  },
  "header": {
    "title": "Editar documentos via HTML usando a API Java",
    "description": "Integre aplicativos Java com o editor HTML para manipular documentos e converter de volta ao formato original."
  },
  "Submenu": {
    "middle": {
      "button_overview": {
        "text": "Visão geral"
      },
      "button_features": {
        "text": "Características"
      },
      "button_support": {
        "text": "Apoiar"
      },
      "button_livedemo": {
        "text": "Demonstração ao vivo"
      },
      "button_pricing": {
        "text": "Preços"
      }
    }
  },
  "Overview": {
    "content": "A API GroupDocs.Editor para Java permite a edição de documentos na forma de HTML. A API suporta vários formatos de documentos e pode ser integrada a qualquer editor HTML externo, de código aberto ou pago. A API do Editor processará para carregar documentos, convertê-los em HTML, fornecer HTML para UI externa e, em seguida, salvar HTML no documento original após a manipulação. Também pode ser usado para gerar diferentes planilhas do Microsoft Word, Excel, arquivos PowerPoint, formatos OpenDocument, documentos XML e TXT.",
    "tab1": {
      "description": "A seguir está uma visão geral do GroupDocs.Editor para Java",
      "title": "Manipular usando HTML",
      "content1": "Carregar Documento Suportado",
      "content2": "Editar conteúdo usando HTML",
      "content3": "Editar estilos relacionados",
      "content4": "Converter para o formato original"
    },
    "tab2": {
      "description": "O GroupDocs.Editor para Java suporta os seguintes [formatos de arquivo](https://docs.groupdocs.com/editor/java/supported-document-formats/)",
      "title": "Outras famílias de formatos",
      "content1": "Formatos de Documentos Abertos",
      "content2": "Formatos de e-mail",
      "content3": "Formatos da Web",
      "content4": "Formatos de livro eletrônico (e-Book)"
    },
    "tab3": {
      "description": "GroupDocs.Editor para Java suporta os seguintes sistemas operacionais, frameworks e gerenciadores de pacotes",
      "title_os": "Sistemas operacionais",
      "title_frameworks": "Estruturas Suportadas",
      "title_packman": "Ferramenta de automação de compilação",
      "title_devenv": "Ambientes de Desenvolvimento"
    }
  },
  "Features": {
    "title": "Recursos do GroupDocs.Editor para Java",
    "feature_loop": {
      "1": "Integração fácil do editor de HTML",
      "2": "Conversão de documentos para HTML DOM",
      "3": "Extrair conteúdo HTML do fluxo de documentos",
      "4": "Carregar, editar e salvar formatos de arquivo do Word, Excel e PowerPoint",
      "5": "Buscar HTML junto com elementos incorporados",
      "6": "Importar, visualizar e editar documentos XML",
      "7": "Ignorar o conteúdo HTML e salvar recursos incorporados",
      "8": "Visualize, edite e salve documentos de processamento de texto no modo paginal",
      "9": "Obter conteúdo da tag de corpo HTML do arquivo",
      "10": "Extrair o conteúdo CSS do arquivo HTML",
      "11": "Use o conteúdo de string para obter HTML DOM e converter em arquivo",
      "12": "Converter HTML DOM com elementos incorporados",
      "13": "Converter arquivos de vários formatos em HTML para edição",
      "14": "Obtenha informações meta de documentos de entrada sem edição",
      "15": "Salvar documentos editados em formato de arquivo de texto simples",
      "16": "Precisão da conversão",
      "17": "Aplicar senha ao documento de saída",
      "18": "Banco de dados (DB) agnóstico",
      "19": "Interface do usuário (UI) agnóstica",
      "20": "Suporta licenciamento medido"
    },
    "more_features_loop": {
      "title1": "Converter com precisão de e para HTML DOM",
      "content1": "O uso do GroupDocs.Editor para Java permite que você crie aplicativos em Java que carregam um documento de formato de arquivo suportado para convertê-lo em HTML Document Object Model (DOM) juntamente com seus elementos associados, por exemplo, CSS. Além disso, nosso Editor Java API permite que você edite o HTML em qualquer um dos editores de HTML populares. Depois que as modificações necessárias forem feitas, o GroupDocs.Editor para Java o ajuda a converter esse HTML resultante de volta ao formato de arquivo original.",
      "title2": "Carregar e buscar elementos associados",
      "content2": "GroupDocs.Editor para API Java permite que você busque os elementos associados de documentos de formatos suportados, como imagens, CSS, fontes e muito mais. Em seguida, você pode carregar esses elementos associados buscados, percorrê-los e salvá-los separadamente do arquivo HTML final e ter uma saída bem gerenciada."
    }
  },
  "Solutions": {
    "title": "O GroupDocs.Editor oferece APIs de edição de documentos para outros ambientes de desenvolvimento populares"
  }
}