{
  "head": {
    "title": "დოკუმენტის რედაქტირების გადაწყვეტა | Premise API-ებზე და უფასო აპებზე",
    "description": "დოკუმენტის რედაქტირება Microsoft Office, OpenDocument, PDF და სხვა ფაილის ფორმატებისთვის On Premise API-ების გამოყენებით ან გამოიყენეთ ონლაინ დოკუმენტების რედაქტორის აპლიკაცია."
  },
  "header": {
    "title": "დოკუმენტის რედაქტირების გადაწყვეტა",
    "description": "დოკუმენტის რედაქტორი Microsoft Office, OpenOffice, PDF, HTML და სხვა დოკუმენტის ფაილის ფორმატებში მანიპულირებისთვის."
  },
  "APIs": {
    "API_loop_high_code": {
      "title": "GroupDocs.Editor High Code APIs Include",
      "label": "ყველა High Code API-ის ნახვა",
      "API_product_net": {
        "content": "Premise .NET API-ზე, რომელიც ეხმარება თქვენს აპლიკაციას ნახოს, დაარედაქტიროს და შემდეგ გადაიყვანოს დოკუმენტები."
      },
      "API_product_java": {
        "content": "დოკუმენტის რედაქტირების API Microsoft Office, OpenOffice, HTML და სხვა დოკუმენტებისთვის Java-ზე დაფუძნებულ აპლიკაციებში მანიპულირებისთვის."
      }
    },
    "API_loop_low_code": {
      "title": "GroupDocs.Editor Low Code APIs Include",
      "label": "იხილეთ ყველა Low Code API",
      "Cloud_SDK_net": {
        "content": "დაამატეთ დოკუმენტის ფორმატების რედაქტირების ფუნქციები .NET აპლიკაციებში Cloud SDK-ის გამოყენებით .NET-ისთვის. შეცვალეთ MS Office, ვებ და XML დოკუმენტები."
      },
      "Cloud_SDK_java": {
        "content": "გაფართოებული დოკუმენტის რედაქტორი SDK ჯავის აპლიკაციებისთვის ინდუსტრიის სტანდარტული დოკუმენტის ფაილის ფორმატების რედაქტირებისთვის ნებისმიერ პლატფორმაზე, რომელსაც შეუძლია REST API-ების გამოძახება."
      }
    },
    "API_loop_no_code": {
      "title": "GroupDocs.Editor No Code Apps Include",
      "label": "იხილეთ ყველა No Code აპი",
      "Total": {
        "content": "ვებ-ზე დაფუძნებული უფასო ონლაინ აპი პოპულარული ფაილის ფორმატების რედაქტირებისთვის Office და OpenOffice-დან."
      },
      "DOCX": {
        "content": "უფასო რედაქტორის აპლიკაცია Microsoft Word-ის დოკუმენტების ონლაინ სანახავად და რედაქტირებისთვის."
      },
      "PDF": {
        "content": "გამოიყენეთ ნებისმიერი მოწყობილობა, ნებისმიერი ბრაუზერი PDF და XPS დოკუმენტების სანახავად ან რედაქტირებისთვის."
      }
    }
  }
}