{
  "head": {
    "title": "Interfejs API edytora dokumentów Java | Edytuj pliki tekstowe Word Web XML za pomocą HTML",
    "description": "Edytor dokumentów API dla Javy. Załaduj pliki Microsoft Word, XML, internetowe i tekstowe do HTML i przekonwertuj je z powrotem do oryginalnego formatu po manipulacji."
  },
  "header": {
    "title": "Edytuj dokumenty za pomocą HTML za pomocą Java API",
    "description": "Zintegruj aplikacje Java z edytorem HTML, aby manipulować dokumentami i konwertować je z powrotem do oryginalnego formatu."
  },
  "Submenu": {
    "middle": {
      "button_overview": {
        "text": "Przegląd"
      },
      "button_features": {
        "text": "Cechy"
      },
      "button_support": {
        "text": "Wspierać się"
      },
      "button_livedemo": {
        "text": "Demo na żywo"
      },
      "button_pricing": {
        "text": "cennik"
      }
    }
  },
  "Overview": {
    "content": "GroupDocs.Editor for Java API umożliwia edycję dokumentów w postaci HTML. API obsługuje wiele formatów dokumentów i może być zintegrowany z dowolnym zewnętrznym, otwartym lub płatnym edytorem HTML. Edytor API będzie przetwarzać w celu załadowania dokumentów, przekonwertowania ich na HTML, udostępnienia HTML do zewnętrznego interfejsu użytkownika, a następnie zapisania HTML do oryginalnego dokumentu po manipulacji. Może być również używany do generowania różnych arkuszy kalkulacyjnych Microsoft Word, Excel, plików PowerPoint, formatów OpenDocument, dokumentów XML i TXT.",
    "tab1": {
      "description": "Poniżej znajduje się omówienie GroupDocs.Editor for Java",
      "title": "Manipuluj używając HTML",
      "content1": "Załaduj obsługiwany dokument",
      "content2": "Edytuj zawartość za pomocą HTML",
      "content3": "Edytuj powiązane style",
      "content4": "Konwertuj na oryginalny format"
    },
    "tab2": {
      "description": "GroupDocs.Editor for Java obsługuje następujące [formaty plików](https://docs.groupdocs.com/editor/java/supported-document-formats/)",
      "title": "Inne rodziny formatów",
      "content1": "Formaty OpenDocument",
      "content2": "Formaty e-maili",
      "content3": "Formaty internetowe",
      "content4": "Formaty książek elektronicznych (e-booków)"
    },
    "tab3": {
      "description": "GroupDocs.Editor for Java obsługuje następujące systemy operacyjne, frameworki i menedżery pakietów",
      "title_os": "System operacyjny",
      "title_frameworks": "Obsługiwane frameworki",
      "title_packman": "Narzędzie do automatyzacji kompilacji",
      "title_devenv": "Środowiska programistyczne"
    }
  },
  "Features": {
    "title": "GroupDocs.Editor dla funkcji Java",
    "feature_loop": {
      "1": "Łatwa integracja z edytorem HTML",
      "2": "Konwersja dokumentu do HTML DOM",
      "3": "Wyodrębnij zawartość HTML ze strumienia dokumentów",
      "4": "Załaduj, edytuj i zapisz formaty plików Word, Excel i PowerPoint",
      "5": "Pobierz HTML wraz z osadzonymi elementami",
      "6": "Importuj, przeglądaj i edytuj dokumenty XML",
      "7": "Pomiń zawartość HTML i zapisz osadzone zasoby",
      "8": "Przeglądaj, edytuj i zapisuj dokumenty przetwarzania tekstu w trybie stronicowym",
      "9": "Pobierz zawartość znacznika treści HTML z pliku",
      "10": "Wyodrębnij zawartość CSS z pliku HTML",
      "11": "Użyj zawartości ciągu, aby uzyskać HTML DOM i przekonwertować na plik",
      "12": "Konwertuj HTML DOM z osadzonymi elementami",
      "13": "Konwertuj pliki w wielu formatach w HTML do edycji",
      "14": "Uzyskaj metainformacje o dokumentach wejściowych bez edycji",
      "15": "Zapisz edytowane dokumenty w formacie pliku zwykłego tekstu",
      "16": "Dokładność konwersji",
      "17": "Zastosuj hasło do dokumentu wyjściowego",
      "18": "Baza danych (DB) Agnostyk",
      "19": "Niezależny interfejs użytkownika (UI)",
      "20": "Obsługuje licencjonowanie miarowe"
    },
    "more_features_loop": {
      "title1": "Dokładna konwersja do iz HTML DOM",
      "content1": "Korzystanie z GroupDocs.Editor for Java umożliwia tworzenie aplikacji w Javie, które ładują dokument w obsługiwanym formacie pliku, aby przekonwertować go na HTML Document Object Model (DOM) wraz z powiązanymi z nim elementami, np. CSS. Ponadto nasz Editor Java API umożliwia edycję kodu HTML w dowolnym z popularnych edytorów HTML. Po wykonaniu wymaganych modyfikacji GroupDocs.Editor for Java pomoże Ci przekonwertować wynikowy kod HTML z powrotem do oryginalnego formatu pliku.",
      "title2": "Załaduj i pobierz powiązane elementy",
      "content2": "GroupDocs.Editor dla Java API umożliwia pobieranie powiązanych elementów z dokumentów w obsługiwanych formatach, takich jak obrazy, CSS, czcionki i inne. Następnie możesz załadować te pobrane skojarzone elementy, przejrzeć je i zapisać oddzielnie od końcowego pliku HTML i uzyskać dobrze zarządzane dane wyjściowe."
    }
  },
  "Solutions": {
    "title": "GroupDocs.Editor oferuje interfejsy API do edycji dokumentów dla innych popularnych środowisk programistycznych"
  }
}