{
  "head": {
    "title": "सी# .NET दस्तावेज़ संपादक एपीआई | HTML का उपयोग करके Word Excel PowerPoint वेब XML संपादित करें",
    "description": "सी # .NET दस्तावेज़ संपादक एपीआई माइक्रोसॉफ्ट वर्ड, एक्सेल, पावरपॉइंट, पीडीएफ, एक्सएमएल, वेब और टेक्स्ट फ़ाइल स्वरूपों को एचटीएमएल में लोड करने के लिए, हेरफेर और मूल प्रारूप में वापस कनवर्ट करें।"
  },
  "header": {
    "title": "HTML का उपयोग करके दस्तावेज़ों को संपादित करने के लिए .NET API",
    "description": "HTML संपादक के साथ एकीकृत करने के लिए .NET एप्लिकेशन विकसित करें, समर्थित दस्तावेज़ प्राप्त करें, संपादित करें और मूल स्वरूप में कनवर्ट करें।"
  },
  "Submenu": {
    "middle": {
      "button_overview": {
        "text": "अवलोकन"
      },
      "button_features": {
        "text": "विशेषताएँ"
      },
      "button_support": {
        "text": "सहायता"
      },
      "button_livedemo": {
        "text": "लाइव डेमो"
      },
      "button_pricing": {
        "text": "मूल्य निर्धारण"
      }
    }
  },
  "Overview": {
    "content": ".NET API के लिए GroupDocs.Editor आपको सरल और उपयोग में आसान C#, ASP.NET, और अन्य .NET एप्लिकेशन बनाने में मदद करता है जो लोकप्रिय HTML संपादकों (ओपन-सोर्स और पेड दोनों) के साथ आसानी से एकीकृत हो जाते हैं ताकि दस्तावेजों को परिवर्तित, संपादित और हेरफेर किया जा सके। लोकप्रिय फ़ाइल स्वरूप। हमारा .NET Editor API आपको दस्तावेज़ लोड करने, उसे HTML में बदलने, HTML को बाहरी HTML संपादक पर धकेलने देता है, और एक बार हेरफेर हो जाने के बाद, HTML को उसके मूल फ़ाइल स्वरूप में सहेजता है। आप किसी दस्तावेज़ के साथ संलग्न संसाधनों को अलग से भी प्राप्त कर सकते हैं। यह सभी प्रकार के दस्तावेज़ों के साथ काम करता है, जैसे कि Microsoft Word, Excel, PowerPoint, PDF, XPS, OpenDocument, टेक्स्ट, वेब, ईमेल, ई-बुक आदि के लिए।",
    "tab1": {
      "description": ".NET के लिए GroupDocs.Editor का अवलोकन निम्नलिखित है:",
      "title": "HTML का उपयोग करके हेरफेर करें",
      "content1": "समर्थित दस्तावेज़ लोड करें",
      "content2": "HTML का उपयोग करके सामग्री संपादित करें",
      "content3": "संबंधित शैलियाँ संपादित करें",
      "content4": "मूल प्रारूप में कनवर्ट करें"
    },
    "tab2": {
      "description": ".NET के लिए GroupDocs.Editor निम्नलिखित [फ़ाइल स्वरूपों] का समर्थन करता है (https://docs.groupdocs.com/editor/java/supported-document-formats/)",
      "title": "अन्य प्रारूप परिवार",
      "content1": "ओपन दस्तावेज़ प्रारूप",
      "content2": "फिक्स्ड-लेआउट प्रारूप",
      "content3": "वेब प्रारूप",
      "content4": "इलेक्ट्रॉनिक पुस्तक (ई-बुक) प्रारूप"
    },
    "tab3": {
      "description": ".NET के लिए GroupDocs.Editor निम्नलिखित ऑपरेटिंग सिस्टम, फ्रेमवर्क और पैकेज मैनेजर का समर्थन करता है",
      "title_os": "ऑपरेटिंग सिस्टम",
      "title_frameworks": "समर्थित चौखटे",
      "title_packman": "पैकेज प्रबंधक",
      "title_devenv": "विकास का माहौल"
    }
  },
  "Features": {
    "title": "GroupDocs.Editor for .NET सुविधाएँ",
    "feature_loop": {
      "1": "किसी भी HTML-संपादक के साथ आसान एकीकरण",
      "2": "दस्तावेज़ को HTML DOM में बदलें",
      "3": "दस्तावेज़ स्ट्रीम से HTML सामग्री प्राप्त करें",
      "4": "HTML सामग्री और उसके एम्बेडेड संसाधन प्राप्त करें",
      "5": "दस्तावेज़ से HTML बॉडी टैग सामग्री प्राप्त करें",
      "6": "HTML दस्तावेज़ की CSS स्टाइलशीट प्राप्त करें",
      "7": "HTML सामग्री को ट्रैवर्स करें और इसके संसाधनों को बचाएं",
      "8": "स्ट्रिंग सामग्री से HTML DOM प्राप्त करें और दस्तावेज़ में कनवर्ट करें",
      "9": "संसाधन रूपांतरण के साथ HTML DOM",
      "10": "HTML में विभिन्न स्वरूपों के दस्तावेज़ संपादित करें",
      "11": "सटीक रूपांतरण",
      "12": "परिणामी दस्तावेज़ के लिए पढ़ें और/या सुरक्षा लिखें लागू करें",
      "13": "वर्ड प्रोसेसिंग दस्तावेज़ों को पृष्ठांकित करें और किसी भी WYSIWYG संपादकों में संपादित करें",
      "14": "डेटाबेस (डीबी) और यूजर इंटरफेस (यूआई) अज्ञेयवादी",
      "15": "शक्तिशाली एक्सएमएल प्रसंस्करण विशेषताएं",
      "16": "इनपुट दस्तावेज़ों से ओटीएफ (ओपन टाइप फ़ॉन्ट्स) पुनर्प्राप्त करें और परिणामी दस्तावेज़ में निर्यात करें",
      "17": "समर्थित इनपुट दस्तावेज़ स्वरूपों के भीतर आंतरिक रूप से रेखापुंज और वेक्टर छवियों को संसाधित करें",
      "18": "संपादित कार्यपत्रक की सामग्री को वांछित स्थिति में मूल स्प्रेडशीट में सम्मिलित करें",
      "19": "स्लाइड संपादित करें और उन्हें परिणामी स्प्रैडशीट में डालें",
      "20": "सहेजते समय परिणामी वर्ड प्रोसेसिंग दस्तावेज़ में फ़ॉन्ट एम्बेड करें"
    },
    "more_features_loop": {
      "title1": "HTML DOM में और से सटीक रूपांतरण",
      "content1": ".NET API के लिए GroupDocs.Editor आपके .NET अनुप्रयोगों को समर्थित प्रारूप का एक दस्तावेज़ लाने और सीएसएस जैसे संलग्न संसाधनों के निष्कर्षण के साथ इसे HTML दस्तावेज़ ऑब्जेक्ट मॉडल (DOM) में बदलने में सक्षम बनाता है। फिर आप अपने पसंदीदा HTML संपादक का उपयोग करके HTML में संशोधन कर सकते हैं। एक बार जब आप संपादन कर लेते हैं, तो .NET API के लिए GroupDocs.Editor आपको इस HTML DOM को मूल फ़ाइल में सटीक रूप से परिवर्तित करने की अनुमति देता है।",
      "title2": "बाहरी संसाधनों को लोड करें और निकालें",
      "content2": "GroupDocs.Editor for .NET API समर्थित दस्तावेज़ों से जुड़े बाहरी संसाधनों को लाने में सक्षम है, जैसे कि चित्र, फ़ॉन्ट, CSS और बहुत कुछ। फिर प्राप्त किए गए संसाधनों को परिणामी HTML दस्तावेज़ से अलग से लोड, ट्रैवर्स और सहेजा जा सकता है। यह आपको अधिक आसानी से प्रबंधित आउटपुट देता है।",
      "title3": "वर्ड प्रोसेसिंग फ़ाइल स्वरूपों के भीतर पाठ प्रभाव लागू करें",
      "content3": "GroupDocs दस्तावेज़ संपादक API समर्थित Microsoft Word दस्तावेज़ संसाधन स्वरूपों के साथ काम करते हुए जटिल पाठ प्रभाव (छाया, 3D प्रभाव, रूपरेखा, चमक, उत्कीर्णन, एम्बॉस) जोड़ने में सक्षम बनाता है। यह सुविधा स्वतः-सक्षम है जिसे ऐसे पाठ प्रभावों वाले दस्तावेज़ के संसाधित होने पर देखा जा सकता है।",
      "title4": "शक्तिशाली एक्सएमएल मैनिपुलेशन विशेषताएं",
      "content4-1": ".NET API के लिए GroupDocs.Editor का उपयोग करके आप XML दस्तावेज़ों को खोल, देख और संपादित कर सकते हैं। हमारा संपादन एपीआई एक्सएमएल टैग, विशेषताओं के साथ-साथ उनके मूल्यों, एक्सएमएल घोषणाओं, सीडीएटीए अनुभागों, डॉक्टरेट परिभाषाओं, और अन्य एक्सएमएल विशिष्ट इकाइयों का विशेष समर्थन और पहचान प्रदान करता है। आप XML संरचना में प्रत्येक विशिष्ट निकाय के लिए फ़ॉन्ट और रंग सेटिंग्स को अनुकूलित करने में सक्षम हैं।",
      "content4-2": "एक्सएमएल कन्वर्टर फीचर एक्सएमएल फाइल में त्रुटियों को दिखाने और उन्हें ठीक करने का तरीका दिखाने के लिए काफी स्मार्ट है। यूआरआई और ईमेल पहचानकर्ता तंत्र एक्सएमएल विशेषताओं को स्कैन करता है और ए टैग के अंदर पाए गए यूआरआई और ईमेल पते को लिंक के रूप में दर्शाता है ताकि उन्हें लिंक के रूप में संपादित किया जा सके, न कि परिणामी एचटीएमएल फाइल के टेक्स्ट के रूप में।"
    }
  },
  "Solutions": {
    "title": "GroupDocs.Editor अन्य लोकप्रिय विकास परिवेशों के लिए दस्तावेज़ संपादन API प्रदान करता है"
  }
}