{
  "head": {
    "title": "Java Document Editor API | Word Web XML szövegfájlok szerkesztése HTML használatával",
    "description": "Java dokumentumszerkesztő API. Töltse be a Microsoft Word-, XML-, web- és szöveges fájlokat HTML-be, és a manipuláció után konvertálja vissza az eredeti formátumba."
  },
  "header": {
    "title": "Dokumentumok szerkesztése HTML-en keresztül Java API használatával",
    "description": "Integrálja a Java-alkalmazásokat HTML-szerkesztővel a dokumentumok kezeléséhez és az eredeti formátumba való visszaállításhoz."
  },
  "Submenu": {
    "middle": {
      "button_overview": {
        "text": "Áttekintés"
      },
      "button_features": {
        "text": "Jellemzők"
      },
      "button_support": {
        "text": "Támogatás"
      },
      "button_livedemo": {
        "text": "Élő Demo"
      },
      "button_pricing": {
        "text": "Árazás"
      }
    }
  },
  "Overview": {
    "content": "A GroupDocs.Editor for Java API lehetővé teszi a dokumentumok HTML formátumú szerkesztését. Az API többféle dokumentumformátumot támogat, és bármilyen külső, nyílt forráskódú vagy fizetős HTML-szerkesztővel integrálható. A Szerkesztő API feldolgozza a dokumentumok betöltését, HTML formátumba konvertálja, HTML-t biztosít a külső felhasználói felületre, majd a manipuláció után menti a HTML-t az eredeti dokumentumba. Különféle Microsoft Word, Excel táblázatok, PowerPoint fájlok, OpenDocument formátumok, XML és TXT dokumentumok generálására is használható.",
    "tab1": {
      "description": "Az alábbiakban a GroupDocs.Editor for Java áttekintése látható",
      "title": "Manipulálás HTML használatával",
      "content1": "Töltsön be támogatott dokumentumot",
      "content2": "Tartalom szerkesztése HTML használatával",
      "content3": "Kapcsolódó stílusok szerkesztése",
      "content4": "Konvertálja eredeti formátumra"
    },
    "tab2": {
      "description": "A GroupDocs.Editor for Java a következő [fájlformátumokat] támogatja (https://docs.groupdocs.com/editor/java/supported-document-formats/)",
      "title": "Egyéb formátumcsaládok",
      "content1": "OpenDocument formátumok",
      "content2": "E-mail formátumok",
      "content3": "Webes formátumok",
      "content4": "Elektronikus könyv (e-Book) formátumok"
    },
    "tab3": {
      "description": "A GroupDocs.Editor for Java a következő operációs rendszereket, keretrendszereket és csomagkezelőket támogatja",
      "title_os": "Operációs rendszer",
      "title_frameworks": "Támogatott keretrendszerek",
      "title_packman": "Build Automation Tool",
      "title_devenv": "Fejlesztési környezetek"
    }
  },
  "Features": {
    "title": "GroupDocs.Editor a Java szolgáltatásokhoz",
    "feature_loop": {
      "1": "Egyszerű HTML-szerkesztő integráció",
      "2": "Dokumentum konvertálása HTML DOM-ba",
      "3": "HTML-tartalom kibontása a Dokumentumfolyamból",
      "4": "Word, Excel és PowerPoint fájlformátumok betöltése, szerkesztése és mentése",
      "5": "Töltse le a HTML-t a beágyazott elemekkel együtt",
      "6": "XML-dokumentumok importálása, megtekintése és szerkesztése",
      "7": "A HTML-tartalom megkerülése és a beágyazott erőforrások mentése",
      "8": "Szövegszerkesztő dokumentumok megtekintése, szerkesztése és mentése oldalas módban",
      "9": "Szerezze be a HTML törzscímke tartalmát a fájlból",
      "10": "A HTML-fájl CSS-tartalmának kibontása",
      "11": "Használjon karakterlánc-tartalmat a HTML DOM-hoz és a fájlba konvertálásához",
      "12": "HTML DOM konvertálása beágyazott elemekkel",
      "13": "Több formátumú fájl konvertálása HTML-be szerkesztés céljából",
      "14": "Szerkesztés nélkül szerezheti be a bemeneti dokumentumok metainformációit",
      "15": "A szerkesztett dokumentumok mentése egyszerű szöveges fájlformátumba",
      "16": "Konverziós pontosság",
      "17": "Jelszó alkalmazása a kimeneti dokumentumhoz",
      "18": "Adatbázis (DB) Agnostic",
      "19": "Felhasználói felület (UI) Agnosztikus",
      "20": "Támogatja a mért licencelést"
    },
    "more_features_loop": {
      "title1": "Pontos konvertálás HTML DOM-ra és HTML DOM-ból",
      "content1": "A GroupDocs.Editor for Java használatával olyan Java-alkalmazásokat készíthet, amelyek betöltenek egy támogatott fájlformátumú dokumentumot, hogy azt HTML-dokumentumobjektum-modellré (DOM) alakítsák át a hozzá tartozó elemekkel, például CSS-szel. Ezenkívül a Szerkesztő Java API lehetővé teszi a HTML szerkesztését bármelyik népszerű HTML szerkesztőben. A szükséges módosítások elvégzése után a GroupDocs.Editor for Java segít az eredményül kapott HTML-kód visszakonvertálásában az eredeti fájlformátumra.",
      "title2": "Társított elemek betöltése és lekérése",
      "content2": "A GroupDocs.Editor for Java API lehetővé teszi a kapcsolódó elemek lekérését támogatott formátumú dokumentumokból, például képekből, CSS-ből, betűtípusokból és egyebekből. Ezután betöltheti ezeket a lekért társított elemeket, bejárhatja és a végső HTML-fájltól elkülönítve mentheti őket, és jól kezelhető kimenettel rendelkezhet."
    }
  },
  "Solutions": {
    "title": "A GroupDocs.Editor dokumentumszerkesztő API-kat kínál más népszerű fejlesztői környezetekhez"
  }
}