{
  "head": {
    "title": "Java Document Editor API | فایل های متنی Word Web XML را با استفاده از HTML ویرایش کنید",
    "description": "API ویرایشگر سند برای جاوا. فایل های Microsoft Word، XML، وب و متن را در HTML بارگیری کنید و پس از دستکاری به فرمت اصلی تبدیل کنید."
  },
  "header": {
    "title": "ویرایش اسناد از طریق HTML با استفاده از Java API",
    "description": "برنامه های جاوا را با ویرایشگر HTML برای دستکاری اسناد و تبدیل مجدد به فرمت اصلی ادغام کنید."
  },
  "Submenu": {
    "middle": {
      "button_overview": {
        "text": "بررسی اجمالی"
      },
      "button_features": {
        "text": "امکانات"
      },
      "button_support": {
        "text": "پشتیبانی"
      },
      "button_livedemo": {
        "text": "نسخه نمایشی زنده"
      },
      "button_pricing": {
        "text": "قیمت گذاری"
      }
    }
  },
  "Overview": {
    "content": "GroupDocs.Editor for Java API ویرایش اسناد را در قالب HTML فعال می کند. API از چندین فرمت سند پشتیبانی می کند و می تواند با هر ویرایشگر HTML خارجی، منبع باز یا پولی ادغام شود. API ویرایشگر برای بارگیری اسناد، تبدیل آن به HTML، ارائه HTML به UI خارجی و سپس ذخیره HTML در سند اصلی پس از دستکاری، پردازش می کند. همچنین می توان از آن برای تولید صفحات گسترده Microsoft Word، Excel، فایل های پاورپوینت، فرمت های OpenDocument، اسناد XML و TXT استفاده کرد.",
    "tab1": {
      "description": "در زیر مروری بر GroupDocs.Editor برای جاوا است",
      "title": "دستکاری با استفاده از HTML",
      "content1": "بارگذاری سند پشتیبانی شده",
      "content2": "ویرایش محتوا با استفاده از HTML",
      "content3": "ویرایش سبک های مرتبط",
      "content4": "تبدیل به فرمت اصلی"
    },
    "tab2": {
      "description": "GroupDocs.Editor برای جاوا از [قالب‌های فایل] زیر پشتیبانی می‌کند (https://docs.groupdocs.com/editor/java/supported-document-formats/)",
      "title": "خانواده های قالب دیگر",
      "content1": "فرمت های اسناد باز",
      "content2": "فرمت های ایمیل",
      "content3": "فرمت های وب",
      "content4": "فرمت های کتاب الکترونیکی (کتاب الکترونیکی)."
    },
    "tab3": {
      "description": "GroupDocs.Editor برای جاوا از سیستم عامل ها، چارچوب ها و مدیران بسته زیر پشتیبانی می کند",
      "title_os": "سیستم های عامل",
      "title_frameworks": "چارچوب های پشتیبانی شده",
      "title_packman": "ابزار اتوماسیون ساخت",
      "title_devenv": "محیط های توسعه"
    }
  },
  "Features": {
    "title": "GroupDocs.Editor برای ویژگی های جاوا",
    "feature_loop": {
      "1": "ادغام آسان ویرایشگر HTML",
      "2": "تبدیل سند به HTML DOM",
      "3": "استخراج محتوای HTML از جریان اسناد",
      "4": "بارگیری، ویرایش و ذخیره فرمت های فایل Word، Excel و PowerPoint",
      "5": "HTML را به همراه عناصر جاسازی شده واکشی کنید",
      "6": "وارد کردن، مشاهده و ویرایش اسناد XML",
      "7": "دور زدن محتوای HTML و ذخیره منابع جاسازی شده",
      "8": "مشاهده، ویرایش و ذخیره اسناد پردازش کلمه در حالت صفحه",
      "9": "محتوای تگ بدنه HTML را از فایل دریافت کنید",
      "10": "محتوای CSS فایل HTML را استخراج کنید",
      "11": "از محتوای رشته برای دریافت HTML DOM و تبدیل به فایل استفاده کنید",
      "12": "HTML DOM را با عناصر جاسازی شده تبدیل کنید",
      "13": "تبدیل فایل های چند فرمت در HTML برای ویرایش",
      "14": "دریافت متا اطلاعات اسناد ورودی بدون ویرایش",
      "15": "اسناد ویرایش شده را در قالب فایل متنی ساده ذخیره کنید",
      "16": "دقت تبدیل",
      "17": "اعمال رمز عبور به سند خروجی",
      "18": "پایگاه داده (DB) Agnostic",
      "19": "رابط کاربری (UI) Agnostic",
      "20": "از مجوز اندازه گیری پشتیبانی می کند"
    },
    "more_features_loop": {
      "title1": "تبدیل دقیق به و از HTML DOM",
      "content1": "استفاده از GroupDocs.Editor برای جاوا به شما امکان می دهد برنامه هایی را در جاوا بسازید که یک سند با فرمت فایل پشتیبانی شده را بارگیری می کند تا آن را به مدل شی سند HTML (DOM) همراه با عناصر مرتبط با آن، به عنوان مثال، CSS تبدیل کند. علاوه بر این، ویرایشگر جاوا API ما به شما امکان می دهد HTML را در هر یک از ویرایشگرهای محبوب HTML ویرایش کنید. پس از انجام تغییرات مورد نیاز، GroupDocs.Editor برای جاوا به شما کمک می کند تا این HTML حاصل را به فرمت فایل اصلی خود برگردانید.",
      "title2": "بارگیری و واکشی عناصر مرتبط",
      "content2": "GroupDocs.Editor for Java API به شما امکان می دهد عناصر مرتبط را از اسناد فرمت های پشتیبانی شده مانند تصاویر، CSS، فونت ها و موارد دیگر واکشی کنید. سپس می‌توانید این عناصر مرتبط واکشی شده را بارگیری کنید، آنها را پیمایش کنید و جدا از فایل HTML نهایی ذخیره کنید و یک خروجی مدیریت شده داشته باشید."
    }
  },
  "Solutions": {
    "title": "GroupDocs.Editor API های ویرایش اسناد را برای سایر محیط های توسعه محبوب ارائه می دهد"
  }
}