{
  "head": {
    "title": "Solution d'édition de documents | API sur site et applications gratuites",
    "description": "Édition de documents pour Microsoft Office, OpenDocument, PDF et autres formats de fichiers à l'aide d'API sur site ou utilisez l'application Online Document Editor."
  },
  "header": {
    "title": "Solution d'édition de documents",
    "description": "Éditeur de documents pour manipuler Microsoft Office, OpenOffice, PDF, HTML et d'autres formats de fichiers de documents."
  },
  "APIs": {
    "API_loop_high_code": {
      "title": "Les API GroupDocs.Editor High Code incluent",
      "label": "Afficher toutes les API High Code",
      "API_product_net": {
        "content": "API .NET sur site qui aide votre application à afficher, modifier puis convertir des documents."
      },
      "API_product_java": {
        "content": "API d'édition de documents pour Microsoft Office, OpenOffice, HTML et autres documents à manipuler dans vos applications basées sur Java."
      }
    },
    "API_loop_low_code": {
      "title": "Les API GroupDocs.Editor Low Code incluent",
      "label": "Afficher toutes les API Low Code",
      "Cloud_SDK_net": {
        "content": "Ajoutez de puissantes fonctionnalités d'édition de formats de documents dans les applications .NET à l'aide du SDK Cloud pour .NET. Éditez des documents MS Office, Web et XML."
      },
      "Cloud_SDK_java": {
        "content": "SDK d'éditeur de documents avancé pour les applications Java permettant de modifier les formats de fichiers de documents standard de l'industrie sur n'importe quelle plate-forme capable d'appeler des API REST."
      }
    },
    "API_loop_no_code": {
      "title": "GroupDocs.Editor Aucune application de code n'inclut",
      "label": "Voir toutes les applications sans code",
      "Total": {
        "content": "Application en ligne gratuite basée sur le Web pour modifier les formats de fichiers populaires d'Office et d'OpenOffice."
      },
      "DOCX": {
        "content": "Application d'édition gratuite pour afficher et modifier des documents Microsoft Word en ligne."
      },
      "PDF": {
        "content": "Utilisez n'importe quel appareil, n'importe quel navigateur pour afficher ou modifier des documents PDF et XPS."
      }
    }
  }
}