{
  "head": {
    "title": "واجهة برمجة تطبيقات محرر المستندات C # .NET | تحرير Word Excel PowerPoint Web XML باستخدام HTML",
    "description": "محرر المستندات C # .NET API لتحميل Microsoft Word و Excel و PowerPoint و PDF و XML والويب وتنسيقات الملفات النصية إلى HTML ، ومعالجتها وتحويلها مرة أخرى إلى التنسيق الأصلي."
  },
  "header": {
    "title": "NET API لتحرير المستندات باستخدام HTML",
    "description": "تطوير تطبيقات .NET للتكامل مع محرر HTML وإحضار المستندات المدعومة والتحرير والتحويل إلى التنسيق الأصلي."
  },
  "Submenu": {
    "middle": {
      "button_overview": {
        "text": "ملخص"
      },
      "button_features": {
        "text": "سمات"
      },
      "button_support": {
        "text": "الدعم"
      },
      "button_livedemo": {
        "text": "عرض حي"
      },
      "button_pricing": {
        "text": "التسعير"
      }
    }
  },
  "Overview": {
    "content": "يساعدك GroupDocs.Editor for .NET API على إنشاء تطبيقات بسيطة وسهلة الاستخدام C # و ASP.NET وتطبيقات .NET الأخرى التي تتكامل بسهولة مع برامج تحرير HTML الشائعة (مفتوحة المصدر والمدفوعة على حد سواء) لتحويل مستندات وتحريرها ومعالجتها تنسيقات الملفات الشائعة. تتيح لك واجهة برمجة تطبيقات .NET Editor API تحميل المستند وتحويله إلى HTML ودفع HTML إلى محرر HTML خارجي ، وبمجرد الانتهاء من المعالجة ، يحفظ HTML في تنسيق الملف الأصلي. يمكنك أيضًا جلب الموارد المرفقة بأي مستند بشكل منفصل. إنه يعمل مع جميع أنواع المستندات ، مثل تلك الخاصة بـ Microsoft Word و Excel و PowerPoint و PDF و XPS و OpenDocument والنص والويب والبريد الإلكتروني والكتاب الإلكتروني والمزيد.",
    "tab1": {
      "description": "فيما يلي نظرة عامة على GroupDocs.Editor for .NET",
      "title": "التلاعب باستخدام HTML",
      "content1": "تحميل المستند المدعوم",
      "content2": "تحرير المحتوى باستخدام HTML",
      "content3": "تحرير الأنماط ذات الصلة",
      "content4": "التحويل إلى التنسيق الأصلي"
    },
    "tab2": {
      "description": "يدعم GroupDocs.Editor for .NET التالية [تنسيقات الملفات] (https://docs.groupdocs.com/editor/java/supported-document-formats/)",
      "title": "عائلات التنسيق الأخرى",
      "content1": "تنسيقات OpenDocument",
      "content2": "تنسيقات التخطيط الثابت",
      "content3": "تنسيقات الويب",
      "content4": "تنسيقات الكتب الإلكترونية"
    },
    "tab3": {
      "description": "يدعم GroupDocs.Editor for .NET أنظمة التشغيل والأطر ومديري الحزم التالية",
      "title_os": "أنظمة التشغيل",
      "title_frameworks": "الأطر المدعومة",
      "title_packman": "مديرو الحزم",
      "title_devenv": "بيئات التنمية"
    }
  },
  "Features": {
    "title": "GroupDocs.Editor لميزات .NET",
    "feature_loop": {
      "1": "سهولة التكامل مع أي محرر HTML",
      "2": "تحويل المستند إلى HTML DOM",
      "3": "إحضار محتوى HTML من دفق المستندات",
      "4": "احصل على محتوى HTML وموارده المضمنة",
      "5": "الحصول على محتوى HTML Body Tag من المستند",
      "6": "احصل على أوراق أنماط CSS لمستند HTML",
      "7": "اجتياز محتوى HTML وحفظ موارده",
      "8": "إحضار HTML DOM من String Content والتحويل إلى مستند",
      "9": "HTML DOM مع تحويل الموارد",
      "10": "تحرير المستندات من تنسيقات مختلفة في HTML",
      "11": "تحويل دقيق",
      "12": "تطبيق حماية القراءة و / أو الكتابة على المستند الناتج",
      "13": "ترقيم مستندات معالجة النصوص وتحريرها في أي محرري WYSIWYG",
      "14": "حيادية لقاعدة البيانات (DB) وواجهة المستخدم (UI)",
      "15": "ميزات معالجة XML القوية",
      "16": "استرجع OTF (Open Type Fonts) من مستندات الإدخال وتصديرها إلى المستند الناتج",
      "17": "معالجة الصور النقطية والمتجهة داخليًا ضمن تنسيقات مستندات الإدخال المدعومة",
      "18": "قم بإدراج محتويات ورقة العمل التي تم تحريرها في جدول البيانات الأصلي بالوظيفة المطلوبة",
      "19": "قم بتحرير الشرائح وإدراجها في جدول البيانات الناتج",
      "20": "تضمين الخطوط في مستند معالجة الكلمات الناتج أثناء الحفظ"
    },
    "more_features_loop": {
      "title1": "تحويل دقيق من وإلى HTML DOM",
      "content1": "يتيح GroupDocs.Editor for .NET API لتطبيقات .NET إحضار مستند بتنسيق مدعوم وتحويله إلى نموذج كائن مستند HTML (DOM) إلى جانب استخراج الموارد المرفقة ، مثل CSS. يمكنك بعد ذلك إجراء التعديلات على HTML باستخدام محرر HTML المفضل لديك. بمجرد الانتهاء من التحرير ، يتيح لك GroupDocs.Editor لـ .NET API تحويل HTML DOM هذا بدقة إلى الملف الأصلي.",
      "title2": "تحميل واستخراج الموارد الخارجية",
      "content2": "GroupDocs.Editor for .NET API قادر على جلب الموارد الخارجية المرفقة بالمستندات المدعومة ، مثل الصور والخطوط و CSS والمزيد. يمكن بعد ذلك تحميل الموارد التي تم جلبها واجتيازها وحفظها بشكل منفصل عن مستند HTML الناتج. يمنحك هذا إخراجًا تتم إدارته بسهولة أكبر.",
      "title3": "تطبيق تأثيرات النص داخل تنسيقات ملف معالجة الكلمات",
      "content3": "تتيح واجهة برمجة تطبيقات محرر المستندات GroupDocs إضافة تأثيرات نصية معقدة (الظل ، التأثير ثلاثي الأبعاد ، المخطط التفصيلي ، التوهج ، النقش ، النقش) أثناء العمل مع تنسيقات معالجة مستندات Microsoft Word المدعومة. يتم تمكين هذه الميزة تلقائيًا ويمكن ملاحظتها عند معالجة المستند الذي يحتوي على تأثيرات النص هذه.",
      "title4": "ميزات معالجة XML قوية",
      "content4-1": "باستخدام GroupDocs.Editor لـ .NET API ، يمكنك فتح وعرض وتحرير مستندات XML. تقدم واجهة برمجة تطبيقات التحرير الخاصة بنا دعمًا خاصًا وإعادة تسجيل علامات XML والسمات جنبًا إلى جنب مع قيمها وإعلانات XML وأقسام CDATA وتعريفات DOCTYPE وغيرها من الكيانات المحددة لـ XML. يمكنك تخصيص إعدادات الخط واللون لكل كيان مميز في بنية XML.",
      "content4-2": "ميزة محول XML ذكية بما يكفي لإظهار الأخطاء في ملف XML وكيفية إصلاحها. تقوم آلية URI والتعرف على البريد الإلكتروني بمسح سمات XML وتمثل URIs المكتشفة وعناوين البريد الإلكتروني داخل العلامة A كروابط بحيث يمكن تحريرها كارتباط ، وليس كنص داخل ملف HTML الناتج."
    }
  },
  "Solutions": {
    "title": "يقدم GroupDocs.Editor واجهات برمجة تطبيقات لتحرير المستندات لبيئات التطوير الشائعة الأخرى"
  }
}