{
  "head": {
    "title": "Asiakirjan muokkausratkaisu | Premise-sovellusliittymissä ja ilmaisissa sovelluksissa",
    "description": "Asiakirjojen muokkaus Microsoft Office-, OpenDocument-, PDF- ja muiden tiedostomuotojen kanssa On Premise API -sovellusliittymien avulla tai käytä online-asiakirjaeditorisovellusta."
  },
  "header": {
    "title": "Asiakirjan muokkausratkaisu",
    "description": "Asiakirjaeditori Microsoft Office-, OpenOffice-, PDF-, HTML- ja muiden asiakirjatiedostomuotojen käsittelemiseen."
  },
  "APIs": {
    "API_loop_high_code": {
      "title": "GroupDocs.Editor High Code API:t sisältävät",
      "label": "Näytä kaikki High Code API:t",
      "API_product_net": {
        "content": "On Premise .NET API, jonka avulla sovellus voi tarkastella, muokata ja sitten muuntaa asiakirjoja."
      },
      "API_product_java": {
        "content": "Asiakirjojen muokkaussovellusliittymä Microsoft Office-, OpenOffice-, HTML- ja muiden asiakirjojen käsittelyyn Java-pohjaisissa sovelluksissasi."
      }
    },
    "API_loop_low_code": {
      "title": "GroupDocs.Editor Low Code API:t sisältävät",
      "label": "Näytä kaikki Low Code API:t",
      "Cloud_SDK_net": {
        "content": "Lisää tehokkaita asiakirjamuotojen muokkausominaisuuksia .NET-sovelluksiin käyttämällä Cloud SDK:ta .NET:lle. Muokkaa MS Office-, Web- ja XML-asiakirjoja."
      },
      "Cloud_SDK_java": {
        "content": "Edistyksellinen asiakirjaeditorin SDK Java-sovelluksille, jotta voidaan muokata alan standardinmukaisia ​​asiakirjatiedostomuotoja millä tahansa alustalla, joka pystyy kutsumaan REST-sovellusliittymiä."
      }
    },
    "API_loop_no_code": {
      "title": "GroupDocs.Editor Ei koodisovelluksia",
      "label": "Näytä kaikki koodittomat sovellukset",
      "Total": {
        "content": "Verkkopohjainen ilmainen online-sovellus, jolla voit muokata suosittuja Office- ja OpenOffice-tiedostomuotoja."
      },
      "DOCX": {
        "content": "Ilmainen muokkaussovellus Microsoft Word -asiakirjojen katseluun ja muokkaamiseen verkossa."
      },
      "PDF": {
        "content": "Käytä mitä tahansa laitetta, mitä tahansa selainta PDF- ja XPS-dokumenttien katseluun tai muokkaamiseen."
      }
    }
  }
}