{
  "head": {
    "title": "C# .NET Document Editor API | Cuir Word Excel in eagar PowerPoint Gréasáin XML ag baint úsáide as HTML",
    "description": "C# .NET eagarthóir doiciméad API a luchtú Microsoft Word, Excel, PowerPoint, PDF, XML, gréasáin agus formáidí comhaid téacs go HTML, a ionramháil agus a thiontú ar ais go dtí an bhunfhormáid."
  },
  "header": {
    "title": ".NET API chun Doiciméid a Chur in Eagar ag Úsáid HTML",
    "description": "Feidhmchláir .NET a fhorbairt, chun Comhtháthú le hEagarthóir HTML, Faigh Doiciméad Tacaithe, Cuir in Eagar agus Tiontaigh go Bunfhormáid."
  },
  "Submenu": {
    "middle": {
      "button_overview": {
        "text": "Forbhreathnú"
      },
      "button_features": {
        "text": "Gnéithe"
      },
      "button_support": {
        "text": "Tacaíocht"
      },
      "button_livedemo": {
        "text": "Taispeántas beo"
      },
      "button_pricing": {
        "text": "Praghsáil"
      }
    }
  },
  "Overview": {
    "content": "Cuidíonn GroupDocs.Editor le haghaidh .NET API leat C#, ASP.NET, agus feidhmchláir .NET eile a thógáil atá simplí agus éasca le húsáid a chomhtháthaíonn go héasca le heagarthóirí HTML móréilimh (foinse oscailte agus íoctha araon) chun doiciméid de chuid a thiontú, a chur in eagar agus a láimhseáil. formáidí comhaid tóir. Ligeann ár .NET Editor API duit an doiciméad a luchtú, é a thiontú go HTML, HTML a bhrú go hEagarthóir HTML seachtrach, agus nuair a dhéantar an t-ionramháil, sábhálann tú an HTML chuig a bhunfhormáid comhaid. Is féidir leat freisin acmhainní atá ceangailte le haon doiciméad a fháil ar leithligh. Oibríonn sé le gach cineál doiciméad, mar sin le haghaidh Microsoft Word, Excel, PowerPoint, PDF, XPS, OpenDocument, Téacs, Gréasáin, Ríomhphost, r-Leabhar agus go leor eile.",
    "tab1": {
      "description": "Seo a leanas forbhreathnú ar GroupDocs.Editor do .NET",
      "title": "Ionramháil Ag baint úsáide as HTML",
      "content1": "Luchtaigh Doiciméad Tacaithe",
      "content2": "Cuir Ábhar in Eagar ag úsáid HTML",
      "content3": "Cuir Stíleanna Gaolmhara in Eagar",
      "content4": "Tiontaigh go Formáid Bhunaidh"
    },
    "tab2": {
      "description": "Tacaíonn GroupDocs.Editor le haghaidh .NET le [formáidí comhaid] (https://docs.groupdocs.com/editor/java/supported-document-formats/)",
      "title": "Teaghlaigh i bhformáid eile",
      "content1": "Formáidí OpenDocument",
      "content2": "Formáidí leagan amach seasta",
      "content3": "Formáidí gréasáin",
      "content4": "Formáidí leictreonacha leabhar (ríomhleabhar)."
    },
    "tab3": {
      "description": "Tacaíonn GroupDocs.Editor le haghaidh .NET le Córais Oibriúcháin, Creataí & Bainisteoirí Pacáiste a leanúint",
      "title_os": "Córais oibriúcháin",
      "title_frameworks": "Creataí Tacaithe",
      "title_packman": "Bainisteoirí Pacáiste",
      "title_devenv": "Timpeallachtaí Forbartha"
    }
  },
  "Features": {
    "title": "GroupDocs.Editor le haghaidh Gnéithe .NET",
    "feature_loop": {
      "1": "Comhtháthú Éasca le haon eagarthóir HTML",
      "2": "Tiontaigh Doiciméad go HTML DOM",
      "3": "Faigh Ábhar HTML ó Sruth Doiciméid",
      "4": "Faigh Ábhar HTML & a Acmhainní Leabaithe",
      "5": "Faigh Ábhar Clib Coirp HTML ón Doiciméad",
      "6": "Íosluchtaigh stíleanna do css html",
      "7": "Trasnaigh Ábhar HTML agus Sábháil a Acmhainní",
      "8": "Faigh HTML DOM ó Ábhar Teaghrán & Tiontaigh go Doiciméad",
      "9": "HTML DOM chomh maith le Tiontú Acmhainní",
      "10": "Cuir Doiciméid de Formáidí Éagsúla in eagar i HTML",
      "11": "Comhshó Cruinn",
      "12": "Cuir Cosaint Léigh agus/nó Scríobh chuig an Doiciméad Comhthoraidh",
      "13": "Déan Doiciméid Phróiseála Focal a Pagináil agus Cuir in Eagar in aon Eagarthóirí WYSIWYG",
      "14": "Bunachar Sonraí (DB) & Comhéadan Úsáideora (UI) Agnostic",
      "15": "Gnéithe Próiseála XML cumhachtacha",
      "16": "Aisghabh OTF (Clónna de Chineál Oscailte) ó Dhoiciméid Ionchuir agus Easpórtáil go Doiciméad Comhtháthaithe",
      "17": "Próiseáil Íomhánna Raster agus Veicteoir Go hinmheánach laistigh de Fhormáidí Doiciméid Ionchuir Tacaithe",
      "18": "Cuir Ábhar na mBileog Oibre Atheagraithe isteach sa Scarbhileog Bhunaidh ar Staid Inmhianta",
      "19": "Cuir na Sleamhnáin in Eagar agus cuir isteach iad sa Scarbhileog dá bharr",
      "20": "Leabaigh Clónna sa Cháipéis Phróiseála Focal Iarmhar agus Sábhálann tú"
    },
    "more_features_loop": {
      "title1": "Comhshó Cruinn go HTML DOM agus uaidh",
      "content1": "Cuireann GroupDocs.Editor le haghaidh .NET API ar chumas d’fheidhmchláir .NET doiciméad de bhformáid thacaithe a fháil agus é a thiontú go Múnla Oibiachta Doiciméad HTML (DOM) chomh maith le hasbhaint acmhainní ceangailte, mar CSS. Is féidir leat na mionathruithe a dhéanamh ar an HTML ansin leis an Eagarthóir HTML is fearr leat. Nuair a bheidh an eagarthóireacht déanta agat, ceadaíonn GroupDocs.Editor do .NET API duit an HTML DOM seo a thiontú go cruinn ar ais go dtí an bunchomhad.",
      "title2": "Luchtaigh & Bain Acmhainní Seachtracha",
      "content2": "Tá GroupDocs.Editor le haghaidh .NET API in ann na hacmhainní seachtracha a ghabhann le doiciméid tacaithe a fháil, amhail íomhánna, clónna, CSS agus go leor eile. Is féidir na hacmhainní faighte a luchtú, a thrasnú agus a shábháil ar leithligh ón doiciméad HTML a thagann dá bharr. Tugann sé seo aschur bainistithe níos éasca duit.",
      "title3": "Cuir Éifeachtaí Téacs i bhFormáidí Comhaid Próiseála Focal",
      "content3": "Cumasaíonn API eagarthóir doiciméad GroupDocs éifeachtaí casta téacs a chur leis (Scáth, éifeacht 3D, Imlíne, Glow, Engrave, Emboss) agus iad ag obair le formáidí próiseála doiciméad Microsoft Word a fhaigheann tacaíocht. Tá an ghné seo uathchumasaithe ar féidir a fheiceáil nuair a phróiseáiltear an doiciméad le héifeachtaí téacs den sórt sin.",
      "title4": "Gnéithe Ionramhála XML cumhachtacha",
      "content4-1": "Ag baint úsáide as GroupDocs.Editor le haghaidh .NET API is féidir leat doiciméid XML a oscailt, a fheiceáil agus a chur in eagar. Tugann ár n-API eagarthóireachta tacaíocht speisialta agus aitheantas ar chlibeanna XML, tréithe mar aon lena luachanna, dearbhuithe XML, ailt CDATA, sainmhínithe DOCTYPE, agus eintitis shonracha XML eile. Is féidir leat socruithe cló agus dath a shaincheapadh do gach aonán ar leith i struchtúr XML.",
      "content4-2": "Tá an ghné XML Converter cliste go leor chun earráidí sa chomhad XML a thaispeáint agus conas iad a dheisiú. Scanann an mheicníocht URI agus aitheantais ríomhphoist tréithe XML agus léiríonn sé na URanna braite agus na seoltaí ríomhphoist laistigh den chlib A mar naisc ionas gur féidir iad a chur in eagar mar nasc, ní mar théacs laistigh den chomhad HTML a thagann dá bharr."
    }
  },
  "Solutions": {
    "title": "Cuireann GroupDocs.Editor APInna eagarthóireachta doiciméad ar fáil do thimpeallachtaí forbartha eile a bhfuil tóir orthu"
  }
}