{
  "head": {
    "title": "Java Edîtorê Belgeya API | Bi HTML-ê Pelên Nivîsarên Word Web XML biguherînin",
    "description": "Edîtorê Belge API-ê ji bo Java. Pelên Microsoft Word, XML, web û nivîsê di HTML-ê de bar bikin û piştî manîpulasyonê vegerînin forma orîjînal."
  },
  "header": {
    "title": "Belgeyên bi HTML-ê Bi karanîna Java API-ê biguherînin",
    "description": "Serlêdanên Java-yê bi edîtorê HTML-ê re yek bikin da ku belgeyan manîpule bikin û vegerînin forma orjînal."
  },
  "Submenu": {
    "middle": {
      "button_overview": {
        "text": "Têgihiştinî"
      },
      "button_features": {
        "text": "Features"
      },
      "button_support": {
        "text": "Alîkarî"
      },
      "button_livedemo": {
        "text": "Demo Bijî"
      },
      "button_pricing": {
        "text": "Pricing"
      }
    }
  },
  "Overview": {
    "content": "GroupDocs.Editor ji bo Java API verastkirina belgeyê di forma HTML-ê de çalak dike. API gelek formatên belgeyê piştgirî dike û dikare bi her edîtorê HTML-ê yê derveyî, çavkaniya vekirî an drav re were yek kirin. Edîtor API dê pêvajoyê bike da ku belgeyan bar bike, wê biguherîne HTML, HTML-ê ji UI-ya derveyî re peyda bike û dûv re piştî manîpulasyonê HTML-ê li belgeya orîjînal hilîne. Di heman demê de ew dikare were bikar anîn da ku Microsoft Word, pelgeyên Excel, pelên PowerPoint, formatên OpenDocument, belgeyên XML û TXT yên cihêreng çêbikin.",
    "tab1": {
      "description": "Li jêr nihêrînek GroupDocs.Editor ji bo Java-yê ye",
      "title": "Bi karanîna HTML-ê manîpule bikin",
      "content1": "Belgeya Piştgiriya Barkirin",
      "content2": "Bi HTML-ê naverok biguherîne",
      "content3": "Biguherîne Styles Related",
      "content4": "Veguherînin Forma Orjînal"
    },
    "tab2": {
      "description": "GroupDocs.Editor ji bo Java [formên pelan] yên jêrîn piştgirî dike (https://docs.groupdocs.com/editor/java/supported-document-formats/)",
      "title": "Malbatên formatên din",
      "content1": "Formatên OpenDocument",
      "content2": "Formatên e-nameyê",
      "content3": "Formatên Webê",
      "content4": "Formatên pirtûka elektronîkî (e-Pirtûk)."
    },
    "tab3": {
      "description": "GroupDocs.Editor ji bo Java-yê pergalên xebitandinê, çarçove û rêveberên pakêtê yên jêrîn piştgirî dike",
      "title_os": "Pergalên Xebatê",
      "title_frameworks": "Çarçoveyên Piştgirî",
      "title_packman": "Amûra Xweseriya Avakirinê",
      "title_devenv": "Jîngehên Pêşveçûn"
    }
  },
  "Features": {
    "title": "GroupDocs.Editor ji bo Taybetmendiyên Java",
    "feature_loop": {
      "1": "Yekbûna Edîtorê HTML-ê hêsan",
      "2": "Veguheztina Belgeyê ji bo HTML DOM",
      "3": "Naveroka HTML-ê ji Document Stream derxînin",
      "4": "Formatên Pelê Word, Excel û PowerPoint Barkirin, Biguherîne û hilîne",
      "5": "HTML-ê digel Hêmanên Embedded bistînin",
      "6": "Belgeyên XML derxînin, Binêrin û Biguherînin",
      "7": "Naveroka HTML-ê derbas bikin û Çavkaniyên Vekirî hilînin",
      "8": "Di Moda Paginal de Belgeyên Pêvajoya Peyvê Binêre, Biguherîne û Hilîne",
      "9": "Naveroka HTML-a Body Tag ji Pelê bistînin",
      "10": "Naveroka CSS ya pelê HTML derxînin",
      "11": "Naveroka String bikar bînin da ku HTML DOM-ê bistînin û pelê veguherînin",
      "12": "HTML DOM-ê bi hêmanên pêvekirî veguherînin",
      "13": "Pelên Pir Formatên Di HTML-ê de ji bo Weşandinê veguherînin",
      "14": "Agahdariya Meta ya Belgeyên Ketinê bêyî Guherandin bistînin",
      "15": "Belgeyên Guherandinî li Forma Pelê Nivîsara Zelal hilînin",
      "16": "Rastiya veguherînê",
      "17": "Şîfreyê li Belgeya Derketinê bicîh bikin",
      "18": "Database (DB) Agnostic",
      "19": "Navrûya Bikarhêner (UI) Agnostic",
      "20": "Destûrdana Lîsanskirina Metered piştgirî dike"
    },
    "more_features_loop": {
      "title1": "Bi rasteqînî û ji HTML DOM-ê veguherînin",
      "content1": "Bikaranîna GroupDocs.Editor ji bo Java-yê destûrê dide te ku hûn di Java-yê de serîlêdanên ku belgeyek pelgeya pelê piştgirî bar dikin da ku wê bi hêmanên wê yên têkildar veguhezînin Modela Tişta Belgeya HTML (DOM) ava bikin, mînakî CSS. Wekî din, Edîtorê me Java API destûrê dide we ku hûn HTML-ê di yek ji Edîtorên HTML-ê yên populer de biguherînin. Piştî ku guheztinên we yên pêwîst hatin kirin, GroupDocs.Editor ji bo Java ji we re dibe alîkar ku hûn vê HTML-a encam dîsa vegerînin forma pelê wê ya orjînal.",
      "title2": "Hêmanên Hevkar Barkirin & Bikin",
      "content2": "GroupDocs.Editor ji bo Java API dihêle hûn hêmanên têkildar ji belgeyên formatên piştgirî, wek wêne, CSS, font û hêj bêtir bistînin. Dûv re hûn dikarin van hêmanên têkildar ên hatine hilanîn bar bikin, wan bişopînin û wan ji pelê paşîn a HTML-ê veqetînin, û xwedî derketinek baş-rêvebir bin."
    }
  },
  "Solutions": {
    "title": "GroupDocs.Editor ji bo hawîrdorên din ên pêşkeftina populer API-ên guherandina belgeyan pêşkêşî dike"
  }
}