{
  "head": {
    "title": "C# .NET Document Editor API | Επεξεργαστείτε το Word Excel PowerPoint Web XML χρησιμοποιώντας HTML",
    "description": "API επεξεργασίας εγγράφων C# .NET για φόρτωση μορφών αρχείων Microsoft Word, Excel, PowerPoint, PDF, XML, web και κειμένου σε HTML, επεξεργασία και μετατροπή στην αρχική μορφή."
  },
  "header": {
    "title": ".NET API για επεξεργασία εγγράφων με χρήση HTML",
    "description": "Αναπτύξτε εφαρμογές .NET, για ενσωμάτωση με το πρόγραμμα επεξεργασίας HTML, ανάκτηση υποστηριζόμενου εγγράφου, επεξεργασία και μετατροπή σε αρχική μορφή."
  },
  "Submenu": {
    "middle": {
      "button_overview": {
        "text": "ΣΦΑΙΡΙΚΗ ΕΙΚΟΝΑ"
      },
      "button_features": {
        "text": "Χαρακτηριστικά"
      },
      "button_support": {
        "text": "Υποστήριξη"
      },
      "button_livedemo": {
        "text": "Ζωντανή επίδειξη"
      },
      "button_pricing": {
        "text": "Τιμολόγηση"
      }
    }
  },
  "Overview": {
    "content": "Το GroupDocs.Editor για .NET API σάς βοηθά να δημιουργήσετε απλές και εύχρηστες εφαρμογές C#, ASP.NET και άλλες εφαρμογές .NET που ενσωματώνονται εύκολα με δημοφιλείς επεξεργαστές HTML (τόσο ανοιχτού κώδικα όσο και επί πληρωμή) για μετατροπή, επεξεργασία και χειρισμό εγγράφων δημοφιλείς μορφές αρχείων. Το .NET Editor API μας σάς επιτρέπει να φορτώσετε έγγραφο, να το μετατρέψετε σε HTML, να προωθήσετε το HTML σε εξωτερικό πρόγραμμα επεξεργασίας HTML και μόλις ολοκληρωθεί ο χειρισμός, αποθηκεύει το HTML στην αρχική του μορφή αρχείου. Μπορείτε επίσης να ανακτήσετε χωριστά πόρους που επισυνάπτονται σε οποιοδήποτε έγγραφο. Λειτουργεί με όλα τα είδη εγγράφων, όπως αυτό για Microsoft Word, Excel, PowerPoint, PDF, XPS, OpenDocument, Text, Web, Email, e-Book και άλλα.",
    "tab1": {
      "description": "Ακολουθεί μια επισκόπηση του GroupDocs.Editor για .NET",
      "title": "Χειρισμός με χρήση HTML",
      "content1": "Φόρτωση υποστηριζόμενου εγγράφου",
      "content2": "Επεξεργαστείτε το περιεχόμενο χρησιμοποιώντας HTML",
      "content3": "Επεξεργασία σχετικών στυλ",
      "content4": "Μετατροπή σε αρχική μορφή"
    },
    "tab2": {
      "description": "Το GroupDocs.Editor για .NET υποστηρίζει τις ακόλουθες [μορφές αρχείων](https://docs.groupdocs.com/editor/java/supported-document-formats/)",
      "title": "Οικογένειες άλλων μορφών",
      "content1": "Μορφές OpenDocument",
      "content2": "Μορφές σταθερής διάταξης",
      "content3": "Μορφές Ιστού",
      "content4": "Μορφές ηλεκτρονικών βιβλίων (e-Book)."
    },
    "tab3": {
      "description": "Το GroupDocs.Editor για .NET υποστηρίζει τα ακόλουθα λειτουργικά συστήματα, Frameworks & Package Managers",
      "title_os": "Λειτουργικά συστήματα",
      "title_frameworks": "Υποστηριζόμενα πλαίσια",
      "title_packman": "Διαχειριστές πακέτων",
      "title_devenv": "Αναπτυξιακά Περιβάλλοντα"
    }
  },
  "Features": {
    "title": "GroupDocs.Editor για .NET Features",
    "feature_loop": {
      "1": "Εύκολη ενσωμάτωση με οποιοδήποτε πρόγραμμα επεξεργασίας HTML",
      "2": "Μετατροπή εγγράφου σε HTML DOM",
      "3": "Λήψη περιεχομένου HTML από τη ροή εγγράφων",
      "4": "Αποκτήστε περιεχόμενο HTML και τους ενσωματωμένους πόρους του",
      "5": "Λάβετε περιεχόμενο ετικέτας σώματος HTML από το Document",
      "6": "Λάβετε φύλλα στυλ CSS του εγγράφου HTML",
      "7": "Διασχίστε το περιεχόμενο HTML και αποθηκεύστε τους πόρους του",
      "8": "Λήψη HTML DOM από Περιεχόμενο συμβολοσειράς και Μετατροπή σε Έγγραφο",
      "9": "HTML DOM μαζί με Μετατροπή πόρων",
      "10": "Επεξεργασία εγγράφων διαφόρων μορφών σε HTML",
      "11": "Ακριβής μετατροπή",
      "12": "Εφαρμόστε προστασία ανάγνωσης και/ή εγγραφής στο προκύπτον έγγραφο",
      "13": "Σελιδοποίηση εγγράφων επεξεργασίας κειμένου και επεξεργασία σε οποιοδήποτε πρόγραμμα επεξεργασίας WYSIWYG",
      "14": "Βάση δεδομένων (DB) & διεπαφή χρήστη (UI) Agnostic",
      "15": "Ισχυρές λειτουργίες επεξεργασίας XML",
      "16": "Ανάκτηση OTF (Γραμματοσειρές ανοιχτού τύπου) από έγγραφα εισόδου και εξαγωγή στο προκύπτον έγγραφο",
      "17": "Επεξεργαστείτε εικόνες ράστερ και διανύσματα εσωτερικά σε υποστηριζόμενες μορφές εγγράφου εισόδου",
      "18": "Εισαγάγετε τα περιεχόμενα του επεξεργασμένου φύλλου εργασίας στο αρχικό υπολογιστικό φύλλο σε μια επιθυμητή θέση",
      "19": "Επεξεργαστείτε τις διαφάνειες και τοποθετήστε τις στο υπολογιστικό φύλλο που προκύπτει",
      "20": "Ενσωματώστε γραμματοσειρές στο προκύπτον έγγραφο επεξεργασίας κειμένου κατά την αποθήκευση"
    },
    "more_features_loop": {
      "title1": "Ακριβής μετατροπή από και προς HTML DOM",
      "content1": "Το GroupDocs.Editor για .NET API επιτρέπει στις εφαρμογές σας .NET να ανακτούν ένα έγγραφο με υποστηριζόμενη μορφή και να το μετατρέπουν σε μοντέλο αντικειμένου εγγράφου HTML (DOM) μαζί με εξαγωγή συνημμένων πόρων, όπως CSS. Στη συνέχεια, μπορείτε να κάνετε τις τροποποιήσεις στο HTML χρησιμοποιώντας τον αγαπημένο σας Επεξεργαστή HTML. Μόλις ολοκληρώσετε την επεξεργασία, το GroupDocs.Editor για .NET API σάς επιτρέπει να μετατρέψετε με ακρίβεια αυτό το HTML DOM στο αρχικό αρχείο.",
      "title2": "Φόρτωση και εξαγωγή εξωτερικών πόρων",
      "content2": "Το GroupDocs.Editor για .NET API είναι σε θέση να ανακτά τους εξωτερικούς πόρους που είναι συνδεδεμένοι σε υποστηριζόμενα έγγραφα, όπως εικόνες, γραμματοσειρές, CSS και άλλα. Οι πόροι που ανακτήθηκαν μπορούν στη συνέχεια να φορτωθούν, να διασχιστούν και να αποθηκευτούν ξεχωριστά από το έγγραφο HTML που προκύπτει. Αυτό σας δίνει μια πιο εύκολα διαχειριζόμενη έξοδο.",
      "title3": "Εφαρμόστε εφέ κειμένου σε μορφές αρχείων επεξεργασίας κειμένου",
      "content3": "Το API επεξεργασίας εγγράφων GroupDocs επιτρέπει την προσθήκη σύνθετων εφέ κειμένου (Shadow, 3D effect, Outline, Glow, Engrave, Emboss) ενώ εργάζεστε με υποστηριζόμενες μορφές επεξεργασίας εγγράφων του Microsoft Word. Αυτή η δυνατότητα ενεργοποιείται αυτόματα και μπορεί να παρατηρηθεί κατά την επεξεργασία του εγγράφου με τέτοια εφέ κειμένου.",
      "title4": "Ισχυρές δυνατότητες χειρισμού XML",
      "content4-1": "Χρησιμοποιώντας το GroupDocs.Editor για .NET API μπορείτε να ανοίξετε, να προβάλετε και να επεξεργαστείτε έγγραφα XML. Το API επεξεργασίας μας προσφέρει ειδική υποστήριξη και αναγνώριση ετικετών XML, χαρακτηριστικών μαζί με τις τιμές τους, δηλώσεις XML, ενότητες CDATA, ορισμούς DOCTYPE και άλλες ειδικές οντότητες XML. Μπορείτε να προσαρμόσετε τις ρυθμίσεις γραμματοσειράς και χρώματος για κάθε ξεχωριστή οντότητα στη δομή XML.",
      "content4-2": "Η δυνατότητα XML Converter είναι αρκετά έξυπνη ώστε να εμφανίζει σφάλματα στο αρχείο XML και πώς να τα διορθώνει. Ο μηχανισμός αναγνώρισης URI και email σαρώνει χαρακτηριστικά XML και αναπαριστά τα εντοπισμένα URI και τις διευθύνσεις email μέσα στην ετικέτα A ως συνδέσμους, ώστε να μπορούν να επεξεργαστούν ως σύνδεσμος, όχι ως κείμενο μέσα στο αρχείο HTML που προκύπτει."
    }
  },
  "Solutions": {
    "title": "Το GroupDocs.Editor προσφέρει API επεξεργασίας εγγράφων για άλλα δημοφιλή περιβάλλοντα ανάπτυξης"
  }
}