{
  "head": {
    "title": "Oplossing voor documentbewerking | On-Premise API's en gratis apps",
    "description": "Documentbewerking voor Microsoft Office, OpenDocument, PDF en andere bestandsindelingen met On Premise API's of gebruik de Online Document Editor-app."
  },
  "header": {
    "title": "Oplossing voor documentbewerking",
    "description": "Documenteditor om Microsoft Office, OpenOffice, PDF, HTML en andere documentbestandsindelingen te manipuleren."
  },
  "APIs": {
    "API_loop_high_code": {
      "title": "GroupDocs.Editor High Code API's omvatten:",
      "label": "Bekijk alle High Code API's",
      "API_product_net": {
        "content": "On Premise .NET API die uw applicatie helpt bij het bekijken, bewerken en vervolgens converteren van documenten."
      },
      "API_product_java": {
        "content": "Documentbewerkings-API voor Microsoft Office, OpenOffice, HTML en andere documenten om te manipuleren binnen uw op Java gebaseerde applicaties."
      }
    },
    "API_loop_low_code": {
      "title": "GroupDocs.Editor Low Code API's omvatten:",
      "label": "Bekijk alle Low Code API's",
      "Cloud_SDK_net": {
        "content": "Voeg krachtige bewerkingsfuncties voor documentindelingen toe aan .NET-toepassingen met Cloud SDK voor .NET. Bewerk MS Office-, web- en XML-documenten."
      },
      "Cloud_SDK_java": {
        "content": "Geavanceerde documenteditor SDK voor Java-toepassingen om industriestandaard documentbestandsindelingen te bewerken op elk platform dat REST API's kan aanroepen."
      }
    },
    "API_loop_no_code": {
      "title": "GroupDocs.Editor Geen code-apps inbegrepen",
      "label": "Bekijk alle No Code-apps",
      "Total": {
        "content": "Webgebaseerde gratis online-app om populaire bestandsindelingen van Office en OpenOffice te bewerken."
      },
      "DOCX": {
        "content": "Gratis editor-app om Microsoft Word-documenten online te bekijken en te bewerken."
      },
      "PDF": {
        "content": "Gebruik elk apparaat en elke browser om PDF- en XPS-documenten te bekijken of te bewerken."
      }
    }
  }
}