{
  "head": {
    "title": "C# .NET دستاویز ایڈیٹر API | HTML کا استعمال کرتے ہوئے ورڈ ایکسل پاورپوائنٹ ویب XML میں ترمیم کریں",
    "description": "C# .NET دستاویز ایڈیٹر API مائیکروسافٹ ورڈ ، ایکسل ، پاورپوائنٹ ، پی ڈی ایف ، XML ، ویب اور ٹیکسٹ فائل فارمیٹس کو HTML میں لوڈ کرنے کے لئے ، ہیرا پھیری اور اصل شکل میں واپس تبدیل کریں۔"
  },
  "header": {
    "title": ".NET API HTML کا استعمال کرتے ہوئے دستاویزات میں ترمیم کرنے کے لئے",
    "description": "HTML ایڈیٹر کے ساتھ ضم کرنے کے لئے .NET ایپلی کیشنز تیار کریں ، معاون دستاویز کی بازیافت کریں ، ترمیم کریں اور اصل شکل میں تبدیل کریں۔"
  },
  "Submenu": {
    "middle": {
      "button_overview": {
        "text": "جائزہ"
      },
      "button_features": {
        "text": "خصوصیات"
      },
      "button_support": {
        "text": "حمایت"
      },
      "button_livedemo": {
        "text": "براہ راست ڈیمو"
      },
      "button_pricing": {
        "text": "قیمتوں کا تعین"
      }
    }
  },
  "Overview": {
    "content": ".NET API کے لئے گروپ ڈوکس۔ ایڈیٹر آپ کو C#، ASP.NET ، اور دیگر .NET ایپلی کیشنز کو استعمال کرنے میں آسان اور آسان استعمال کرنے میں مدد کرتا ہے جو آسانی سے مقبول HTML ایڈیٹرز (اوپن سورس اور ادائیگی دونوں) کے ساتھ آسانی سے مربوط ہوتے ہیں تاکہ دستاویزات کو تبدیل ، ترمیم اور ہیرا پھیری کریں۔ مقبول فائل فارمیٹس۔ ہمارا .NET ایڈیٹر API آپ کو دستاویزات لوڈ کرنے دیتا ہے ، اسے HTML میں تبدیل کرتا ہے ، HTML کو بیرونی HTML ایڈیٹر میں پوش کرتا ہے ، اور ایک بار ہیرا پھیری ہو جاتا ہے ، HTML کو اس کی اصل فائل کی شکل میں محفوظ کرتا ہے۔ آپ کسی بھی دستاویز کے ساتھ منسلک وسائل کو بھی الگ سے لاسکتے ہیں۔ یہ ہر طرح کی دستاویزات کے ساتھ کام کرتا ہے ، جیسے مائیکروسافٹ ورڈ ، ایکسل ، پاورپوائنٹ ، پی ڈی ایف ، ایکس پی ایس ، اوپینڈ دستاویز ، متن ، ویب ، ای میل ، ای بک اور بہت کچھ۔",
    "tab1": {
      "description": "مندرجہ ذیل .NET کے لئے گروپ ڈوکس ڈاٹ ایڈیٹر کا ایک جائزہ ہے",
      "title": "HTML کا استعمال کرتے ہوئے جوڑ توڑ",
      "content1": "سپورٹ دستاویز کو لوڈ کریں",
      "content2": "HTML کا استعمال کرتے ہوئے مواد میں ترمیم کریں",
      "content3": "متعلقہ شیلیوں میں ترمیم کریں",
      "content4": "اصل شکل میں تبدیل کریں"
    },
    "tab2": {
      "description": ".NET کے لئے گروپ ڈوکس۔ ایڈیٹر مندرجہ ذیل [فائل فارمیٹس] (https://docs.groupdocs.com/editor/java/supported-docament-formats/) کی حمایت کرتا ہے)",
      "title": "دوسرے فارمیٹ فیملیز",
      "content1": "اوپنڈوکیومنٹ فارمیٹس",
      "content2": "فکسڈ لی آؤٹ فارمیٹس",
      "content3": "ویب فارمیٹس",
      "content4": "الیکٹرانک کتاب (ای بک) فارمیٹس"
    },
    "tab3": {
      "description": ".NET کے لئے گروپ ڈوکس۔ ایڈیٹر مندرجہ ذیل آپریٹنگ سسٹم ، فریم ورک اور پیکیج مینیجرز کی حمایت کرتا ہے",
      "title_os": "آپریٹنگ سسٹم",
      "title_frameworks": "تائید شدہ فریم ورک",
      "title_packman": "پیکیج مینیجرز",
      "title_devenv": "ترقی کے ماحول"
    }
  },
  "Features": {
    "title": ".NET خصوصیات کے لئے گروپ ڈوکس۔ ایڈیٹر",
    "feature_loop": {
      "1": "کسی بھی HTML-ایڈیٹر کے ساتھ آسان انضمام",
      "2": "دستاویز کو HTML DOM میں تبدیل کریں",
      "3": "دستاویز کے سلسلے سے HTML مواد بازیافت کریں",
      "4": "HTML مواد اور اس کے سرایت شدہ وسائل حاصل کریں",
      "5": "دستاویز سے HTML باڈی ٹیگ مواد حاصل کریں",
      "6": "HTML دستاویز کی CSS اسٹائل شیٹ حاصل کریں",
      "7": "HTML مواد کو عبور کریں اور اس کے وسائل کو بچائیں",
      "8": "اسٹرنگ مواد سے HTML ڈوم کو بازیافت کریں اور دستاویز میں تبدیل کریں",
      "9": "وسائل کی تبدیلی کے ساتھ HTML ڈوم",
      "10": "HTML میں مختلف فارمیٹس کی دستاویزات میں ترمیم کریں",
      "11": "درست تبدیلی",
      "12": "پڑھیں اور/یا اس کے نتیجے میں دستاویز پر تحفظ لکھیں",
      "13": "ورڈ پروسیسنگ کے دستاویزات کا صفحہ بنائیں اور کسی بھی WYSIWYG ایڈیٹرز میں ترمیم کریں",
      "14": "ڈیٹا بیس (DB) اور یوزر انٹرفیس (UI) اگنوسٹک",
      "15": "طاقتور XML پروسیسنگ کی خصوصیات",
      "16": "ان پٹ دستاویزات سے OTF (اوپن ٹائپ فونٹس) بازیافت کریں اور نتیجہ خیز دستاویز میں برآمد کریں۔",
      "17": "راسٹر اور ویکٹر امیجز کو اندرونی طور پر معاون ان پٹ دستاویز فارمیٹس میں پروسیس کریں۔",
      "18": "ترمیم شدہ ورک شیٹ کے مواد کو اصل اسپریڈ شیٹ میں مطلوبہ پوزیشن پر داخل کریں",
      "19": "سلائیڈز میں ترمیم کریں اور انہیں نتیجہ خیز اسپریڈشیٹ میں داخل کریں۔",
      "20": "محفوظ کرتے وقت نتیجہ خیز ورڈ پروسیسنگ دستاویز میں فونٹس ایمبیڈ کریں۔"
    },
    "more_features_loop": {
      "title1": "HTML DOM میں اور اس سے درست تبدیلی",
      "content1": ".NET API کے لیے GroupDocs.Editor آپ کی .NET ایپلیکیشنز کو اس قابل بناتا ہے کہ وہ معاون فارمیٹ کی دستاویز حاصل کر سکے اور اسے HTML دستاویز آبجیکٹ ماڈل (DOM) میں تبدیل کرنے کے ساتھ ساتھ منسلک وسائل، جیسے CSS کو نکال سکے۔ اس کے بعد آپ اپنے پسندیدہ HTML ایڈیٹر کا استعمال کرتے ہوئے HTML میں ترمیم کر سکتے ہیں۔ ایک بار جب آپ ترمیم کر لیتے ہیں، تو .NET API کے لیے GroupDocs.Editor آپ کو درست طریقے سے اس HTML DOM کو اصل فائل میں تبدیل کرنے کی اجازت دیتا ہے۔",
      "title2": "بیرونی وسائل لوڈ اور نکالیں۔",
      "content2": ".NET API کے لیے GroupDocs.Editor معاون دستاویزات، جیسے کہ تصاویر، فونٹس، CSS اور مزید کے ساتھ منسلک بیرونی وسائل حاصل کرنے کے قابل ہے۔ اس کے بعد حاصل کردہ وسائل کو HTML دستاویز سے علیحدہ طور پر لوڈ کیا جا سکتا ہے، عبور کیا جا سکتا ہے اور محفوظ کیا جا سکتا ہے۔ یہ آپ کو زیادہ آسانی سے منظم آؤٹ پٹ فراہم کرتا ہے۔",
      "title3": "ورڈ پروسیسنگ فائل فارمیٹس میں ٹیکسٹ ایفیکٹس کا اطلاق کریں۔",
      "content3": "GroupDocs دستاویز ایڈیٹر API معاون مائیکروسافٹ ورڈ دستاویز پروسیسنگ فارمیٹس کے ساتھ کام کرتے ہوئے پیچیدہ ٹیکسٹ ایفیکٹس (شیڈو، تھری ڈی ایفیکٹ، آؤٹ لائن، گلو، اینگریو، ایمبس) کو شامل کرنے کے قابل بناتا ہے۔ یہ خصوصیت خودکار طور پر فعال ہے جس کا مشاہدہ اس وقت کیا جا سکتا ہے جب اس طرح کے ٹیکسٹ اثرات والی دستاویز پر کارروائی کی جاتی ہے۔",
      "title4": "طاقتور XML ہیرا پھیری کی خصوصیات",
      "content4-1": ".NET API کے لیے GroupDocs.Editor کا استعمال کرتے ہوئے آپ XML دستاویزات کو کھول، دیکھ اور ترمیم کر سکتے ہیں۔ ہمارا ایڈیٹنگ API XML ٹیگز، ان کی اقدار کے ساتھ صفات، XML ڈیکلریشنز، CDATA سیکشنز، DOCTYPE تعریفیں، اور دیگر XML مخصوص اداروں کی خصوصی مدد اور شناخت پیش کرتا ہے۔ آپ XML ڈھانچے میں ہر ایک الگ ہستی کے لیے فونٹ اور رنگ کی ترتیبات کو اپنی مرضی کے مطابق کرنے کے قابل ہیں۔",
      "content4-2": "XML کنورٹر کی خصوصیت XML فائل میں غلطیاں دکھانے اور انہیں کیسے ٹھیک کرنے کے لیے کافی ہوشیار ہے۔ URI اور ای میل شناخت کرنے والا میکانزم XML صفات کو اسکین کرتا ہے اور A ٹیگ کے اندر پتہ لگائے گئے URIs اور ای میل پتوں کو بطور لنکس کی نمائندگی کرتا ہے تاکہ ان کو لنک کے طور پر ایڈٹ کیا جا سکے، نہ کہ نتیجے میں آنے والی HTML فائل میں متن کے طور پر۔"
    }
  },
  "Solutions": {
    "title": "GroupDocs.Editor دیگر مقبول ترقیاتی ماحول کے لیے دستاویز میں ترمیم کرنے والے APIs پیش کرتا ہے۔"
  }
}