{
  "head": {
    "title": "دستاویز میں ترمیم کا حل | پریمیس APIs اور مفت ایپس پر",
    "description": "مائیکروسافٹ آفس، اوپن ڈاکومنٹ، پی ڈی ایف اور دیگر فائل فارمیٹس کے لیے دستاویز میں ترمیم آن پریمائز APIs کا استعمال کرتے ہوئے یا آن لائن دستاویز ایڈیٹر ایپ استعمال کریں۔"
  },
  "header": {
    "title": "دستاویز میں ترمیم کا حل",
    "description": "مائیکروسافٹ آفس، اوپن آفس، پی ڈی ایف، ایچ ٹی ایم ایل اور دیگر دستاویز فائل فارمیٹس کو جوڑ توڑ کرنے کے لیے دستاویز ایڈیٹر۔"
  },
  "APIs": {
    "API_loop_high_code": {
      "title": "GroupDocs.Editor ہائی کوڈ APIs شامل ہیں۔",
      "label": "تمام ہائی کوڈ APIs دیکھیں",
      "API_product_net": {
        "content": "Premise .NET API پر جو آپ کی درخواست کو دستاویزات کو دیکھنے، ترمیم کرنے اور پھر تبدیل کرنے میں مدد کرتا ہے۔"
      },
      "API_product_java": {
        "content": "مائیکروسافٹ آفس، اوپن آفس، ایچ ٹی ایم ایل اور دیگر دستاویزات کے لیے آپ کی جاوا پر مبنی ایپلی کیشنز میں ہیرا پھیری کرنے کے لیے دستاویز میں ترمیم کرنے والا API۔"
      }
    },
    "API_loop_low_code": {
      "title": "GroupDocs.Editor کم کوڈ APIs شامل ہیں۔",
      "label": "تمام لو کوڈ APIs دیکھیں",
      "Cloud_SDK_net": {
        "content": ".NET کے لیے Cloud SDK کا استعمال کرتے ہوئے .NET ایپلی کیشنز میں طاقتور دستاویز فارمیٹس میں ترمیم کرنے کی خصوصیات شامل کریں۔ ایم ایس آفس، ویب اور ایکس ایم ایل دستاویزات میں ترمیم کریں۔"
      },
      "Cloud_SDK_java": {
        "content": "REST APIs کو کال کرنے کے قابل کسی بھی پلیٹ فارم پر انڈسٹری کے معیاری دستاویز فائل فارمیٹس میں ترمیم کرنے کے لیے جاوا ایپلیکیشنز کے لیے ایڈوانسڈ دستاویز ایڈیٹر SDK۔"
      }
    },
    "API_loop_no_code": {
      "title": "GroupDocs.Editor کوئی کوڈ ایپس شامل نہیں ہے۔",
      "label": "تمام کوئی کوڈ ایپس دیکھیں",
      "Total": {
        "content": "آفس اور اوپن آفس سے مقبول فائل فارمیٹس میں ترمیم کرنے کے لیے ویب پر مبنی مفت آن لائن ایپ۔"
      },
      "DOCX": {
        "content": "مائیکروسافٹ ورڈ دستاویزات کو آن لائن دیکھنے اور ان میں ترمیم کرنے کے لیے مفت ایڈیٹر ایپ۔"
      },
      "PDF": {
        "content": "PDF اور XPS دستاویزات کو دیکھنے یا ان میں ترمیم کرنے کے لیے کوئی بھی ڈیوائس، کوئی بھی براؤزر استعمال کریں۔"
      }
    }
  }
}