{
  "head": {
    "title": "C# .NET dokumentų rengyklės API | Redaguokite Word Excel PowerPoint Web XML naudodami HTML",
    "description": "C# .NET dokumentų rengyklės API, skirta įkelti Microsoft Word, Excel, PowerPoint, PDF, XML, žiniatinklio ir tekstinių failų formatus į HTML, manipuliuoti ir konvertuoti atgal į pradinį formatą."
  },
  "header": {
    "title": ".NET API, skirta redaguoti dokumentus naudojant HTML",
    "description": "Kurkite .NET programas, kad galėtumėte integruotis su HTML redaktoriumi, gauti palaikomą dokumentą, redaguoti ir konvertuoti į pradinį formatą."
  },
  "Submenu": {
    "middle": {
      "button_overview": {
        "text": "Apžvalga"
      },
      "button_features": {
        "text": "funkcijos"
      },
      "button_support": {
        "text": "Palaikymas"
      },
      "button_livedemo": {
        "text": "Tiesioginė demonstracija"
      },
      "button_pricing": {
        "text": "Kainodara"
      }
    }
  },
  "Overview": {
    "content": "GroupDocs.Editor for .NET API padeda kurti paprastas ir lengvai naudojamas C#, ASP.NET ir kitas .NET programas, kurios lengvai integruojamos su populiariais HTML redaktoriais (tiek atvirojo kodo, tiek mokamais), kad būtų galima konvertuoti, redaguoti ir valdyti populiarūs failų formatai. Mūsų .NET redaktoriaus API leidžia įkelti dokumentą, konvertuoti jį į HTML, perkelti HTML į išorinį HTML redaktorių ir, atlikus manipuliavimą, išsaugo HTML pradiniame failo formate. Taip pat galite atskirai gauti išteklius, pridėtus prie bet kurio dokumento. Jis veikia su visų rūšių dokumentais, tokiais kaip „Microsoft Word“, „Excel“, „PowerPoint“, PDF, XPS, „OpenDocument“, tekstu, žiniatinkliu, el. paštu, el. knyga ir kt.",
    "tab1": {
      "description": "Toliau pateikiama .NET skirto GroupDocs.Editor apžvalga",
      "title": "Manipuliuoti naudojant HTML",
      "content1": "Įkelti palaikomą dokumentą",
      "content2": "Redaguokite turinį naudodami HTML",
      "content3": "Redaguoti susijusius stilius",
      "content4": "Konvertuoti į pradinį formatą"
    },
    "tab2": {
      "description": "NET skirta GroupDocs.Editor palaiko šiuos [failų formatus](https://docs.groupdocs.com/editor/java/supported-document-formats/)",
      "title": "Kitų formatų šeimos",
      "content1": "OpenDocument formatai",
      "content2": "Fiksuoto išdėstymo formatai",
      "content3": "Web formatai",
      "content4": "Elektroninių knygų (e-Book) formatai"
    },
    "tab3": {
      "description": "GroupDocs.Editor for .NET palaiko šias operacines sistemas, karkasus ir paketų tvarkykles",
      "title_os": "Operacinės sistemos",
      "title_frameworks": "Palaikomi karkasai",
      "title_packman": "Paketų tvarkytojai",
      "title_devenv": "Plėtros aplinkos"
    }
  },
  "Features": {
    "title": "GroupDocs.Editor, skirta .NET funkcijoms",
    "feature_loop": {
      "1": "Lengva integracija su bet kuriuo HTML redaktoriumi",
      "2": "Konvertuoti dokumentą į HTML DOM",
      "3": "Gaukite HTML turinį iš dokumentų srauto",
      "4": "Gaukite HTML turinį ir jo įterptuosius išteklius",
      "5": "Gaukite HTML kūno žymos turinį iš dokumento",
      "6": "Gaukite HTML dokumento CSS stilių lapus",
      "7": "Naršykite HTML turinį ir išsaugokite jo išteklius",
      "8": "Gaukite HTML DOM iš eilutės turinio ir konvertuokite į dokumentą",
      "9": "HTML DOM kartu su išteklių konvertavimu",
      "10": "Redaguokite įvairių formatų dokumentus HTML",
      "11": "Tiksli konversija",
      "12": "Gautam dokumentui pritaikykite skaitymo ir (arba) rašymo apsaugą",
      "13": "Sutvarkykite teksto apdorojimo dokumentus ir redaguokite bet kuriame WYSIWYG redaktoriuje",
      "14": "Duomenų bazė (DB) ir vartotojo sąsaja (UI) Agnostic",
      "15": "Galingos XML apdorojimo funkcijos",
      "16": "Gaukite OTF (atviro tipo šriftus) iš įvesties dokumentų ir eksportuokite į gautą dokumentą",
      "17": "Apdorokite rastrinius ir vektorinius vaizdus palaikomų įvesties dokumentų formatų viduje",
      "18": "Įdėkite redaguoto darbalapio turinį į pradinę skaičiuoklę norimoje vietoje",
      "19": "Redaguokite skaidres ir įdėkite jas į gautą skaičiuoklę",
      "20": "Išsaugodami įterpkite šriftus į gaunamą teksto apdorojimo dokumentą"
    },
    "more_features_loop": {
      "title1": "Tikslus konvertavimas į ir iš HTML DOM",
      "content1": "GroupDocs.Editor for .NET API leidžia jūsų .NET programoms gauti palaikomo formato dokumentą ir konvertuoti jį į HTML dokumento objekto modelį (DOM), kartu išgaunant pridedamus išteklius, pvz., CSS. Tada galite atlikti HTML pakeitimus naudodami savo mėgstamą HTML redaktorių. Kai baigsite redaguoti, GroupDocs.Editor for .NET API leidžia tiksliai konvertuoti šį HTML DOM atgal į pradinį failą.",
      "title2": "Įkelkite ir ištraukite išorinius išteklius",
      "content2": "GroupDocs.Editor for .NET API gali gauti išorinius išteklius, pridėtus prie palaikomų dokumentų, pvz., vaizdus, ​​šriftus, CSS ir kt. Tada gauti ištekliai gali būti įkelti, pereiti ir išsaugoti atskirai nuo gauto HTML dokumento. Tai suteikia jums lengviau valdomą išvestį.",
      "title3": "Taikykite teksto efektus teksto apdorojimo failų formatuose",
      "content3": "GroupDocs dokumentų rengyklės API leidžia pridėti sudėtingų teksto efektų (šešėlis, 3D efektas, kontūras, švytėjimas, graviravimas, įspaudimas) dirbant su palaikomais Microsoft Word dokumentų apdorojimo formatais. Ši funkcija yra automatiškai įjungta, kurią galima pastebėti apdorojant dokumentą su tokiais teksto efektais.",
      "title4": "Galingos XML manipuliavimo funkcijos",
      "content4-1": "Naudodami GroupDocs.Editor for .NET API galite atidaryti, peržiūrėti ir redaguoti XML dokumentus. Mūsų redagavimo API siūlo ypatingą XML žymų, atributų ir jų verčių, XML deklaracijų, CDATA skyrių, DOCTYPE apibrėžimų ir kitų XML specifinių objektų palaikymą ir atpažinimą. Galite tinkinti šrifto ir spalvų nustatymus kiekvienam atskiram XML struktūros objektui.",
      "content4-2": "XML keitiklio funkcija yra pakankamai protinga, kad parodytų XML failo klaidas ir kaip jas ištaisyti. URI ir el. pašto atpažinimo mechanizmas nuskaito XML atributus ir pateikia aptiktus URI bei el. pašto adresus A žymoje kaip nuorodas, kad juos būtų galima redaguoti kaip nuorodą, o ne kaip tekstą gautame HTML faile."
    }
  },
  "Solutions": {
    "title": "GroupDocs.Editor siūlo dokumentų redagavimo API kitoms populiarioms kūrimo aplinkoms"
  }
}