{
  "head": {
    "title": "Java Document Editor API | แก้ไขไฟล์ข้อความ Word Web XML โดยใช้ HTML",
    "description": "API ตัวแก้ไขเอกสารสำหรับ Java โหลดไฟล์ Microsoft Word, XML, เว็บและข้อความเป็น HTML และแปลงกลับเป็นรูปแบบเดิมหลังการจัดการ"
  },
  "header": {
    "title": "แก้ไขเอกสารผ่าน HTML โดยใช้ Java API",
    "description": "รวมแอปพลิเคชัน Java เข้ากับโปรแกรมแก้ไข HTML เพื่อจัดการเอกสารและแปลงกลับเป็นรูปแบบดั้งเดิม"
  },
  "Submenu": {
    "middle": {
      "button_overview": {
        "text": "ภาพรวม"
      },
      "button_features": {
        "text": "คุณสมบัติ"
      },
      "button_support": {
        "text": "สนับสนุน"
      },
      "button_livedemo": {
        "text": "สาธิตสด"
      },
      "button_pricing": {
        "text": "ราคา"
      }
    }
  },
  "Overview": {
    "content": "GroupDocs.Editor สำหรับ Java API ช่วยให้แก้ไขเอกสารในรูปแบบ HTML API รองรับรูปแบบเอกสารได้หลากหลายและสามารถรวมเข้ากับตัวแก้ไข HTML ภายนอก โอเพ่นซอร์ส หรือแบบชำระเงินได้ Editor API จะประมวลผลเพื่อโหลดเอกสาร แปลงเป็น HTML จัดเตรียม HTML เป็น UI ภายนอก จากนั้นบันทึก HTML ลงในเอกสารต้นฉบับหลังจากจัดการ นอกจากนี้ยังสามารถใช้เพื่อสร้าง Microsoft Word, สเปรดชีต Excel, ไฟล์ PowerPoint, รูปแบบ OpenDocument, เอกสาร XML และ TXT",
    "tab1": {
      "description": "ต่อไปนี้เป็นภาพรวมของ GroupDocs.Editor สำหรับ Java",
      "title": "จัดการโดยใช้ HTML",
      "content1": "โหลดเอกสารที่รองรับ",
      "content2": "แก้ไขเนื้อหาโดยใช้ HTML",
      "content3": "แก้ไขรูปแบบที่เกี่ยวข้อง",
      "content4": "แปลงเป็นรูปแบบดั้งเดิม"
    },
    "tab2": {
      "description": "GroupDocs.Editor สำหรับ Java รองรับ [รูปแบบไฟล์] ต่อไปนี้ (https://docs.groupdocs.com/editor/java/supported-document-formats/)",
      "title": "ตระกูลรูปแบบอื่นๆ",
      "content1": "รูปแบบ OpenDocument",
      "content2": "รูปแบบอีเมล",
      "content3": "รูปแบบเว็บ",
      "content4": "รูปแบบหนังสืออิเล็กทรอนิกส์ (e-Book)"
    },
    "tab3": {
      "description": "GroupDocs.Editor สำหรับ Java รองรับระบบปฏิบัติการ, Frameworks & Package Managers ต่อไปนี้",
      "title_os": "ระบบปฏิบัติการ",
      "title_frameworks": "กรอบงานที่รองรับ",
      "title_packman": "สร้างเครื่องมืออัตโนมัติ",
      "title_devenv": "สภาพแวดล้อมการพัฒนา"
    }
  },
  "Features": {
    "title": "GroupDocs.Editor สำหรับคุณสมบัติ Java",
    "feature_loop": {
      "1": "การรวมตัวแก้ไข HTML อย่างง่าย",
      "2": "การแปลงเอกสารเป็น HTML DOM",
      "3": "แยกเนื้อหา HTML จากสตรีมเอกสาร",
      "4": "โหลด แก้ไข และบันทึกรูปแบบไฟล์ Word, Excel & PowerPoint",
      "5": "ดึง HTML พร้อมกับองค์ประกอบที่ฝังตัว",
      "6": "นำเข้า ดูและแก้ไขเอกสาร XML",
      "7": "ข้ามเนื้อหา HTML และบันทึกทรัพยากรที่ฝังตัว",
      "8": "ดู แก้ไข และบันทึกเอกสารการประมวลผลคำในโหมดเพจ",
      "9": "รับเนื้อหาของแท็กเนื้อหา HTML จากไฟล์",
      "10": "แยกเนื้อหา CSS ของไฟล์ HTML",
      "11": "ใช้เนื้อหาสตริงเพื่อรับ HTML DOM และแปลงเป็นไฟล์",
      "12": "แปลง HTML DOM ด้วยองค์ประกอบที่ฝังตัว",
      "13": "แปลงไฟล์หลายรูปแบบใน HTML สำหรับการแก้ไข",
      "14": "รับข้อมูลเมตาของเอกสารอินพุตโดยไม่ต้องแก้ไข",
      "15": "บันทึกเอกสารที่แก้ไขเป็นรูปแบบไฟล์ข้อความธรรมดา",
      "16": "ความแม่นยำในการแปลง",
      "17": "ใช้รหัสผ่านกับเอกสารส่งออก",
      "18": "ฐานข้อมูล (DB) ไม่เชื่อเรื่องพระเจ้า",
      "19": "ส่วนต่อประสานผู้ใช้ (UI) ไม่เชื่อเรื่องพระเจ้า",
      "20": "รองรับ Metered Licensing"
    },
    "more_features_loop": {
      "title1": "แปลงเป็นและจาก HTML DOM . ได้อย่างแม่นยำ",
      "content1": "การใช้ GroupDocs.Editor สำหรับ Java ช่วยให้คุณสร้างแอปพลิเคชันใน Java ที่โหลดเอกสารรูปแบบไฟล์ที่รองรับเพื่อแปลงเป็น HTML Document Object Model (DOM) พร้อมกับองค์ประกอบที่เกี่ยวข้อง เช่น CSS นอกจากนี้ Editor Java API ของเรายังให้คุณแก้ไข HTML ในตัวแก้ไข HTML ยอดนิยมใดก็ได้ หลังจากแก้ไขตามที่คุณต้องการเสร็จแล้ว GroupDocs.Editor for Java จะช่วยคุณแปลง HTML ที่เป็นผลลัพธ์กลับเป็นรูปแบบไฟล์ดั้งเดิม",
      "title2": "โหลดและดึงองค์ประกอบที่เกี่ยวข้อง",
      "content2": "GroupDocs.Editor สำหรับ Java API ช่วยให้คุณสามารถดึงองค์ประกอบที่เกี่ยวข้องจากเอกสารในรูปแบบที่รองรับ เช่น รูปภาพ CSS แบบอักษร และอื่นๆ จากนั้นคุณสามารถโหลดองค์ประกอบที่เกี่ยวข้องที่ดึงมาเหล่านี้ สำรวจและบันทึกแยกจากไฟล์ HTML สุดท้าย และมีเอาต์พุตที่มีการจัดการที่ดี"
    }
  },
  "Solutions": {
    "title": "GroupDocs.Editor เสนอ API การแก้ไขเอกสารสำหรับสภาพแวดล้อมการพัฒนายอดนิยมอื่นๆ"
  }
}