{
  "head": {
    "title": "C# .NET құжат өңдегішінің API | HTML көмегімен Word Excel PowerPoint Web XML өңдеңіз",
    "description": "Microsoft Word, Excel, PowerPoint, PDF, XML, веб және мәтіндік файл пішімдерін HTML-ге жүктеу, өңдеу және бастапқы пішімге қайта түрлендіру үшін C# .NET құжат өңдегішінің API интерфейсі."
  },
  "header": {
    "title": "HTML арқылы құжаттарды өңдеуге арналған .NET API",
    "description": "HTML өңдегішімен біріктіру, қолдау көрсетілетін құжатты алу, өңдеу және бастапқы пішімге түрлендіру үшін .NET қолданбаларын жасаңыз."
  },
  "Submenu": {
    "middle": {
      "button_overview": {
        "text": "Шолу"
      },
      "button_features": {
        "text": "Ерекше өзгешеліктері"
      },
      "button_support": {
        "text": "Қолдау"
      },
      "button_livedemo": {
        "text": "Тікелей демо"
      },
      "button_pricing": {
        "text": "Баға белгілеу"
      }
    }
  },
  "Overview": {
    "content": ".NET API үшін GroupDocs.Editor қарапайым және пайдалану оңай C#, ASP.NET және басқа да .NET қолданбаларын құруға көмектеседі, олар құжаттарды түрлендіру, өңдеу және өңдеу үшін танымал HTML редакторларымен (ашық бастапқы және ақылы) оңай біріктіріледі. танымал файл пішімдері. Біздің .NET редакторының API интерфейсі құжатты жүктеуге, оны HTML-ге түрлендіруге, HTML-ді сыртқы HTML өңдегішіне итеруге және манипуляция аяқталғаннан кейін HTML-ді бастапқы файл пішіміне сақтауға мүмкіндік береді. Сондай-ақ кез келген құжатқа тіркелген ресурстарды бөлек алуға болады. Ол Microsoft Word, Excel, PowerPoint, PDF, XPS, OpenDocument, мәтін, веб, электрондық пошта, электрондық кітап және т.б. сияқты құжаттардың барлық түрлерімен жұмыс істейді.",
    "tab1": {
      "description": "Төменде .NET үшін GroupDocs.Editor шолуы берілген",
      "title": "HTML көмегімен манипуляциялау",
      "content1": "Қолдау көрсетілетін құжатты жүктеңіз",
      "content2": "HTML көмегімен мазмұнды өңдеу",
      "content3": "Қатысты мәнерлерді өңдеу",
      "content4": "Бастапқы пішімге түрлендіру"
    },
    "tab2": {
      "description": ".NET үшін GroupDocs.Editor келесі [файл пішімдерін] қолдайды(https://docs.groupdocs.com/editor/java/supported-document-formats/)",
      "title": "Басқа форматтағы отбасылар",
      "content1": "OpenDocument пішімдері",
      "content2": "Бекітілген орналасу пішімдері",
      "content3": "Веб пішімдері",
      "content4": "Электрондық кітап (e-Book) форматтары"
    },
    "tab3": {
      "description": ".NET үшін GroupDocs.Editor келесі операциялық жүйелерді, жақтауларды және пакет менеджерлерін қолдайды",
      "title_os": "Операциялық жүйелер",
      "title_frameworks": "Қолдау көрсетілетін жақтаулар",
      "title_packman": "Пакет менеджерлері",
      "title_devenv": "Даму орталары"
    }
  },
  "Features": {
    "title": ".NET мүмкіндіктеріне арналған GroupDocs.Editor",
    "feature_loop": {
      "1": "Кез келген HTML-редактормен оңай интеграция",
      "2": "Құжатты HTML DOM түріне түрлендіру",
      "3": "Құжат ағынынан HTML мазмұнын алу",
      "4": "HTML мазмұнын және оның ендірілген ресурстарын алыңыз",
      "5": "Құжаттан HTML негізгі тег мазмұнын алыңыз",
      "6": "HTML құжатының CSS стиль кестелерін алыңыз",
      "7": "HTML мазмұнын айналдырыңыз және оның ресурстарын сақтаңыз",
      "8": "Жол мазмұнынан HTML DOM алу және құжатқа түрлендіру",
      "9": "Ресурстарды түрлендірумен бірге HTML DOM",
      "10": "HTML-де әртүрлі форматтағы құжаттарды өңдеу",
      "11": "Дәл түрлендіру",
      "12": "Нәтижелік құжатқа оқу және/немесе жазудан қорғауды қолданыңыз",
      "13": "Кез келген WYSIWYG редакторларында мәтінді өңдеу құжаттарын парақтаңыз және өңдеңіз",
      "14": "Деректер қоры (ДБ) және пайдаланушы интерфейсі (UI) агностикалық",
      "15": "XML өңдеудің қуатты мүмкіндіктері",
      "16": "Кіріс құжаттарынан OTF (ашық типті қаріптер) шығарып алу және нәтиже құжатына экспорттау",
      "17": "Қолдау көрсетілетін кіріс құжат пішімдерінің ішінде растрлық және векторлық кескіндерді өңдеңіз",
      "18": "Өңделген жұмыс парағының мазмұнын бастапқы электрондық кестеге қажетті орынға кірістіру",
      "19": "Слайдтарды өңдеу және оларды нәтижелі электрондық кестеге кірістіру",
      "20": "Сақтау кезінде нәтиже мәтінін өңдеу құжатына қаріптерді ендіріңіз"
    },
    "more_features_loop": {
      "title1": "HTML DOM-ге және одан дәл түрлендіру",
      "content1": ".NET API үшін GroupDocs.Editor .NET қолданбаларына қолдау көрсетілетін пішімдегі құжатты алуға және оны HTML құжат нысанының үлгісіне (DOM) түрлендіруге және CSS сияқты тіркелген ресурстарды шығаруға мүмкіндік береді. Содан кейін таңдаулы HTML өңдегішін пайдаланып HTML-ге өзгертулер енгізуге болады. Өңдеуді аяқтағаннан кейін, .NET API үшін GroupDocs.Editor осы HTML DOM файлын бастапқы файлға дәл түрлендіруге мүмкіндік береді.",
      "title2": "Сыртқы ресурстарды жүктеу және шығару",
      "content2": ".NET API үшін GroupDocs.Editor кескіндер, қаріптер, CSS және т.б. сияқты қолдау көрсетілетін құжаттарға тіркелген сыртқы ресурстарды алуға қабілетті. Алынған ресурстарды нәтиже HTML құжатынан бөлек жүктеуге, өтуге және сақтауға болады. Бұл сізге оңай басқарылатын нәтиже береді.",
      "title3": "Мәтіндік әсерлерді мәтінді өңдеу файл пішімдері ішінде қолданыңыз",
      "content3": "GroupDocs құжат өңдегіші API қолдау көрсетілетін Microsoft Word құжат өңдеу пішімдерімен жұмыс істеу кезінде күрделі мәтін әсерлерін (Көлеңке, 3D эффекті, Контур, Жарқырау, Ою, Бедер) қосуға мүмкіндік береді. Бұл мүмкіндік автоматты түрде қосылады, оны мәтіндік әсерлері бар құжат өңделген кезде байқауға болады.",
      "title4": "XML манипуляциясының қуатты мүмкіндіктері",
      "content4-1": ".NET API үшін GroupDocs.Editor көмегімен XML құжаттарын ашуға, көруге және өңдеуге болады. Біздің өңдеу API арнайы қолдауды және XML тегтерін, атрибуттарды олардың мәндерімен бірге, XML мәлімдемелерін, CDATA бөлімдерін, DOCTYPE анықтамаларын және басқа XML арнайы нысандарын тануды ұсынады. XML құрылымындағы әрбір нақты нысан үшін қаріп пен түс параметрлерін теңшей аласыз.",
      "content4-2": "XML түрлендіргіш мүмкіндігі XML файлындағы қателерді және оларды түзету жолын көрсету үшін жеткілікті ақылды. URI және электрондық поштаны тану механизмі XML атрибуттарын сканерлейді және анықталған URI және электрондық пошта мекенжайларын A тегінде сілтеме ретінде көрсетеді, осылайша оларды нәтиже HTML файлындағы мәтін ретінде емес, сілтеме ретінде өңдеуге болады."
    }
  },
  "Solutions": {
    "title": "GroupDocs.Editor басқа танымал әзірлеу орталары үшін құжаттарды өңдеу API интерфейстерін ұсынады"
  }
}