{
    "head": {
        "title": "Решение для редактирования документов | Локальные API и бесплатные приложения",
        "description": "Редактирование документов для Microsoft Office, OpenDocument, PDF и других форматов файлов с использованием локальных API или приложения для онлайн-редактора документов."
    },
	"header": {
		"title": "Решение для редактирования документов",
		"description": "Редактор документов для работы с Microsoft Office, OpenOffice, PDF, HTML и другими форматами файлов документов."
	},
	"APIs": {
		"API_loop_high_code": {
			"title": "API-интерфейсы High Code для GroupDocs.Editor включают",
			"label": "Просмотреть все API High Code",
			"API_product_net": {
				"content": "Локальный .NET API, который помогает вашему приложению просматривать, редактировать и затем преобразовывать документы."
			},
			"API_product_java": {
				"content": "API редактирования документов для Microsoft Office, OpenOffice, HTML и других документов для управления в ваших приложениях на основе Java."
			}
		},
		"API_loop_low_code": {
			"title": "API-интерфейсы Low Code для GroupDocs.Editor включают",
			"label": "Просмотреть все API Low Code",
			"Cloud_SDK_net": {
				"content": "Добавьте мощные функции редактирования форматов документов в приложения .NET с помощью Cloud SDK для .NET. Редактировать документы MS Office, Web и XML."
			},
			"Cloud_SDK_java": {
				"content": "Расширенный SDK редактора документов для приложений Java для редактирования стандартных форматов файлов документов на любой платформе, способной вызывать REST API."
			}
		},
		"API_loop_no_code": {
			"title": "No Code-приложения GroupDocs.Editor включают",
			"label": "Просмотреть все No Code-приложения",
			"Total": {
				"content": "Бесплатное веб-приложение для редактирования популярных форматов файлов из MS Office &amp; OpenOffice."
			},
			"DOCX": {
				"content": "Бесплатное приложение-редактор для просмотра и редактирования документов Microsoft Word онлайн."
			},
			"PDF": {
				"content": "Используйте любое устройство, любой браузер для просмотра или редактирования документов PDF и XPS"
			}
		}
	}
}