{
  "head": {
    "title": "Solución de edición de documentos | API locales y aplicaciones gratuitas",
    "description": "Edición de documentos para Microsoft Office, OpenDocument, PDF y otros formatos de archivo mediante las API locales o la aplicación de edición de documentos en línea."
  },
  "header": {
    "title": "Solución de edición de documentos",
    "description": "Editor de documentos para manipular Microsoft Office, OpenOffice, PDF, HTML y otros formatos de archivos de documentos."
  },
  "APIs": {
    "API_loop_high_code": {
      "title": "Las API de código alto de GroupDocs.Editor incluyen",
      "label": "Ver todas las API de High Code",
      "API_product_net": {
        "content": "API .NET local que ayuda a su aplicación a ver, editar y luego convertir documentos."
      },
      "API_product_java": {
        "content": "API de edición de documentos para Microsoft Office, OpenOffice, HTML y otros documentos para manipular dentro de sus aplicaciones basadas en Java."
      }
    },
    "API_loop_low_code": {
      "title": "Las API de código bajo de GroupDocs.Editor incluyen",
      "label": "Ver todas las API de código bajo",
      "Cloud_SDK_net": {
        "content": "Agregue potentes funciones de edición de formatos de documentos en aplicaciones .NET mediante Cloud SDK para .NET. Edite documentos MS Office, Web y XML."
      },
      "Cloud_SDK_java": {
        "content": "Editor de documentos avanzado SDK para aplicaciones Java para editar formatos de archivo de documentos estándar de la industria en cualquier plataforma capaz de llamar a las API REST."
      }
    },
    "API_loop_no_code": {
      "title": "GroupDocs.Editor Sin código Las aplicaciones incluyen",
      "label": "Ver todas las aplicaciones sin código",
      "Total": {
        "content": "Aplicación en línea gratuita basada en la web para editar formatos de archivo populares de Office y OpenOffice."
      },
      "DOCX": {
        "content": "Aplicación de edición gratuita para ver y editar documentos de Microsoft Word en línea."
      },
      "PDF": {
        "content": "Use cualquier dispositivo, cualquier navegador para ver o editar documentos PDF y XPS."
      }
    }
  }
}