{
  "head": {
    "title": "C# .NET Document Editor API | Editați Word Excel PowerPoint Web XML folosind HTML",
    "description": "C# .NET document editor API pentru a încărca Microsoft Word, Excel, PowerPoint, PDF, XML, web și formate de fișiere text în HTML, pentru a manipula și converti înapoi în formatul original."
  },
  "header": {
    "title": ".NET API pentru a edita documente folosind HTML",
    "description": "Dezvoltați aplicații .NET, pentru a integra cu HTML Editor, Preluați documentul acceptat, editați și convertiți în formatul original."
  },
  "Submenu": {
    "middle": {
      "button_overview": {
        "text": "Prezentare generală"
      },
      "button_features": {
        "text": "Caracteristici"
      },
      "button_support": {
        "text": "A sustine"
      },
      "button_livedemo": {
        "text": "Demo live"
      },
      "button_pricing": {
        "text": "Prețuri"
      }
    }
  },
  "Overview": {
    "content": "GroupDocs.Editor pentru .NET API vă ajută să construiți aplicații C#, ASP.NET și alte aplicații .NET simple și ușor de utilizat, care se integrează ușor cu editorii HTML populari (atât open-source, cât și plătite) pentru a converti, edita și manipula documente de formate de fișiere populare. API-ul nostru .NET Editor vă permite să încărcați documentul, să-l convertiți în HTML, să împingeți HTML către un editor HTML extern și, odată ce manipularea este finalizată, să salveze HTML-ul în formatul de fișier original. De asemenea, puteți prelua separat resursele atașate la orice document. Funcționează cu tot felul de documente, cum ar fi cel pentru Microsoft Word, Excel, PowerPoint, PDF, XPS, OpenDocument, Text, Web, e-mail, e-Book și multe altele.",
    "tab1": {
      "description": "Mai jos este o prezentare generală a GroupDocs.Editor pentru .NET",
      "title": "Manipulați folosind HTML",
      "content1": "Încărcați documentul acceptat",
      "content2": "Editați conținutul folosind HTML",
      "content3": "Editați stiluri înrudite",
      "content4": "Convertiți în formatul original"
    },
    "tab2": {
      "description": "GroupDocs.Editor pentru .NET acceptă următoarele [formate de fișiere](https://docs.groupdocs.com/editor/java/supported-document-formats/)",
      "title": "Alte familii de format",
      "content1": "Formate OpenDocument",
      "content2": "Formate cu aspect fix",
      "content3": "Formate web",
      "content4": "Formate de carte electronică (e-Book)."
    },
    "tab3": {
      "description": "GroupDocs.Editor pentru .NET acceptă următoarele sisteme de operare, cadre și manageri de pachete",
      "title_os": "Sisteme de operare",
      "title_frameworks": "Cadre acceptate",
      "title_packman": "Manageri de pachete",
      "title_devenv": "Medii de dezvoltare"
    }
  },
  "Features": {
    "title": "GroupDocs.Editor pentru caracteristici .NET",
    "feature_loop": {
      "1": "Integrare ușoară cu orice editor HTML",
      "2": "Convertiți documentul în HTML DOM",
      "3": "Preluați conținut HTML din fluxul de documente",
      "4": "Obțineți conținut HTML și resursele sale încorporate",
      "5": "Obțineți conținut HTML Body Tag din document",
      "6": "Obțineți foi de stil CSS ale documentului HTML",
      "7": "Traversați conținutul HTML și salvați-i resursele",
      "8": "Preluați HTML DOM din șir de conținut și convertiți în document",
      "9": "HTML DOM împreună cu conversia resurselor",
      "10": "Editați documente de diferite formate în HTML",
      "11": "Conversie exactă",
      "12": "Aplicați protecția la citire și/sau la scriere documentului rezultat",
      "13": "Paginați documentele de procesare a textului și editați în orice editor WYSIWYG",
      "14": "Agnostic baza de date (DB) și interfață cu utilizatorul (UI).",
      "15": "Caracteristici puternice de procesare XML",
      "16": "Preluați OTF (fonturi de tip deschis) din documentele de intrare și exportați în documentul rezultat",
      "17": "Procesați imagini raster și vectoriale intern în formatele de document de intrare acceptate",
      "18": "Introduceți conținutul foii de lucru editate în foaia de calcul originală într-o poziție dorită",
      "19": "Editați diapozitive și inserați-le în foaia de calcul rezultată",
      "20": "Încorporați fonturi în documentul de procesare a textului rezultat în timp ce salvați"
    },
    "more_features_loop": {
      "title1": "Conversie precisă către și de la HTML DOM",
      "content1": "GroupDocs.Editor pentru .NET API permite aplicațiilor dvs. .NET să preia un document în format acceptat și să îl convertească într-un model HTML Document Object Model (DOM) împreună cu extragerea resurselor atașate, cum ar fi CSS. Apoi puteți face modificări la HTML folosind Editorul dvs. HTML preferat. Odată ce ați terminat cu editarea, GroupDocs.Editor pentru .NET API vă permite să convertiți cu precizie acest DOM HTML înapoi în fișierul original.",
      "title2": "Încărcați și extrageți resurse externe",
      "content2": "GroupDocs.Editor pentru .NET API este capabil să preia resursele externe atașate documentelor acceptate, cum ar fi imagini, fonturi, CSS și multe altele. Resursele preluate pot fi apoi încărcate, parcurse și salvate separat de documentul HTML rezultat. Acest lucru vă oferă o ieșire mai ușor de gestionat.",
      "title3": "Aplicați efecte de text în formatele de fișiere de procesare a textului",
      "content3": "API-ul pentru editorul de documente GroupDocs permite adăugarea de efecte de text complexe (umbră, efect 3D, contur, strălucire, gravare, relief) în timp ce lucrează cu formatele de procesare a documentelor Microsoft Word acceptate. Această caracteristică este activată automat și poate fi observată atunci când documentul cu astfel de efecte de text este procesat.",
      "title4": "Caracteristici puternice de manipulare XML",
      "content4-1": "Folosind GroupDocs.Editor pentru API .NET, puteți deschide, vizualiza și edita documente XML. API-ul nostru de editare oferă suport special și recunoașterea etichetelor XML, a atributelor împreună cu valorile acestora, a declarațiilor XML, a secțiunilor CDATA, a definițiilor DOCTYPE și a altor entități specifice XML. Puteți personaliza setările de font și culoare pentru fiecare entitate distinctă din structura XML.",
      "content4-2": "Caracteristica XML Converter este suficient de inteligentă pentru a afișa erorile din fișierul XML și cum să le remediați. Mecanismul de recunoaștere a URI și a e-mailului scanează atributele XML și reprezintă URI-urile și adresele de e-mail detectate în interiorul etichetei A ca linkuri, astfel încât acestea să poată fi editate ca link, nu ca text în fișierul HTML rezultat."
    }
  },
  "Solutions": {
    "title": "GroupDocs.Editor oferă API-uri de editare a documentelor pentru alte medii de dezvoltare populare"
  }
}