{
  "head": {
    "title": "C# .NET Document Editor API | Bewerk Word Excel PowerPoint Web XML met HTML",
    "description": "C# .NET document-editor-API om Microsoft Word-, Excel-, PowerPoint-, PDF-, XML-, web- en tekstbestandsformaten in HTML te laden, te manipuleren en terug te converteren naar het originele formaat."
  },
  "header": {
    "title": ".NET API om documenten te bewerken met HTML",
    "description": "Ontwikkel .NET-applicaties om te integreren met HTML-editor, ondersteunde documenten op te halen, te bewerken en om te zetten naar originele indeling."
  },
  "Submenu": {
    "middle": {
      "button_overview": {
        "text": "Overzicht"
      },
      "button_features": {
        "text": "Functies"
      },
      "button_support": {
        "text": "Steun"
      },
      "button_livedemo": {
        "text": "Live demonstratie"
      },
      "button_pricing": {
        "text": "Prijzen"
      }
    }
  },
  "Overview": {
    "content": "GroupDocs.Editor voor .NET API helpt u bij het bouwen van eenvoudige en gebruiksvriendelijke C#-, ASP.NET- en andere .NET-toepassingen die gemakkelijk kunnen worden geïntegreerd met populaire HTML-editors (zowel open-source als betaald) om documenten van populaire bestandsformaten. Met onze .NET Editor API kunt u een document laden, het converteren naar HTML, HTML pushen naar een externe HTML-editor, en zodra de manipulatie is voltooid, slaat u de HTML op in de oorspronkelijke bestandsindeling. U kunt ook afzonderlijk bronnen ophalen die bij elk document zijn gevoegd. Het werkt met allerlei soorten documenten, zoals die voor Microsoft Word, Excel, PowerPoint, PDF, XPS, OpenDocument, Tekst, Web, E-mail, e-Book en meer.",
    "tab1": {
      "description": "Hieronder volgt een overzicht van GroupDocs.Editor voor .NET",
      "title": "Manipuleren met HTML",
      "content1": "Ondersteund document laden",
      "content2": "Inhoud bewerken met HTML",
      "content3": "Gerelateerde stijlen bewerken",
      "content4": "Converteren naar origineel formaat"
    },
    "tab2": {
      "description": "GroupDocs.Editor voor .NET ondersteunt de volgende [bestandsindelingen](https://docs.groupdocs.com/editor/java/supported-document-formats/)",
      "title": "Andere formaatfamilies",
      "content1": "OpenDocument-indelingen",
      "content2": "Formaten met vaste lay-out",
      "content3": "Webformaten",
      "content4": "Indelingen voor elektronische boeken (e-books)"
    },
    "tab3": {
      "description": "GroupDocs.Editor voor .NET ondersteunt de volgende besturingssystemen, frameworks en pakketbeheerders",
      "title_os": "Besturingssystemen",
      "title_frameworks": "Ondersteunde kaders",
      "title_packman": "Pakketbeheerders",
      "title_devenv": "Ontwikkelomgevingen"
    }
  },
  "Features": {
    "title": "GroupDocs.Editor voor .NET-functies",
    "feature_loop": {
      "1": "Eenvoudige integratie met elke HTML-editor",
      "2": "Document converteren naar HTML DOM",
      "3": "HTML-inhoud ophalen uit Document Stream",
      "4": "HTML-inhoud en de ingesloten bronnen ophalen",
      "5": "Inhoud van HTML-hoofdtag ophalen uit document",
      "6": "CSS-stylesheets van HTML-document verkrijgen",
      "7": "Doorkruis HTML-inhoud en bewaar de bronnen",
      "8": "Haal HTML DOM op van String Content & Converteer naar Document",
      "9": "HTML DOM samen met bronnenconversie",
      "10": "Bewerk documenten van verschillende formaten in HTML",
      "11": "Nauwkeurige conversie",
      "12": "Pas lees- en/of schrijfbeveiliging toe op het resulterende document",
      "13": "Tekstverwerkingsdocumenten pagineren en bewerken in elke WYSIWYG-editor",
      "14": "Database (DB) en gebruikersinterface (UI) Agnostisch",
      "15": "Krachtige functies voor XML-verwerking",
      "16": "Haal OTF (Open Type Fonts) op uit invoerdocumenten en exporteer naar het resulterende document",
      "17": "Verwerk raster- en vectorafbeeldingen intern binnen ondersteunde invoerdocumentindelingen",
      "18": "Inhoud van het bewerkte werkblad invoegen in het originele werkblad op een gewenste positie",
      "19": "Bewerk dia's en voeg ze in de resulterende spreadsheet in",
      "20": "Lettertypen insluiten in het resulterende tekstverwerkingsdocument tijdens het opslaan"
    },
    "more_features_loop": {
      "title1": "Nauwkeurige conversie van en naar HTML DOM",
      "content1": "Met GroupDocs.Editor voor .NET API kunnen uw .NET-toepassingen een document met een ondersteund formaat ophalen en converteren naar een HTML Document Object Model (DOM) samen met extractie van gekoppelde bronnen, zoals CSS. U kunt vervolgens de wijzigingen in de HTML aanbrengen met uw favoriete HTML-editor. Als u klaar bent met bewerken, kunt u met GroupDocs.Editor voor .NET API deze HTML DOM nauwkeurig terug converteren naar het originele bestand.",
      "title2": "Externe bronnen laden en extraheren",
      "content2": "GroupDocs.Editor voor .NET API kan de externe bronnen ophalen die aan ondersteunde documenten zijn gekoppeld, zoals afbeeldingen, lettertypen, CSS en meer. De opgehaalde bronnen kunnen vervolgens afzonderlijk van het resulterende HTML-document worden geladen, doorkruist en opgeslagen. Dit geeft u een gemakkelijker beheerde uitvoer.",
      "title3": "Teksteffecten toepassen in bestandsindelingen voor tekstverwerking",
      "content3": "Met de API voor documenteditor van GroupDocs kunt u complexe teksteffecten toevoegen (schaduw, 3D-effect, omtrek, gloed, graveren, reliëf) terwijl u werkt met ondersteunde Microsoft Word-documentverwerkingsindelingen. Deze functie is automatisch ingeschakeld en kan worden waargenomen wanneer het document met dergelijke teksteffecten wordt verwerkt.",
      "title4": "Krachtige functies voor XML-manipulatie",
      "content4-1": "Met GroupDocs.Editor voor .NET API kunt u XML-documenten openen, bekijken en bewerken. Onze bewerkings-API biedt speciale ondersteuning en herkenning van XML-tags, attributen samen met hun waarden, XML-declaraties, CDATA-secties, DOCTYPE-definities en andere XML-specifieke entiteiten. U kunt lettertype- en kleurinstellingen aanpassen voor elke afzonderlijke entiteit in de XML-structuur.",
      "content4-2": "De XML Converter-functie is slim genoeg om fouten in het XML-bestand te tonen en te corrigeren. Het URI- en e-mailherkenningsmechanisme scant XML-attributen en stelt de gedetecteerde URI's en e-mailadressen in de A-tag voor als koppelingen, zodat ze als koppeling kunnen worden bewerkt, niet als tekst in het resulterende HTML-bestand."
    }
  },
  "Solutions": {
    "title": "GroupDocs.Editor biedt API's voor het bewerken van documenten voor andere populaire ontwikkelomgevingen"
  }
}