{
  "head": {
    "title": "जावा दस्तावेज़ संपादक एपीआई | HTML का उपयोग करके Word Web XML टेक्स्ट फ़ाइलें संपादित करें",
    "description": "जावा के लिए दस्तावेज़ संपादक एपीआई। माइक्रोसॉफ्ट वर्ड, एक्सएमएल, वेब और टेक्स्ट फाइलों को एचटीएमएल में लोड करें और हेरफेर के बाद मूल प्रारूप में वापस कनवर्ट करें।"
  },
  "header": {
    "title": "जावा एपीआई का उपयोग करके HTML के माध्यम से दस्तावेज़ संपादित करें",
    "description": "दस्तावेज़ों में हेरफेर करने और मूल स्वरूप में वापस कनवर्ट करने के लिए जावा एप्लिकेशन को HTML संपादक के साथ एकीकृत करें।"
  },
  "Submenu": {
    "middle": {
      "button_overview": {
        "text": "अवलोकन"
      },
      "button_features": {
        "text": "विशेषताएँ"
      },
      "button_support": {
        "text": "सहायता"
      },
      "button_livedemo": {
        "text": "लाइव डेमो"
      },
      "button_pricing": {
        "text": "मूल्य निर्धारण"
      }
    }
  },
  "Overview": {
    "content": "GroupDocs.Editor for Java API HTML के रूप में दस्तावेज़ संपादन को सक्षम बनाता है। एपीआई कई दस्तावेज़ स्वरूपों का समर्थन करता है और इसे किसी भी बाहरी, ओपनसोर्स या भुगतान किए गए HTML संपादक के साथ एकीकृत किया जा सकता है। संपादक एपीआई दस्तावेज़ों को लोड करने, इसे HTML में बदलने, बाहरी UI को HTML प्रदान करने और फिर हेरफेर के बाद HTML को मूल दस्तावेज़ में सहेजने की प्रक्रिया करेगा। इसका उपयोग विभिन्न Microsoft Word, Excel स्प्रेडशीट, PowerPoint फ़ाइलें, OpenDocument प्रारूप, XML और TXT दस्तावेज़ उत्पन्न करने के लिए भी किया जा सकता है।",
    "tab1": {
      "description": "जावा के लिए GroupDocs.Editor का अवलोकन निम्नलिखित है:",
      "title": "HTML का उपयोग करके हेरफेर करें",
      "content1": "समर्थित दस्तावेज़ लोड करें",
      "content2": "HTML का उपयोग करके सामग्री संपादित करें",
      "content3": "संबंधित शैलियाँ संपादित करें",
      "content4": "मूल प्रारूप में कनवर्ट करें"
    },
    "tab2": {
      "description": "जावा के लिए GroupDocs.Editor निम्नलिखित [फ़ाइल स्वरूपों] का समर्थन करता है (https://docs.groupdocs.com/editor/java/supported-document-formats/)",
      "title": "अन्य प्रारूप परिवार",
      "content1": "ओपन दस्तावेज़ प्रारूप",
      "content2": "ईमेल प्रारूप",
      "content3": "वेब प्रारूप",
      "content4": "इलेक्ट्रॉनिक पुस्तक (ई-बुक) प्रारूप"
    },
    "tab3": {
      "description": "जावा के लिए GroupDocs.Editor निम्नलिखित ऑपरेटिंग सिस्टम, फ्रेमवर्क और पैकेज मैनेजर का समर्थन करता है",
      "title_os": "ऑपरेटिंग सिस्टम",
      "title_frameworks": "समर्थित चौखटे",
      "title_packman": "स्वचालन उपकरण बनाएँ",
      "title_devenv": "विकास का माहौल"
    }
  },
  "Features": {
    "title": "GroupDocs.Editor for Java सुविधाएँ",
    "feature_loop": {
      "1": "आसान HTML संपादक एकीकरण",
      "2": "HTML DOM में दस्तावेज़ रूपांतरण",
      "3": "दस्तावेज़ स्ट्रीम से HTML सामग्री निकालें",
      "4": "Word, Excel और PowerPoint फ़ाइल स्वरूपों को लोड, संपादित और सहेजें",
      "5": "एम्बेडेड तत्वों के साथ HTML प्राप्त करें",
      "6": "XML दस्तावेज़ आयात करें, देखें और संपादित करें",
      "7": "HTML सामग्री को बाय-पास करें और एंबेडेड संसाधन सहेजें",
      "8": "पेजिनल मोड में वर्ड प्रोसेसिंग दस्तावेज़ देखें, संपादित करें और सहेजें",
      "9": "फ़ाइल से HTML बॉडी टैग की सामग्री प्राप्त करें",
      "10": "HTML फ़ाइल की CSS सामग्री निकालें",
      "11": "HTML DOM प्राप्त करने और फ़ाइल में कनवर्ट करने के लिए स्ट्रिंग सामग्री का उपयोग करें",
      "12": "HTML DOM को एंबेडेड एलिमेंट्स के साथ कन्वर्ट करें",
      "13": "संपादन के लिए HTML में एकाधिक स्वरूपों की फ़ाइलें कनवर्ट करें",
      "14": "संपादन के बिना इनपुट दस्तावेज़ों की मेटा जानकारी प्राप्त करें",
      "15": "संपादित दस्तावेज़ों को सादा पाठ फ़ाइल स्वरूप में सहेजें",
      "16": "रूपांतरण सटीकता",
      "17": "आउटपुट दस्तावेज़ में पासवर्ड लागू करें",
      "18": "डेटाबेस (डीबी) अज्ञेयवादी",
      "19": "यूजर इंटरफेस (यूआई) अज्ञेयवादी",
      "20": "मीटर्ड लाइसेंसिंग का समर्थन करता है"
    },
    "more_features_loop": {
      "title1": "HTML DOM में और उससे सटीक रूप से कनवर्ट करें",
      "content1": "जावा के लिए GroupDocs.Editor का उपयोग करने से आप जावा में ऐसे एप्लिकेशन बना सकते हैं जो समर्थित फ़ाइल स्वरूप के दस्तावेज़ को इसके संबद्ध तत्वों, जैसे, CSS के साथ HTML दस्तावेज़ ऑब्जेक्ट मॉडल (DOM) में परिवर्तित करने के लिए लोड करते हैं। इसके अलावा, हमारा संपादक जावा एपीआई आपको किसी भी लोकप्रिय HTML संपादक में HTML को संपादित करने की अनुमति देता है। आपके आवश्यक संशोधन किए जाने के बाद, Java के लिए GroupDocs.Editor आपको इस परिणामी HTML को उसके मूल फ़ाइल स्वरूप में बदलने में मदद करता है।",
      "title2": "लोड और फ़ेच सहयोगी तत्व",
      "content2": "GroupDocs.Editor for Java API आपको समर्थित स्वरूपों के दस्तावेज़ों, जैसे छवियों, CSS, फोंट और अधिक से संबद्ध तत्वों को लाने में सक्षम बनाता है। फिर आप इन प्राप्त किए गए संबद्ध तत्वों को लोड कर सकते हैं, उन्हें पार कर सकते हैं और उन्हें अंतिम HTML फ़ाइल से अलग से सहेज सकते हैं, और एक अच्छी तरह से प्रबंधित आउटपुट प्राप्त कर सकते हैं।"
    }
  },
  "Solutions": {
    "title": "GroupDocs.Editor अन्य लोकप्रिय विकास परिवेशों के लिए दस्तावेज़ संपादन API प्रदान करता है"
  }
}