{
  "head": {
    "title": "Java-Dokumenteditor-API | Bearbeiten Sie Word-Web-XML-Textdateien mit HTML",
    "description": "Dokumenteditor-API für Java. Laden Sie Microsoft Word-, XML-, Web- und Textdateien in HTML und konvertieren Sie sie nach der Bearbeitung wieder in das ursprüngliche Format."
  },
  "header": {
    "title": "Bearbeiten Sie Dokumente über HTML mit Java API",
    "description": "Integrieren Sie Java-Anwendungen in den HTML-Editor, um Dokumente zu manipulieren und zurück in das ursprüngliche Format zu konvertieren."
  },
  "Submenu": {
    "middle": {
      "button_overview": {
        "text": "Überblick"
      },
      "button_features": {
        "text": "Merkmale"
      },
      "button_support": {
        "text": "Die Unterstützung"
      },
      "button_livedemo": {
        "text": "Live-Demo"
      },
      "button_pricing": {
        "text": "Preisgestaltung"
      }
    }
  },
  "Overview": {
    "content": "GroupDocs.Editor for Java API ermöglicht die Dokumentenbearbeitung in Form von HTML. Die API unterstützt mehrere Dokumentformate und kann in jeden externen, Open-Source- oder kostenpflichtigen HTML-Editor integriert werden. Die Editor-API wird verarbeitet, um Dokumente zu laden, sie in HTML zu konvertieren, HTML für die externe Benutzeroberfläche bereitzustellen und dann HTML nach der Bearbeitung im Originaldokument zu speichern. Es kann auch verwendet werden, um verschiedene Microsoft Word-, Excel-Tabellen, PowerPoint-Dateien, OpenDocument-Formate, XML- und TXT-Dokumente zu generieren.",
    "tab1": {
      "description": "Nachfolgend finden Sie eine Übersicht über GroupDocs.Editor für Java",
      "title": "Manipulieren mit HTML",
      "content1": "Unterstütztes Dokument laden",
      "content2": "Bearbeiten Sie Inhalte mit HTML",
      "content3": "Verwandte Stile bearbeiten",
      "content4": "In Originalformat konvertieren"
    },
    "tab2": {
      "description": "GroupDocs.Editor für Java unterstützt folgende [Dateiformate](https://docs.groupdocs.com/editor/java/supported-document-formats/)",
      "title": "Andere Formatfamilien",
      "content1": "OpenDocument-Formate",
      "content2": "E-Mail-Formate",
      "content3": "Webformate",
      "content4": "Elektronische Buchformate (e-Book)."
    },
    "tab3": {
      "description": "GroupDocs.Editor für Java unterstützt folgende Betriebssysteme, Frameworks und Paketmanager",
      "title_os": "Betriebssysteme",
      "title_frameworks": "Unterstützte Frameworks",
      "title_packman": "Build-Automatisierungstool",
      "title_devenv": "Entwicklungsumgebungen"
    }
  },
  "Features": {
    "title": "GroupDocs.Editor für Java-Funktionen",
    "feature_loop": {
      "1": "Einfache HTML-Editor-Integration",
      "2": "Dokumentkonvertierung in HTML DOM",
      "3": "Extrahieren Sie HTML-Inhalte aus dem Dokumentenstrom",
      "4": "Word-, Excel- und PowerPoint-Dateiformate laden, bearbeiten und speichern",
      "5": "HTML zusammen mit eingebetteten Elementen abrufen",
      "6": "XML-Dokumente importieren, anzeigen und bearbeiten",
      "7": "Umgehen Sie HTML-Inhalte und speichern Sie eingebettete Ressourcen",
      "8": "Anzeigen, Bearbeiten und Speichern von Textverarbeitungsdokumenten im Seitenmodus",
      "9": "Holen Sie sich den Inhalt des HTML-Body-Tags aus der Datei",
      "10": "Extrahieren Sie den CSS-Inhalt der HTML-Datei",
      "11": "Verwenden Sie String-Inhalt, um HTML-DOM zu erhalten und in eine Datei zu konvertieren",
      "12": "Konvertieren Sie HTML-DOM mit eingebetteten Elementen",
      "13": "Konvertieren Sie Dateien mehrerer Formate in HTML zur Bearbeitung",
      "14": "Erhalten Sie Metainformationen von Eingabedokumenten ohne Bearbeitung",
      "15": "Speichern Sie bearbeitete Dokumente im Nur-Text-Dateiformat",
      "16": "Konvertierungsgenauigkeit",
      "17": "Kennwort auf Ausgabedokument anwenden",
      "18": "Datenbank (DB) Agnostisch",
      "19": "Benutzeroberfläche (UI) Agnostisch",
      "20": "Unterstützt die gebührenpflichtige Lizenzierung"
    },
    "more_features_loop": {
      "title1": "Präzise Konvertierung in und aus HTML DOM",
      "content1": "Mit GroupDocs.Editor für Java können Sie Anwendungen in Java erstellen, die ein Dokument eines unterstützten Dateiformats laden, um es zusammen mit den zugehörigen Elementen, z. B. CSS, in das HTML-Dokumentobjektmodell (DOM) zu konvertieren. Darüber hinaus ermöglicht Ihnen unsere Editor-Java-API, den HTML-Code in einem der gängigen HTML-Editoren zu bearbeiten. Nachdem Ihre erforderlichen Änderungen vorgenommen wurden, hilft Ihnen GroupDocs.Editor für Java, dieses resultierende HTML wieder in sein ursprüngliches Dateiformat zu konvertieren.",
      "title2": "Zugeordnete Elemente laden und abrufen",
      "content2": "GroupDocs.Editor for Java API ermöglicht es Ihnen, die zugehörigen Elemente aus Dokumenten unterstützter Formate wie Bilder, CSS, Schriftarten und mehr abzurufen. Dann können Sie diese abgerufenen verknüpften Elemente laden, sie durchlaufen und separat von der endgültigen HTML-Datei speichern und haben eine gut verwaltete Ausgabe."
    }
  },
  "Solutions": {
    "title": "GroupDocs.Editor bietet Dokumentenbearbeitungs-APIs für andere beliebte Entwicklungsumgebungen"
  }
}