{
  "head": {
    "title": "Java Document Editor API | Editați fișierele text Word Web XML folosind HTML",
    "description": "API pentru editorul de documente pentru Java. Încărcați fișiere Microsoft Word, XML, web și text în HTML și convertiți înapoi în formatul original după manipulare."
  },
  "header": {
    "title": "Editați documente prin HTML utilizând API-ul Java",
    "description": "Integrați aplicațiile Java cu editorul HTML pentru a manipula documente și a le converti înapoi în formatul original."
  },
  "Submenu": {
    "middle": {
      "button_overview": {
        "text": "Prezentare generală"
      },
      "button_features": {
        "text": "Caracteristici"
      },
      "button_support": {
        "text": "A sustine"
      },
      "button_livedemo": {
        "text": "Demo live"
      },
      "button_pricing": {
        "text": "Prețuri"
      }
    }
  },
  "Overview": {
    "content": "API GroupDocs.Editor pentru Java permite editarea documentelor sub formă de HTML. API acceptă mai multe formate de document și poate fi integrat cu orice editor HTML extern, opensource sau plătit. Editor API va procesa pentru a încărca documente, le va converti în HTML, va furniza HTML la interfața de utilizare externă și apoi va salva HTML în documentul original după manipulare. De asemenea, poate fi folosit pentru a genera diferite Microsoft Word, foi de calcul Excel, fișiere PowerPoint, formate OpenDocument, documente XML și TXT.",
    "tab1": {
      "description": "Mai jos este o prezentare generală a GroupDocs.Editor pentru Java",
      "title": "Manipulați folosind HTML",
      "content1": "Încărcați documentul acceptat",
      "content2": "Editați conținutul folosind HTML",
      "content3": "Editați stiluri înrudite",
      "content4": "Convertiți în formatul original"
    },
    "tab2": {
      "description": "GroupDocs.Editor pentru Java acceptă următoarele [formate de fișiere](https://docs.groupdocs.com/editor/java/supported-document-formats/)",
      "title": "Alte familii de format",
      "content1": "Formate OpenDocument",
      "content2": "Formate de e-mail",
      "content3": "Formate web",
      "content4": "Formate de carte electronică (e-Book)."
    },
    "tab3": {
      "description": "GroupDocs.Editor pentru Java acceptă următoarele sisteme de operare, cadre și manageri de pachete",
      "title_os": "Sisteme de operare",
      "title_frameworks": "Cadre acceptate",
      "title_packman": "Build Automation Tool",
      "title_devenv": "Medii de dezvoltare"
    }
  },
  "Features": {
    "title": "GroupDocs.Editor pentru caracteristici Java",
    "feature_loop": {
      "1": "Integrare ușoară a editorului HTML",
      "2": "Conversia documentului în HTML DOM",
      "3": "Extrageți conținut HTML din fluxul de documente",
      "4": "Încărcați, editați și salvați formatele de fișiere Word, Excel și PowerPoint",
      "5": "Preluați HTML împreună cu Elementele încorporate",
      "6": "Importați, vizualizați și editați documente XML",
      "7": "Ocoliți conținutul HTML și salvați resursele încorporate",
      "8": "Vizualizați, editați și salvați documentele de procesare a textului în modul paginal",
      "9": "Obțineți conținutul etichetei HTML Body din fișier",
      "10": "Extrageți conținutul CSS al fișierului HTML",
      "11": "Utilizați conținut șir pentru a obține HTML DOM și pentru a converti în fișier",
      "12": "Convertiți HTML DOM cu elemente încorporate",
      "13": "Convertiți fișiere cu mai multe formate în HTML pentru editare",
      "14": "Obțineți metainformații ale documentelor de intrare fără editare",
      "15": "Salvați documentele editate în format de fișier text simplu",
      "16": "Precizia conversiei",
      "17": "Aplicați parola la documentul de ieșire",
      "18": "Baza de date (DB) Agnostic",
      "19": "Interfață utilizator (UI) Agnostic",
      "20": "Acceptă licențierea măsurată"
    },
    "more_features_loop": {
      "title1": "Convertiți cu precizie în și de la HTML DOM",
      "content1": "Folosirea GroupDocs.Editor pentru Java vă permite să construiți aplicații în Java care încarcă un document cu format de fișier acceptat pentru a-l converti în HTML Document Object Model (DOM) împreună cu elementele asociate acestuia, de exemplu, CSS. Mai mult, API-ul nostru Editor Java vă permite să editați codul HTML în oricare dintre editorii HTML populari. După ce sunt efectuate modificările necesare, GroupDocs.Editor pentru Java vă ajută să convertiți acest HTML rezultat înapoi în formatul său original de fișier.",
      "title2": "Încărcați și preluați elementele asociate",
      "content2": "GroupDocs.Editor pentru Java API vă permite să preluați elementele asociate din documente cu formate acceptate, cum ar fi imagini, CSS, fonturi și altele. Apoi puteți încărca aceste elemente asociate preluate, le puteți traversa și le puteți salva separat de fișierul HTML final și aveți o ieșire bine gestionată."
    }
  },
  "Solutions": {
    "title": "GroupDocs.Editor oferă API-uri de editare a documentelor pentru alte medii de dezvoltare populare"
  }
}