{
  "head": {
    "title": "C# .NET API за редактор на документи | Редактирайте Word Excel PowerPoint Web XML с помощта на HTML",
    "description": "C# .NET API за редактор на документи за зареждане на Microsoft Word, Excel, PowerPoint, PDF, XML, уеб и текстови файлови формати в HTML, манипулиране и конвертиране обратно в оригиналния формат."
  },
  "header": {
    "title": ".NET API за редактиране на документи чрез HTML",
    "description": "Разработване на .NET приложения, за интегриране с HTML редактор, извличане на поддържан документ, редактиране и конвертиране в оригинален формат."
  },
  "Submenu": {
    "middle": {
      "button_overview": {
        "text": "Преглед"
      },
      "button_features": {
        "text": "Характеристика"
      },
      "button_support": {
        "text": "поддържа"
      },
      "button_livedemo": {
        "text": "Демо на живо"
      },
      "button_pricing": {
        "text": "Ценообразуване"
      }
    }
  },
  "Overview": {
    "content": "GroupDocs.Editor за .NET API ви помага да създавате прости и лесни за използване C#, ASP.NET и други .NET приложения, които лесно се интегрират с популярни HTML редактори (както с отворен код, така и платени), за да конвертирате, редактирате и манипулирате документи на популярни файлови формати. Нашият API за .NET редактор ви позволява да заредите документ, да го конвертирате в HTML, да изпратите HTML към външен HTML редактор и след като манипулацията приключи, записва HTML в оригиналния му файлов формат. Можете също така отделно да извличате ресурси, прикачени към всеки документ. Работи с всички видове документи, като този за Microsoft Word, Excel, PowerPoint, PDF, XPS, OpenDocument, Text, Web, Email, e-Book и др.",
    "tab1": {
      "description": "Следва общ преглед на GroupDocs.Editor за .NET",
      "title": "Манипулирайте с помощта на HTML",
      "content1": "Заредете поддържан документ",
      "content2": "Редактирайте съдържание с помощта на HTML",
      "content3": "Редактиране на свързани стилове",
      "content4": "Конвертиране в оригинален формат"
    },
    "tab2": {
      "description": "GroupDocs.Editor за .NET поддържа следните [файлови формати](https://docs.groupdocs.com/editor/java/supported-document-formats/)",
      "title": "Други форматни семейства",
      "content1": "OpenDocument формати",
      "content2": "Формати с фиксирано оформление",
      "content3": "Уеб формати",
      "content4": "Формати на електронни книги (e-Book)."
    },
    "tab3": {
      "description": "GroupDocs.Editor за .NET поддържа следните операционни системи, рамки и мениджъри на пакети",
      "title_os": "Операционна система",
      "title_frameworks": "Поддържани рамки",
      "title_packman": "Мениджъри на пакети",
      "title_devenv": "Среди за разработка"
    }
  },
  "Features": {
    "title": "GroupDocs.Editor за функции на .NET",
    "feature_loop": {
      "1": "Лесна интеграция с всеки HTML-редактор",
      "2": "Преобразуване на документ в HTML DOM",
      "3": "Извличане на HTML съдържание от документен поток",
      "4": "Вземете HTML съдържание и неговите вградени ресурси",
      "5": "Получаване на съдържание на HTML Body Tag от документа",
      "6": "Вземете CSS таблици със стилове на HTML документ",
      "7": "Прегледайте HTML съдържанието и запазете неговите ресурси",
      "8": "Извличане на HTML DOM от съдържание на низ и преобразуване в документ",
      "9": "HTML DOM заедно с преобразуване на ресурси",
      "10": "Редактирайте документи с различни формати в HTML",
      "11": "Точно преобразуване",
      "12": "Приложете защита за четене и/или запис към получения документ",
      "13": "Пагинирайте документите за текстообработка и редактирайте във всеки WYSIWYG редактор",
      "14": "База данни (DB) и потребителски интерфейс (UI) Agnostic",
      "15": "Мощни функции за обработка на XML",
      "16": "Извличане на OTF (шрифтове с отворен тип) от входни документи и експортиране в резултатен документ",
      "17": "Обработвайте растерни и векторни изображения вътрешно в рамките на поддържаните входни формати на документи",
      "18": "Вмъкване на съдържанието на редактирания работен лист в оригиналната електронна таблица на желана позиция",
      "19": "Редактирайте слайдове и ги вмъкнете в получената електронна таблица",
      "20": "Вграждане на шрифтове в получения текстообработващ документ при запазване"
    },
    "more_features_loop": {
      "title1": "Точно преобразуване към и от HTML DOM",
      "content1": "GroupDocs.Editor за .NET API позволява на вашите .NET приложения да извличат документ с поддържан формат и да го конвертират в HTML Document Object Model (DOM) заедно с извличане на прикачени ресурси, като CSS. След това можете да направите промените в HTML, като използвате любимия си HTML редактор. След като приключите с редактирането, GroupDocs.Editor for .NET API ви позволява точно да конвертирате този HTML DOM обратно в оригиналния файл.",
      "title2": "Зареждане и извличане на външни ресурси",
      "content2": "GroupDocs.Editor за .NET API може да извлича външни ресурси, прикачени към поддържани документи, като изображения, шрифтове, CSS и други. След това извлечените ресурси могат да бъдат заредени, обходени и запазени отделно от получения HTML документ. Това ви дава по-лесно управляван резултат.",
      "title3": "Прилагане на текстови ефекти във файлови формати за текстообработка",
      "content3": "API за редактор на документи GroupDocs позволява добавяне на сложни текстови ефекти (сянка, 3D ефект, контур, блясък, гравиране, релеф), докато работите с поддържани формати за обработка на документи на Microsoft Word. Тази функция е автоматично активирана и може да се наблюдава, когато документът с такива текстови ефекти се обработва.",
      "title4": "Мощни функции за манипулиране на XML",
      "content4-1": "С помощта на GroupDocs.Editor за .NET API можете да отваряте, преглеждате и редактирате XML документи. Нашият API за редактиране предлага специална поддръжка и разпознаване на XML тагове, атрибути заедно с техните стойности, XML декларации, CDATA секции, DOCTYPE дефиниции и други специфични за XML обекти. Можете да персонализирате настройките за шрифт и цвят за всеки отделен обект в XML структурата.",
      "content4-2": "Функцията XML конвертор е достатъчно интелигентна, за да покаже грешки в XML файла и как да ги поправите. Механизмът за разпознаване на URI адреси и имейл сканира XML атрибути и представя откритите URI адреси и имейл адреси в етикета A като връзки, така че да могат да бъдат редактирани като връзка, а не като текст в получения HTML файл."
    }
  },
  "Solutions": {
    "title": "GroupDocs.Editor предлага API за редактиране на документи за други популярни среди за разработка"
  }
}