{
  "head": {
    "title": "C# .NET Document Editor API | Uredite Word Excel PowerPoint Web XML koristeći HTML",
    "description": "C# .NET API za uređivanje dokumenata za učitavanje formata Microsoft Worda, Excela, PowerPointa, PDF-a, XML-a, weba i tekstualnih datoteka u HTML, manipuliranje i pretvaranje natrag u izvorni format."
  },
  "header": {
    "title": ".NET API za uređivanje dokumenata pomoću HTML-a",
    "description": "Razvijte .NET aplikacije za integraciju s HTML uređivačem, dohvaćanje podržanih dokumenata, uređivanje i pretvaranje u izvorni format."
  },
  "Submenu": {
    "middle": {
      "button_overview": {
        "text": "Pregled"
      },
      "button_features": {
        "text": "Značajke"
      },
      "button_support": {
        "text": "podrška"
      },
      "button_livedemo": {
        "text": "Demo uživo"
      },
      "button_pricing": {
        "text": "Cijene"
      }
    }
  },
  "Overview": {
    "content": "GroupDocs.Editor za .NET API pomaže vam da napravite jednostavne i jednostavne za korištenje C#, ASP.NET i druge .NET aplikacije koje se lako integriraju s popularnim HTML uređivačima (i otvorenim i plaćenim) za pretvaranje, uređivanje i manipuliranje dokumentima popularni formati datoteka. Naš .NET Editor API omogućuje vam učitavanje dokumenta, pretvaranje u HTML, guranje HTML-a u vanjski HTML uređivač i nakon što je manipulacija obavljena, sprema HTML u izvorni format datoteke. Također možete odvojeno dohvatiti resurse priložene uz bilo koji dokument. Radi sa svim vrstama dokumenata, poput onih za Microsoft Word, Excel, PowerPoint, PDF, XPS, OpenDocument, tekst, web, e-poštu, e-knjigu i više.",
    "tab1": {
      "description": "Slijedi pregled GroupDocs.Editor za .NET",
      "title": "Manipulirajte pomoću HTML-a",
      "content1": "Učitaj podržani dokument",
      "content2": "Uredite sadržaj pomoću HTML-a",
      "content3": "Uredi povezane stilove",
      "content4": "Pretvori u izvorni format"
    },
    "tab2": {
      "description": "GroupDocs.Editor za .NET podržava sljedeće [formate datoteka](https://docs.groupdocs.com/editor/java/supported-document-formats/)",
      "title": "Druge obitelji formata",
      "content1": "OpenDocument formati",
      "content2": "Formati s fiksnim izgledom",
      "content3": "Web formati",
      "content4": "Formati elektroničkih knjiga (e-knjiga)."
    },
    "tab3": {
      "description": "GroupDocs.Editor za .NET podržava sljedeće operativne sustave, okvire i upravitelje paketa",
      "title_os": "Operacijski sustavi",
      "title_frameworks": "Podržani okviri",
      "title_packman": "Upravitelji paketa",
      "title_devenv": "Razvojna okruženja"
    }
  },
  "Features": {
    "title": "GroupDocs.Editor za .NET značajke",
    "feature_loop": {
      "1": "Jednostavna integracija s bilo kojim HTML uređivačem",
      "2": "Pretvorite dokument u HTML DOM",
      "3": "Dohvaćanje HTML sadržaja iz streama dokumenata",
      "4": "Nabavite HTML sadržaj i njegove ugrađene resurse",
      "5": "Nabavite sadržaj HTML oznake tijela iz dokumenta",
      "6": "Nabavite CSS tablice stilova HTML dokumenta",
      "7": "Prođite kroz HTML sadržaj i spremite njegove resurse",
      "8": "Dohvaćanje HTML DOM-a iz sadržaja niza i pretvaranje u dokument",
      "9": "HTML DOM zajedno s pretvorbom resursa",
      "10": "Uredite dokumente različitih formata u HTML-u",
      "11": "Točna pretvorba",
      "12": "Primijenite zaštitu od čitanja i/ili pisanja na rezultirajući dokument",
      "13": "Paginirajte dokumente za obradu teksta i uredite u bilo kojem WYSIWYG uređivaču",
      "14": "Baza podataka (DB) i korisničko sučelje (UI) Agnostic",
      "15": "Snažne značajke za obradu XML-a",
      "16": "Dohvaćanje OTF (fontova otvorenog tipa) iz ulaznih dokumenata i izvoz u rezultirajući dokument",
      "17": "Obradite rasterske i vektorske slike interno unutar podržanih ulaznih formata dokumenata",
      "18": "Umetnite sadržaj uređenog radnog lista u izvornu proračunsku tablicu na željenom mjestu",
      "19": "Uredite slajdove i umetnite ih u rezultirajuću proračunsku tablicu",
      "20": "Ugradite fontove u rezultirajući dokument za obradu teksta tijekom spremanja"
    },
    "more_features_loop": {
      "title1": "Točna pretvorba u i iz HTML DOM-a",
      "content1": "GroupDocs.Editor za .NET API omogućuje vašim .NET aplikacijama da dohvate dokument podržanog formata i pretvore ga u HTML Document Object Model (DOM) zajedno s izdvajanjem priloženih resursa, kao što je CSS. Zatim možete izvršiti izmjene u HTML-u koristeći svoj omiljeni HTML uređivač. Nakon što završite s uređivanjem, GroupDocs.Editor za .NET API omogućuje vam točnu konverziju ovog HTML DOM-a natrag u izvornu datoteku.",
      "title2": "Učitaj i izdvoji vanjske resurse",
      "content2": "GroupDocs.Editor za .NET API može dohvaćati vanjske resurse priložene podržanim dokumentima, kao što su slike, fontovi, CSS i drugo. Dohvaćeni resursi se zatim mogu učitati, prelaziti i spremati odvojeno od rezultirajućeg HTML dokumenta. To vam daje izlaz kojim se lakše upravlja.",
      "title3": "Primijenite tekstualne efekte unutar formata datoteka za obradu teksta",
      "content3": "API za uređivač dokumenata GroupDocs omogućuje dodavanje složenih tekstualnih efekata (sjena, 3D efekt, kontura, sjaj, graviranje, reljef) tijekom rada s podržanim formatima za obradu dokumenata Microsoft Word. Ova značajka je automatski omogućena i može se promatrati kada se obrađuje dokument s takvim tekstualnim efektima.",
      "title4": "Moćne značajke za manipulaciju XML-om",
      "content4-1": "Pomoću GroupDocs.Editor za .NET API možete otvarati, pregledavati i uređivati ​​XML dokumente. Naš API za uređivanje nudi posebnu podršku i prepoznavanje XML oznaka, atributa zajedno s njihovim vrijednostima, XML deklaracija, CDATA odjeljaka, DOCTYPE definicija i drugih XML specifičnih entiteta. Možete prilagoditi postavke fonta i boje za svaki zasebni entitet u XML strukturi.",
      "content4-2": "Značajka XML Converter dovoljno je pametna da prikaže pogreške u XML datoteci i kako ih popraviti. Mehanizam prepoznavanja URI-ja i e-pošte skenira XML atribute i predstavlja otkrivene URI-je i adrese e-pošte unutar oznake A kao veze tako da se mogu uređivati ​​kao poveznica, a ne kao tekst unutar rezultirajuće HTML datoteke."
    }
  },
  "Solutions": {
    "title": "GroupDocs.Editor nudi API-je za uređivanje dokumenata za druga popularna razvojna okruženja"
  }
}