{
  "head": {
    "title": "API dell'editor di documenti Java | Modifica i file di testo XML Web di Word utilizzando HTML",
    "description": "API dell'editor di documenti per Java. Carica file Microsoft Word, XML, Web e di testo in HTML e riconverti nel formato originale dopo la manipolazione."
  },
  "header": {
    "title": "Modifica documenti tramite HTML utilizzando l'API Java",
    "description": "Integra le applicazioni Java con l'editor HTML per manipolare i documenti e riconvertirli nel formato originale."
  },
  "Submenu": {
    "middle": {
      "button_overview": {
        "text": "Panoramica"
      },
      "button_features": {
        "text": "Caratteristiche"
      },
      "button_support": {
        "text": "Supporto"
      },
      "button_livedemo": {
        "text": "Dimostrazione dal vivo"
      },
      "button_pricing": {
        "text": "Prezzo"
      }
    }
  },
  "Overview": {
    "content": "L'API GroupDocs.Editor per Java consente la modifica dei documenti sotto forma di HTML. L'API supporta più formati di documento e può essere integrata con qualsiasi editor HTML esterno, opensource o a pagamento. L'API dell'editor elaborerà per caricare i documenti, convertirli in HTML, fornire HTML all'interfaccia utente esterna e quindi salvare l'HTML nel documento originale dopo la manipolazione. Può anche essere utilizzato per generare diversi Microsoft Word, fogli di calcolo Excel, file PowerPoint, formati OpenDocument, documenti XML e TXT.",
    "tab1": {
      "description": "Di seguito è riportata una panoramica di GroupDocs.Editor per Java",
      "title": "Manipola usando HTML",
      "content1": "Carica documento supportato",
      "content2": "Modifica contenuto utilizzando HTML",
      "content3": "Modifica stili correlati",
      "content4": "Converti in formato originale"
    },
    "tab2": {
      "description": "GroupDocs.Editor per Java supporta i seguenti [formati di file](https://docs.groupdocs.com/editor/java/supported-document-formats/)",
      "title": "Altre famiglie di formati",
      "content1": "Formati OpenDocument",
      "content2": "Formati di posta elettronica",
      "content3": "Formati web",
      "content4": "Formati di libri elettronici (e-Book)."
    },
    "tab3": {
      "description": "GroupDocs.Editor per Java supporta i seguenti sistemi operativi, framework e gestori di pacchetti",
      "title_os": "Sistemi operativi",
      "title_frameworks": "Framework supportati",
      "title_packman": "Costruisci strumento di automazione",
      "title_devenv": "Ambienti di sviluppo"
    }
  },
  "Features": {
    "title": "GroupDocs.Editor per funzionalità Java",
    "feature_loop": {
      "1": "Facile integrazione dell'editor HTML",
      "2": "Conversione del documento in HTML DOM",
      "3": "Estrai contenuto HTML da Document Stream",
      "4": "Carica, modifica e salva i formati di file Word, Excel e PowerPoint",
      "5": "Recupera l'HTML insieme agli elementi incorporati",
      "6": "Importa, visualizza e modifica documenti XML",
      "7": "Bypassa il contenuto HTML e salva le risorse incorporate",
      "8": "Visualizza, modifica e salva documenti di elaborazione testi in modalità pagina",
      "9": "Ottieni il contenuto del tag corpo HTML dal file",
      "10": "Estrai il contenuto CSS del file HTML",
      "11": "Usa il contenuto della stringa per ottenere DOM HTML e converti in file",
      "12": "Converti HTML DOM con elementi incorporati",
      "13": "Converti file di più formati in HTML per la modifica",
      "14": "Ottieni meta-informazioni dei documenti di input senza modifica",
      "15": "Salva i documenti modificati in formato file di testo normale",
      "16": "Precisione di conversione",
      "17": "Applica password al documento di output",
      "18": "Database (DB) Agnostico",
      "19": "Interfaccia utente (UI) Agnostica",
      "20": "Supporta le licenze a consumo"
    },
    "more_features_loop": {
      "title1": "Converti accuratamente da e verso HTML DOM",
      "content1": "L'utilizzo di GroupDocs.Editor per Java consente di creare applicazioni in Java che caricano un documento di formato file supportato per convertirlo in HTML Document Object Model (DOM) insieme ai suoi elementi associati, ad esempio CSS. Inoltre, la nostra API Java Editor ti consente di modificare l'HTML in qualsiasi editor HTML popolare. Dopo aver apportato le modifiche richieste, GroupDocs.Editor per Java ti aiuta a convertire questo HTML risultante nel suo formato di file originale.",
      "title2": "Carica e recupera elementi associati",
      "content2": "GroupDocs.Editor per l'API Java ti consente di recuperare gli elementi associati da documenti di formati supportati, come immagini, CSS, caratteri e altro. Quindi puoi caricare questi elementi associati recuperati, attraversarli e salvarli separatamente dal file HTML finale e avere un output ben gestito."
    }
  },
  "Solutions": {
    "title": "GroupDocs.Editor offre API di modifica dei documenti per altri ambienti di sviluppo popolari"
  }
}