{
  "head": {
    "title": "C# .NET Document Editor API | Redigeerige Word Excel PowerPointi veebi XML-i HTML-i abil",
    "description": "C# .NET-i dokumendiredaktori API, et laadida Microsoft Wordi, Exceli, PowerPointi, PDF-i, XML-i, veebi- ja tekstifailivormingud HTML-i, töödelda ja teisendada tagasi algvormingusse."
  },
  "header": {
    "title": ".NET API dokumentide redigeerimiseks HTML-i abil",
    "description": "Arendage .NET-rakendusi, et integreerida HTML-redaktoriga, tuua toetatud dokumenti, redigeerida ja teisendada algvormingusse."
  },
  "Submenu": {
    "middle": {
      "button_overview": {
        "text": "Ülevaade"
      },
      "button_features": {
        "text": "Funktsioonid"
      },
      "button_support": {
        "text": "Toetus"
      },
      "button_livedemo": {
        "text": "Live demo"
      },
      "button_pricing": {
        "text": "Hinnakujundus"
      }
    }
  },
  "Overview": {
    "content": "GroupDocs.Editor for .NET API aitab teil luua lihtsaid ja hõlpsasti kasutatavaid C#-, ASP.NET-i ja muid .NET-i rakendusi, mis integreeruvad hõlpsasti populaarsete HTML-i redigeerijatega (nii avatud lähtekoodiga kui ka tasuliste) dokumentide teisendamiseks, redigeerimiseks ja manipuleerimiseks. populaarsed failivormingud. Meie .NET Editor API võimaldab laadida dokumenti, teisendada selle HTML-iks, lükata HTML-i välisesse HTML-redaktorisse ja kui manipuleerimine on tehtud, salvestab HTML-i algsesse failivormingusse. Samuti saate mis tahes dokumendile lisatud ressursse eraldi tuua. See töötab igasuguste dokumentidega, näiteks Microsoft Wordi, Exceli, PowerPointi, PDF-i, XPS-i, OpenDocumenti, teksti-, veebi-, e-posti, e-raamatu ja muude dokumentidega.",
    "tab1": {
      "description": "Järgmine on .NET-i GroupDocs.Editori ülevaade",
      "title": "Manipuleerimine HTML-i abil",
      "content1": "Laadige toetatud dokument",
      "content2": "Muutke sisu HTML-i abil",
      "content3": "Redigeeri seotud stiile",
      "content4": "Teisendage originaalvormingusse"
    },
    "tab2": {
      "description": "GroupDocs.Editor for .NET toetab järgmisi [failivorminguid](https://docs.groupdocs.com/editor/java/supported-document-formats/)",
      "title": "Muud vormingupered",
      "content1": "OpenDocumenti vormingud",
      "content2": "Fikseeritud paigutusega vormingud",
      "content3": "Veebivormingud",
      "content4": "Elektrooniliste raamatute (e-raamatute) formaadid"
    },
    "tab3": {
      "description": "GroupDocs.Editor for .NET toetab järgmisi operatsioonisüsteeme, raamistikke ja paketihaldureid",
      "title_os": "Operatsioonisüsteemid",
      "title_frameworks": "Toetatud raamistikud",
      "title_packman": "Paketihaldurid",
      "title_devenv": "Arenduskeskkonnad"
    }
  },
  "Features": {
    "title": "GroupDocs.Editor .NET-i funktsioonide jaoks",
    "feature_loop": {
      "1": "Lihtne integreerimine mis tahes HTML-redaktoriga",
      "2": "Teisendage dokument HTML DOM-iks",
      "3": "Tõmba HTML-sisu Document Streamist",
      "4": "Hankige HTML-sisu ja selle manustatud ressursse",
      "5": "Hankige dokumendist HTML-kehasildi sisu",
      "6": "Hankige HTML-dokumendi CSS-laaditabelid",
      "7": "Läbige HTML-i sisu ja salvestage selle ressursid",
      "8": "Tõmmake HTML DOM-i stringi sisust ja teisendage dokumendiks",
      "9": "HTML DOM koos ressursside teisendamisega",
      "10": "Redigeerige erinevas vormingus dokumente HTML-is",
      "11": "Täpne konversioon",
      "12": "Rakendage tulemuseks olevale dokumendile lugemis- ja/või kirjutamiskaitse",
      "13": "Leheküljeldage tekstitöötlusdokumente ja redigeerige neid mis tahes WYSIWYG-redaktorites",
      "14": "Andmebaas (DB) ja kasutajaliides (UI) Agnostic",
      "15": "Võimsad XML-i töötlemise funktsioonid",
      "16": "Sisenddokumentidest OTF-i (avatud tüüpi fondide) toomine ja lõppdokumenti eksportimine",
      "17": "Töötlege raster- ja vektorkujutisi sisemiselt toetatud sisenddokumendi vormingutes",
      "18": "Sisestage redigeeritud töölehe sisu algsesse arvutustabelisse soovitud kohta",
      "19": "Redigeerige esitlusi ja sisestage need saadud arvutustabelisse",
      "20": "Manustage salvestamise ajal fonte tulemuseks olevasse tekstitöötlusdokumenti"
    },
    "more_features_loop": {
      "title1": "Täpne teisendamine HTML DOM-i ja sealt välja",
      "content1": "GroupDocs.Editor for .NET API võimaldab teie .NET-i rakendustel tõmmata toetatud vormingus dokumenti ja teisendada see HTML-i dokumendiobjektimudeliks (DOM) koos manustatud ressursside (nt CSS) eraldamisega. Seejärel saate oma lemmik-HTML-redaktoriga HTML-i muudatusi teha. Kui olete redigeerimisega lõpetanud, võimaldab GroupDocs.Editor for .NET API teil selle HTML DOM-i täpselt algfailiks teisendada.",
      "title2": "Laadige ja ekstraheerige väliseid ressursse",
      "content2": "GroupDocs.Editor for .NET API on võimeline tõmbama toetatud dokumentidele lisatud väliseid ressursse, nagu pildid, fondid, CSS ja palju muud. Seejärel saab toodud ressursse laadida, läbida ja salvestada saadud HTML-dokumendist eraldi. See annab teile hõlpsamini hallatava väljundi.",
      "title3": "Rakendage tekstiefekte tekstitöötluse failivormingutes",
      "content3": "GroupDocsi dokumendiredaktori API võimaldab toetatud Microsoft Wordi dokumenditöötlusvormingutega töötades lisada keerukaid tekstiefekte (vari, 3D-efekt, piirjoon, sära, graveerimine, reljeef). See funktsioon on automaatselt sisse lülitatud, mida saab jälgida selliste tekstiefektidega dokumendi töötlemisel.",
      "title4": "Võimsad XML-i manipuleerimise funktsioonid",
      "content4-1": "NET API jaoks mõeldud GroupDocs.Editori abil saate avada, vaadata ja redigeerida XML-dokumente. Meie redigeerimise API pakub erilist tuge ja tuvastamist XML-märgenditele, atribuutidele koos nende väärtustega, XML-deklaratsioonidele, CDATA-osadele, DOCTYPE-i definitsioonidele ja muudele XML-spetsiifilistele olemitele. Saate kohandada fondi ja värvi sätteid iga XML-struktuuri eraldiseisva olemi jaoks.",
      "content4-2": "Funktsioon XML Converter on piisavalt nutikas, et näidata XML-failis olevaid vigu ja kuidas neid parandada. URI ja meilituvastusmehhanism skannib XML-i atribuute ning esindab A-märgendi sees tuvastatud URI-sid ja meiliaadresse linkidena, et neid saaks redigeerida lingina, mitte tulemuseks olevas HTML-failis tekstina."
    }
  },
  "Solutions": {
    "title": "GroupDocs.Editor pakub dokumentide redigeerimise API-sid teistele populaarsetele arenduskeskkondadele"
  }
}