{
  "head": {
    "title": "جاوا دستاویز ایڈیٹر API | HTML کا استعمال کرتے ہوئے Word Web XML ٹیکسٹ فائلوں میں ترمیم کریں۔",
    "description": "جاوا کے لیے دستاویز ایڈیٹر API۔ مائیکروسافٹ ورڈ، ایکس ایم ایل، ویب اور ٹیکسٹ فائلوں کو ایچ ٹی ایم ایل میں لوڈ کریں اور ہیرا پھیری کے بعد اصل فارمیٹ میں تبدیل کریں۔"
  },
  "header": {
    "title": "جاوا API کا استعمال کرتے ہوئے HTML کے ذریعے دستاویزات میں ترمیم کریں۔",
    "description": "جاوا ایپلی کیشنز کو HTML ایڈیٹر کے ساتھ انٹیگریٹ کریں تاکہ دستاویزات میں ہیرا پھیری اور اصل فارمیٹ میں تبدیل ہو سکے۔"
  },
  "Submenu": {
    "middle": {
      "button_overview": {
        "text": "جائزہ"
      },
      "button_features": {
        "text": "خصوصیات"
      },
      "button_support": {
        "text": "حمایت"
      },
      "button_livedemo": {
        "text": "لائیو ڈیمو"
      },
      "button_pricing": {
        "text": "قیمتوں کا تعین"
      }
    }
  },
  "Overview": {
    "content": "جاوا API کے لیے GroupDocs.Editor HTML کی شکل میں دستاویز میں ترمیم کو قابل بناتا ہے۔ API متعدد دستاویز فارمیٹس کو سپورٹ کرتا ہے اور اسے کسی بھی بیرونی، اوپن سورس یا ادا شدہ HTML ایڈیٹر کے ساتھ مربوط کیا جا سکتا ہے۔ ایڈیٹر API دستاویزات کو لوڈ کرنے، اسے HTML میں تبدیل کرنے، بیرونی UI کو HTML فراہم کرنے اور پھر ہیرا پھیری کے بعد HTML کو اصل دستاویز میں محفوظ کرنے کے لیے کارروائی کرے گا۔ اسے مختلف مائیکروسافٹ ورڈ، ایکسل اسپریڈ شیٹس، پاورپوائنٹ فائلز، اوپن ڈاکیومنٹ فارمیٹس، XML اور TXT دستاویزات بنانے کے لیے بھی استعمال کیا جا سکتا ہے۔",
    "tab1": {
      "description": "ذیل میں جاوا کے لیے GroupDocs.Editor کا ایک جائزہ ہے۔",
      "title": "HTML کا استعمال کرتے ہوئے ہیرا پھیری کریں۔",
      "content1": "لوڈ سپورٹڈ دستاویز",
      "content2": "HTML کا استعمال کرتے ہوئے مواد میں ترمیم کریں۔",
      "content3": "متعلقہ طرزوں میں ترمیم کریں۔",
      "content4": "اصل شکل میں تبدیل کریں۔"
    },
    "tab2": {
      "description": "جاوا کے لیے GroupDocs.Editor مندرجہ ذیل [فائل فارمیٹس](https://docs.groupdocs.com/editor/java/supported-document-formats/) کی حمایت کرتا ہے",
      "title": "دیگر فارمیٹ فیملیز",
      "content1": "اوپن دستاویز فارمیٹس",
      "content2": "ای میل فارمیٹس",
      "content3": "ویب فارمیٹس",
      "content4": "الیکٹرانک بک (ای بک) فارمیٹس"
    },
    "tab3": {
      "description": "جاوا کے لیے GroupDocs.Editor مندرجہ ذیل آپریٹنگ سسٹمز، فریم ورکس اور پیکیج مینیجرز کو سپورٹ کرتا ہے۔",
      "title_os": "آپریٹنگ سسٹمز",
      "title_frameworks": "تعاون یافتہ فریم ورک",
      "title_packman": "آٹومیشن ٹول بنائیں",
      "title_devenv": "ترقیاتی ماحول"
    }
  },
  "Features": {
    "title": "جاوا کی خصوصیات کے لیے GroupDocs.Editor",
    "feature_loop": {
      "1": "آسان HTML ایڈیٹر انٹیگریشن",
      "2": "HTML DOM میں دستاویز کی تبدیلی",
      "3": "دستاویز سٹریم سے HTML مواد نکالیں۔",
      "4": "ورڈ، ایکسل اور پاورپوائنٹ فائل فارمیٹس لوڈ، ترمیم اور محفوظ کریں۔",
      "5": "ایمبیڈڈ عناصر کے ساتھ ایچ ٹی ایم ایل حاصل کریں۔",
      "6": "XML دستاویزات درآمد کریں، دیکھیں اور ان میں ترمیم کریں۔",
      "7": "HTML مواد کو بائی پاس کریں اور ایمبیڈڈ وسائل کو محفوظ کریں۔",
      "8": "ورڈ پروسیسنگ دستاویزات کو صفحہ بندی موڈ میں دیکھیں، ان میں ترمیم کریں اور محفوظ کریں۔",
      "9": "فائل سے HTML باڈی ٹیگ کا مواد حاصل کریں۔",
      "10": "HTML فائل کا CSS مواد نکالیں۔",
      "11": "HTML DOM حاصل کرنے اور فائل میں تبدیل کرنے کے لیے String Content کا استعمال کریں۔",
      "12": "HTML DOM کو ایمبیڈڈ عناصر کے ساتھ تبدیل کریں۔",
      "13": "ایک سے زیادہ فارمیٹس کی فائلوں کو HTML میں ترمیم کے لیے تبدیل کریں۔",
      "14": "بغیر ترمیم کے ان پٹ دستاویزات کی میٹا معلومات حاصل کریں۔",
      "15": "ترمیم شدہ دستاویزات کو سادہ ٹیکسٹ فائل فارمیٹ میں محفوظ کریں۔",
      "16": "تبادلوں کی درستگی",
      "17": "آؤٹ پٹ دستاویز پر پاس ورڈ لگائیں۔",
      "18": "ڈیٹا بیس (DB) اگنوسٹک",
      "19": "یوزر انٹرفیس (UI) اگنوسٹک",
      "20": "میٹرڈ لائسنسنگ کی حمایت کرتا ہے۔"
    },
    "more_features_loop": {
      "title1": "HTML DOM میں اور اس سے درست طریقے سے تبدیل کریں۔",
      "content1": "جاوا کے لیے GroupDocs.Editor کا استعمال آپ کو جاوا میں ایسی ایپلی کیشنز بنانے کی اجازت دیتا ہے جو معاون فائل فارمیٹ کی ایک دستاویز لوڈ کرتی ہے تاکہ اسے اس کے متعلقہ عناصر کے ساتھ HTML دستاویز آبجیکٹ ماڈل (DOM) میں تبدیل کیا جا سکے، جیسے CSS۔ مزید برآں، ہمارا ایڈیٹر Java API آپ کو کسی بھی مشہور HTML ایڈیٹرز میں HTML میں ترمیم کرنے کی اجازت دیتا ہے۔ آپ کی مطلوبہ ترمیم کے بعد، جاوا کے لیے GroupDocs.Editor آپ کو اس نتیجے میں آنے والے HTML کو اس کے اصل فائل فارمیٹ میں تبدیل کرنے میں مدد کرتا ہے۔",
      "title2": "ایسوسی ایٹ عناصر کو لوڈ اور بازیافت کریں۔",
      "content2": "جاوا API کے لیے GroupDocs.Editor آپ کو معاون فارمیٹس کی دستاویزات، جیسے کہ تصاویر، CSS، فونٹس وغیرہ سے متعلقہ عناصر کو حاصل کرنے کے قابل بناتا ہے۔ اس کے بعد آپ ان بازیافت شدہ متعلقہ عناصر کو لوڈ کر سکتے ہیں، ان کو عبور کر سکتے ہیں اور حتمی HTML فائل سے علیحدہ طور پر محفوظ کر سکتے ہیں، اور اچھی طرح سے منظم آؤٹ پٹ حاصل کر سکتے ہیں۔"
    }
  },
  "Solutions": {
    "title": "GroupDocs.Editor دیگر مقبول ترقیاتی ماحول کے لیے دستاویز میں ترمیم کرنے والے APIs پیش کرتا ہے۔"
  }
}