{
  "head": {
    "title": "C# .NET Document Editor API | Word Excel PowerPoint Web XML-ის რედაქტირება HTML-ის გამოყენებით",
    "description": "C# .NET დოკუმენტების რედაქტორის API, რომ ჩატვირთოს Microsoft Word, Excel, PowerPoint, PDF, XML, ვებ და ტექსტური ფაილის ფორმატები HTML-ში, მანიპულირება და ორიგინალ ფორმატში გადაყვანა."
  },
  "header": {
    "title": ".NET API დოკუმენტების რედაქტირებისთვის HTML-ის გამოყენებით",
    "description": "შექმენით .NET აპლიკაციები HTML რედაქტორთან ინტეგრირებისთვის, მხარდაჭერილი დოკუმენტის მისაღებად, რედაქტირებისთვის და ორიგინალ ფორმატში გადასაყვანად."
  },
  "Submenu": {
    "middle": {
      "button_overview": {
        "text": "მიმოხილვა"
      },
      "button_features": {
        "text": "მახასიათებლები"
      },
      "button_support": {
        "text": "მხარდაჭერა"
      },
      "button_livedemo": {
        "text": "ცოცხალი დემო"
      },
      "button_pricing": {
        "text": "ფასი"
      }
    }
  },
  "Overview": {
    "content": "GroupDocs.Editor .NET API-სთვის დაგეხმარებათ შექმნათ მარტივი და ადვილად გამოსაყენებელი C#, ASP.NET და სხვა .NET აპლიკაციები, რომლებიც ადვილად ინტეგრირდება პოპულარულ HTML რედაქტორებთან (როგორც ღია, ასევე ფასიანი) დოკუმენტების კონვერტაციისთვის, რედაქტირებისთვის და მანიპულირებისთვის. პოპულარული ფაილის ფორმატები. ჩვენი .NET Editor API გაძლევთ საშუალებას ატვირთოთ დოკუმენტი, გადაიყვანოთ იგი HTML-ში, გადაიყვანოთ HTML გარე HTML რედაქტორზე და მანიპულირების დასრულების შემდეგ, შეინახოთ HTML ფაილის ორიგინალ ფორმატში. თქვენ ასევე შეგიძლიათ ცალ-ცალკე მოიტანოთ ნებისმიერ დოკუმენტთან დართული რესურსები. ის მუშაობს ყველა სახის დოკუმენტთან, როგორიცაა Microsoft Word, Excel, PowerPoint, PDF, XPS, OpenDocument, Text, Web, Email, e-Book და სხვა.",
    "tab1": {
      "description": "ქვემოთ მოცემულია GroupDocs.Editor-ის მიმოხილვა .NET-ისთვის",
      "title": "მანიპულირება HTML-ის გამოყენებით",
      "content1": "მხარდაჭერილი დოკუმენტის ჩატვირთვა",
      "content2": "კონტენტის რედაქტირება HTML-ის გამოყენებით",
      "content3": "დაკავშირებული სტილების რედაქტირება",
      "content4": "გადაიყვანეთ ორიგინალ ფორმატში"
    },
    "tab2": {
      "description": "GroupDocs.Editor .NET-ისთვის მხარს უჭერს შემდეგ [ფაილის ფორმატებს](https://docs.groupdocs.com/editor/java/supported-document-formats/)",
      "title": "სხვა ფორმატის ოჯახები",
      "content1": "OpenDocument ფორმატები",
      "content2": "ფიქსირებული განლაგების ფორმატები",
      "content3": "ვებ ფორმატები",
      "content4": "ელექტრონული წიგნის (e-Book) ფორმატები"
    },
    "tab3": {
      "description": "GroupDocs.Editor for .NET მხარს უჭერს შემდეგი ოპერაციული სისტემების, Frameworks და პაკეტის მენეჯერებს",
      "title_os": "Ოპერატიული სისტემა",
      "title_frameworks": "მხარდაჭერილი ჩარჩოები",
      "title_packman": "პაკეტის მენეჯერები",
      "title_devenv": "განვითარების გარემო"
    }
  },
  "Features": {
    "title": "GroupDocs.Editor .NET ფუნქციებისთვის",
    "feature_loop": {
      "1": "მარტივი ინტეგრაცია ნებისმიერ HTML რედაქტორთან",
      "2": "გადაიყვანეთ დოკუმენტი HTML DOM-ში",
      "3": "მიიღეთ HTML კონტენტი Document Stream-იდან",
      "4": "მიიღეთ HTML კონტენტი და მისი ჩაშენებული რესურსები",
      "5": "მიიღეთ HTML Body Tag-ის შინაარსი დოკუმენტიდან",
      "6": "მიიღეთ HTML დოკუმენტის CSS სტილის ფურცლები",
      "7": "გადაკვეთეთ HTML კონტენტი და შეინახეთ მისი რესურსები",
      "8": "მიიღეთ HTML DOM სტრიქონი კონტენტიდან და გადააკეთეთ დოკუმენტად",
      "9": "HTML DOM რესურსების კონვერტაციასთან ერთად",
      "10": "სხვადასხვა ფორმატის დოკუმენტების რედაქტირება HTML-ში",
      "11": "ზუსტი კონვერტაცია",
      "12": "გამოიყენეთ წაკითხვის და/ან ჩაწერის დაცვა შედეგის დოკუმენტზე",
      "13": "დაალაგეთ სიტყვების დამუშავების დოკუმენტები და დაარედაქტირეთ ნებისმიერ WYSIWYG რედაქტორში",
      "14": "მონაცემთა ბაზა (DB) და მომხმარებლის ინტერფეისი (UI) Agnostic",
      "15": "ძლიერი XML დამუშავების ფუნქციები",
      "16": "მიიღეთ OTF (ღია ტიპის შრიფტები) შეყვანის დოკუმენტებიდან და ექსპორტი შედეგიან დოკუმენტში",
      "17": "დაამუშავეთ რასტერული და ვექტორული გამოსახულებები შინაგანად მხარდაჭერილი შეყვანის დოკუმენტის ფორმატებში",
      "18": "რედაქტირებული სამუშაო ფურცლის შიგთავსის ჩასმა ორიგინალ ელცხრილში სასურველ პოზიციაზე",
      "19": "დაარედაქტირეთ სლაიდები და ჩადეთ ისინი შედეგ ელცხრილში",
      "20": "ჩადეთ შრიფტები შედეგზე დამუშავებულ დოკუმენტში შენახვისას"
    },
    "more_features_loop": {
      "title1": "ზუსტი კონვერტაცია HTML DOM-დან და",
      "content1": "GroupDocs.Editor .NET API-სთვის საშუალებას აძლევს თქვენს .NET აპლიკაციებს მიიღონ მხარდაჭერილი ფორმატის დოკუმენტი და გადაიყვანონ იგი HTML დოკუმენტის ობიექტის მოდელად (DOM) თანდართული რესურსების ამოღებასთან ერთად, როგორიცაა CSS. ამის შემდეგ შეგიძლიათ განახორციელოთ ცვლილებები HTML-ში თქვენი საყვარელი HTML რედაქტორის გამოყენებით. მას შემდეგ რაც დაასრულებთ რედაქტირებას, GroupDocs.Editor .NET API-სთვის საშუალებას გაძლევთ ზუსტად დააბრუნოთ ეს HTML DOM თავდაპირველ ფაილში.",
      "title2": "გარე რესურსების ჩატვირთვა და ამოღება",
      "content2": "GroupDocs.Editor .NET API-სთვის შეუძლია მიიღოს მხარდაჭერილ დოკუმენტებზე მიმაგრებული გარე რესურსები, როგორიცაა სურათები, შრიფტები, CSS და სხვა. მიღებული რესურსების ჩატვირთვა, გავლა და შენახვა შესაძლებელია მიღებული HTML დოკუმენტისგან განცალკევებით. ეს გაძლევთ უფრო ადვილად მართულ გამომავალს.",
      "title3": "ტექსტის ეფექტების გამოყენება Word Processing ფაილის ფორმატებში",
      "content3": "GroupDocs დოკუმენტის რედაქტორის API საშუალებას გაძლევთ დაამატოთ რთული ტექსტური ეფექტები (ჩრდილი, 3D ეფექტი, მონახაზი, ბზინვარება, გრავირება, რელიეფი) Microsoft Word-ის მხარდაჭერილ დოკუმენტების დამუშავების ფორმატებთან მუშაობისას. ეს ფუნქცია ავტომატურად ჩართულია, რომლის დაკვირვება შესაძლებელია ასეთი ტექსტური ეფექტების მქონე დოკუმენტის დამუშავებისას.",
      "title4": "ძლიერი XML მანიპულირების ფუნქციები",
      "content4-1": ".NET API-სთვის GroupDocs.Editor-ის გამოყენებით შეგიძლიათ გახსნათ, ნახოთ და დაარედაქტიროთ XML დოკუმენტები. ჩვენი რედაქტირების API გთავაზობთ სპეციალურ მხარდაჭერას და ამოცნობას XML ტეგების, ატრიბუტების მნიშვნელობებთან ერთად, XML დეკლარაციებს, CDATA სექციებს, DOCTYPE განმარტებებს და სხვა XML სპეციფიკურ ერთეულებს. თქვენ შეგიძლიათ დააკონფიგურიროთ შრიფტისა და ფერის პარამეტრები XML სტრუქტურის ყველა ცალკეული ერთეულისთვის.",
      "content4-2": "XML Converter ფუნქცია საკმარისად ჭკვიანია იმისათვის, რომ აჩვენოს შეცდომები XML ფაილში და როგორ გამოსწორდეს ისინი. URI და ელ.ფოსტის ამომცნობი მექანიზმი სკანირებს XML ატრიბუტებს და წარმოადგენს აღმოჩენილ URI-ებს და ელ.ფოსტის მისამართებს A ტეგის შიგნით, როგორც ბმულებს, რათა მათი რედაქტირება შესაძლებელია როგორც ბმულის სახით, და არა როგორც ტექსტის შედეგად მიღებული HTML ფაილი."
    }
  },
  "Solutions": {
    "title": "GroupDocs.Editor გთავაზობთ დოკუმენტების რედაქტირების API-ებს განვითარების სხვა პოპულარულ გარემოში"
  }
}