{
  "head": {
    "title": "C# .NET Document Editor API | Urejanje Word Excel PowerPoint Web XML z uporabo HTML",
    "description": "API urejevalnika dokumentov C# .NET za nalaganje formatov Microsoft Word, Excel, PowerPoint, PDF, XML, spletnih in besedilnih datotek v HTML, obdelavo in pretvorbo nazaj v izvirno obliko."
  },
  "header": {
    "title": ".NET API za urejanje dokumentov z uporabo HTML",
    "description": "Razvijte aplikacije .NET za integracijo z urejevalnikom HTML, pridobivanje podprtih dokumentov, urejanje in pretvorbo v izvirno obliko."
  },
  "Submenu": {
    "middle": {
      "button_overview": {
        "text": "Pregled"
      },
      "button_features": {
        "text": "Lastnosti"
      },
      "button_support": {
        "text": "Podpora"
      },
      "button_livedemo": {
        "text": "Demo v živo"
      },
      "button_pricing": {
        "text": "Cenitev"
      }
    }
  },
  "Overview": {
    "content": "GroupDocs.Editor for .NET API vam pomaga zgraditi preproste in za uporabo preproste aplikacije C#, ASP.NET in druge .NET, ki se zlahka integrirajo s priljubljenimi urejevalniki HTML (tako odprtokodnimi kot plačljivimi) za pretvorbo, urejanje in obdelavo dokumentov priljubljeni formati datotek. Naš API za urejevalnik .NET vam omogoča nalaganje dokumenta, njegovo pretvorbo v HTML, potiskanje HTML v zunanji urejevalnik HTML in ko je manipulacija opravljena, shranite HTML v prvotno obliko datoteke. Prav tako lahko ločeno pridobite vire, priložene kateremu koli dokumentu. Deluje z vsemi vrstami dokumentov, kot je dokument za Microsoft Word, Excel, PowerPoint, PDF, XPS, OpenDocument, besedilo, splet, e-pošto, e-knjigo in več.",
    "tab1": {
      "description": "Sledi pregled GroupDocs.Editor za .NET",
      "title": "Manipulirajte z uporabo HTML",
      "content1": "Naloži podprt dokument",
      "content2": "Uredite vsebino z uporabo HTML",
      "content3": "Uredi povezane sloge",
      "content4": "Pretvori v izvirno obliko"
    },
    "tab2": {
      "description": "GroupDocs.Editor za .NET podpira naslednje [datotečne oblike](https://docs.groupdocs.com/editor/java/supported-document-formats/)",
      "title": "Družine drugih formatov",
      "content1": "Formati OpenDocument",
      "content2": "Formati s fiksno postavitvijo",
      "content3": "Spletni formati",
      "content4": "Formati elektronskih knjig (e-Book)."
    },
    "tab3": {
      "description": "GroupDocs.Editor za .NET podpira naslednje operacijske sisteme, ogrodja in upravitelje paketov",
      "title_os": "Operacijski sistemi",
      "title_frameworks": "Podprta ogrodja",
      "title_packman": "Upravitelji paketov",
      "title_devenv": "Razvojna okolja"
    }
  },
  "Features": {
    "title": "GroupDocs.Editor za funkcije .NET",
    "feature_loop": {
      "1": "Enostavna integracija s katerim koli urejevalnikom HTML",
      "2": "Pretvori dokument v HTML DOM",
      "3": "Pridobi vsebino HTML iz toka dokumentov",
      "4": "Pridobite vsebino HTML in njene vdelane vire",
      "5": "Pridobite vsebino oznake telesa HTML iz dokumenta",
      "6": "Pridobite tabele slogov CSS za dokument HTML",
      "7": "Preglejte vsebino HTML in shranite njene vire",
      "8": "Pridobi HTML DOM iz vsebine niza in pretvori v dokument",
      "9": "HTML DOM skupaj s pretvorbo virov",
      "10": "Uredite dokumente različnih formatov v HTML",
      "11": "Natančna pretvorba",
      "12": "Za nastali dokument uporabite zaščito pred branjem in/ali pisanjem",
      "13": "Paginirajte dokumente za obdelavo besedila in jih urejajte v katerem koli urejevalniku WYSIWYG",
      "14": "Zbirka podatkov (DB) in uporabniški vmesnik (UI) Agnostic",
      "15": "Zmogljive funkcije za obdelavo XML",
      "16": "Pridobite OTF (open type Fonts) iz vhodnih dokumentov in izvozite v nastali dokument",
      "17": "Interno obdelajte rastrske in vektorske slike znotraj podprtih formatov vhodnih dokumentov",
      "18": "Vstavite vsebino urejenega delovnega lista v izvirno preglednico na želenem mestu",
      "19": "Uredite diapozitive in jih vstavite v nastalo preglednico",
      "20": "Med shranjevanjem vdelajte pisave v nastali dokument za obdelavo besedila"
    },
    "more_features_loop": {
      "title1": "Natančna pretvorba v in iz HTML DOM",
      "content1": "GroupDocs.Editor for .NET API omogoča vašim aplikacijam .NET, da pridobijo dokument podprtega formata in ga pretvorijo v HTML Document Object Model (DOM) skupaj z ekstrakcijo priloženih virov, kot je CSS. Nato lahko spremenite HTML s svojim priljubljenim urejevalnikom HTML. Ko končate z urejanjem, vam GroupDocs.Editor for .NET API omogoča natančno pretvorbo tega HTML DOM nazaj v izvirno datoteko.",
      "title2": "Nalaganje in ekstrahiranje zunanjih virov",
      "content2": "GroupDocs.Editor for .NET API je sposoben pridobiti zunanje vire, priložene podprtim dokumentom, kot so slike, pisave, CSS in drugo. Pridobljene vire je nato mogoče naložiti, prečkati in shraniti ločeno od nastalega dokumenta HTML. To vam omogoča lažje upravljanje izhoda.",
      "title3": "Uporabite besedilne učinke v formatih datotek za obdelavo besedila",
      "content3": "API urejevalnika dokumentov GroupDocs omogoča dodajanje zapletenih besedilnih učinkov (senca, 3D učinek, oris, sijaj, graviranje, relief) med delom s podprtimi formati za obdelavo dokumentov Microsoft Word. Ta funkcija je samodejno omogočena, kar je mogoče opazovati, ko se obdeluje dokument s takšnimi besedilnimi učinki.",
      "title4": "Zmogljive funkcije za manipulacijo XML",
      "content4-1": "Z API-jem GroupDocs.Editor for .NET lahko odpirate, pregledujete in urejate dokumente XML. Naš API za urejanje ponuja posebno podporo in prepoznavanje oznak XML, atributov skupaj z njihovimi vrednostmi, deklaracij XML, razdelkov CDATA, definicij DOCTYPE in drugih entitet, specifičnih za XML. Nastavitve pisave in barve lahko prilagodite za vsako ločeno entiteto v strukturi XML.",
      "content4-2": "Funkcija XML Converter je dovolj pametna, da prikaže napake v datoteki XML in kako jih popraviti. Mehanizem URI in prepoznavalnika e-pošte pregleda atribute XML in predstavlja zaznane URI-je in e-poštne naslove znotraj oznake A kot povezave, tako da jih je mogoče urejati kot povezavo in ne kot besedilo v nastali datoteki HTML."
    }
  },
  "Solutions": {
    "title": "GroupDocs.Editor ponuja API-je za urejanje dokumentov za druga priljubljena razvojna okolja"
  }
}