{
  "head": {
    "title": "Dokumentumszerkesztő megoldás | Premise API-kon és ingyenes alkalmazásokon",
    "description": "Dokumentumszerkesztés Microsoft Office-hoz, OpenDocument-hez, PDF-hez és más fájlformátumokhoz On Premise API-k használatával, vagy használja az Online Document Editor alkalmazást."
  },
  "header": {
    "title": "Dokumentumszerkesztési megoldás",
    "description": "Dokumentumszerkesztő a Microsoft Office, OpenOffice, PDF, HTML és más dokumentumfájlformátumok kezeléséhez."
  },
  "APIs": {
    "API_loop_high_code": {
      "title": "A GroupDocs.Editor High Code API-k közé tartozik",
      "label": "Az összes High Code API megtekintése",
      "API_product_net": {
        "content": "On Premise .NET API, amely segít az alkalmazásnak dokumentumok megtekintésében, szerkesztésében, majd konvertálásában."
      },
      "API_product_java": {
        "content": "Dokumentumszerkesztő API Microsoft Office-hoz, OpenOffice-hoz, HTML-hez és más dokumentumokhoz, amelyeket Java alapú alkalmazásokban kezelhet."
      }
    },
    "API_loop_low_code": {
      "title": "A GroupDocs.Editor alacsony kódú API-jai közé tartozik",
      "label": "Az összes alacsony kódú API megtekintése",
      "Cloud_SDK_net": {
        "content": "Hatékony dokumentumformátum-szerkesztési funkciók hozzáadása a .NET-alkalmazásokhoz a Cloud SDK for .NET használatával. MS Office, web és XML dokumentumok szerkesztése."
      },
      "Cloud_SDK_java": {
        "content": "Fejlett dokumentumszerkesztő SDK Java alkalmazásokhoz az ipari szabványos dokumentumfájl-formátumok szerkesztéséhez bármely platformon, amely képes REST API-k hívására."
      }
    },
    "API_loop_no_code": {
      "title": "GroupDocs.Editor Nincsenek kódalkalmazások",
      "label": "Az összes kód nélküli alkalmazás megtekintése",
      "Total": {
        "content": "Webalapú ingyenes online alkalmazás az Office és az OpenOffice népszerű fájlformátumainak szerkesztéséhez."
      },
      "DOCX": {
        "content": "Ingyenes szerkesztő alkalmazás Microsoft Word dokumentumok online megtekintéséhez és szerkesztéséhez."
      },
      "PDF": {
        "content": "PDF és XPS dokumentumok megtekintéséhez vagy szerkesztéséhez használhat bármilyen eszközt és böngészőt."
      }
    }
  }
}