{
  "head": {
    "title": "C# .NET Document Editor API | Edit Word Excel PowerPoint Web XML menggunakan HTML",
    "description": "C# .NET document editor API untuk memuat format file Microsoft Word, Excel, PowerPoint, PDF, XML, web dan teks ke dalam HTML, memanipulasi & mengonversi kembali ke format aslinya."
  },
  "header": {
    "title": ".NET API untuk Mengedit Dokumen Menggunakan HTML",
    "description": "Kembangkan Aplikasi .NET, untuk Mengintegrasikan dengan Editor HTML, Ambil Dokumen yang Didukung, Edit dan Konversikan ke Format Asli."
  },
  "Submenu": {
    "middle": {
      "button_overview": {
        "text": "Ringkasan"
      },
      "button_features": {
        "text": "Fitur"
      },
      "button_support": {
        "text": "Mendukung"
      },
      "button_livedemo": {
        "text": "Demo Langsung"
      },
      "button_pricing": {
        "text": "Harga"
      }
    }
  },
  "Overview": {
    "content": "GroupDocs.Editor untuk .NET API membantu Anda membuat C#, ASP.NET, dan aplikasi .NET lainnya yang sederhana dan mudah digunakan, yang siap berintegrasi dengan editor HTML populer (baik sumber terbuka & berbayar) untuk mengonversi, mengedit, dan memanipulasi dokumen format file populer. .NET Editor API kami memungkinkan Anda memuat dokumen, mengubahnya menjadi HTML, mendorong HTML ke Editor HTML eksternal, dan setelah manipulasi selesai, menyimpan HTML ke format file aslinya. Anda juga dapat mengambil sumber daya yang dilampirkan dengan dokumen apa pun secara terpisah. Ia bekerja dengan semua jenis dokumen, seperti untuk Microsoft Word, Excel, PowerPoint, PDF, XPS, OpenDocument, Teks, Web, Email, e-Book, dan lainnya.",
    "tab1": {
      "description": "Berikut ini adalah ikhtisar GroupDocs.Editor untuk .NET",
      "title": "Memanipulasi Menggunakan HTML",
      "content1": "Muat Dokumen yang Didukung",
      "content2": "Edit Konten menggunakan HTML",
      "content3": "Edit Gaya Terkait",
      "content4": "Konversikan ke Format Asli"
    },
    "tab2": {
      "description": "GroupDocs.Editor untuk .NET mendukung [format file] berikut (https://docs.groupdocs.com/editor/java/supported-document-formats/)",
      "title": "Keluarga format lain",
      "content1": "Format Dokumen Terbuka",
      "content2": "Format tata letak tetap",
      "content3": "Format web",
      "content4": "Format buku elektronik (e-Book)"
    },
    "tab3": {
      "description": "GroupDocs.Editor untuk .NET mendukung Sistem Operasi, Kerangka & Manajer Paket berikut",
      "title_os": "Sistem operasi",
      "title_frameworks": "Kerangka yang Didukung",
      "title_packman": "Manajer Paket",
      "title_devenv": "Lingkungan Pengembangan"
    }
  },
  "Features": {
    "title": "GroupDocs.Editor untuk .NET Fitur",
    "feature_loop": {
      "1": "Integrasi Mudah dengan editor HTML apa pun",
      "2": "Konversi Dokumen ke HTML DOM",
      "3": "Ambil Konten HTML dari Aliran Dokumen",
      "4": "Dapatkan Konten HTML & Sumber Daya Tertanamnya",
      "5": "Dapatkan Konten Tag Tubuh HTML dari Dokumen",
      "6": "Dapatkan stylesheet CSS dari Dokumen HTML",
      "7": "Lintasi Konten HTML dan Simpan Sumber Dayanya",
      "8": "Ambil DOM HTML dari Konten String & Konversikan ke Dokumen",
      "9": "HTML DOM bersama dengan Konversi Sumber Daya",
      "10": "Edit Dokumen Berbagai Format dalam HTML",
      "11": "Konversi Akurat",
      "12": "Terapkan Proteksi Baca dan/atau Tulis ke Dokumen yang Dihasilkan",
      "13": "Membuat Paginasi Dokumen Pemrosesan Kata dan Edit di Semua Editor WYSIWYG",
      "14": "Database (DB) & Antarmuka Pengguna (UI) Agnostik",
      "15": "Fitur Pemrosesan XML yang Kuat",
      "16": "Ambil OTF (Font Jenis Terbuka) dari Dokumen Masukan dan Ekspor ke Dokumen Hasil",
      "17": "Memproses Gambar Raster dan Vektor Secara Internal dalam Format Dokumen Masukan yang Didukung",
      "18": "Masukkan Isi Lembar Kerja yang Diedit ke dalam Spreadsheet Asli pada Posisi yang Diinginkan",
      "19": "Edit Slide dan masukkan ke dalam Spreadsheet yang dihasilkan",
      "20": "Sematkan Font di Dokumen Pemrosesan Kata yang Dihasilkan saat Menyimpan"
    },
    "more_features_loop": {
      "title1": "Konversi Akurat ke dan dari HTML DOM",
      "content1": "GroupDocs.Editor untuk .NET API memungkinkan aplikasi .NET Anda mengambil dokumen dengan format yang didukung dan mengonversinya menjadi Model Objek Dokumen HTML (DOM) bersama dengan ekstraksi sumber daya terlampir, seperti CSS. Anda kemudian dapat membuat modifikasi pada HTML menggunakan Editor HTML favorit Anda. Setelah Anda selesai mengedit, GroupDocs.Editor untuk .NET API memungkinkan Anda untuk secara akurat mengonversi DOM HTML ini kembali ke file asli.",
      "title2": "Muat & Ekstrak Sumber Daya Eksternal",
      "content2": "GroupDocs.Editor untuk .NET API mampu mengambil sumber daya eksternal yang dilampirkan ke dokumen yang didukung, seperti gambar, font, CSS, dan lainnya. Sumber daya yang diambil kemudian dapat dimuat, dilalui, dan disimpan secara terpisah dari dokumen HTML yang dihasilkan. Ini memberi Anda hasil yang lebih mudah dikelola.",
      "title3": "Terapkan Efek Teks dalam Format File Pemrosesan Kata",
      "content3": "API editor dokumen GroupDocs memungkinkan penambahan efek teks kompleks (Bayangan, efek 3D, Garis Besar, Cahaya, Ukiran, Emboss) saat bekerja dengan format pemrosesan dokumen Microsoft Word yang didukung. Fitur ini diaktifkan secara otomatis yang dapat diamati saat dokumen dengan efek teks tersebut diproses.",
      "title4": "Fitur Manipulasi XML yang Kuat",
      "content4-1": "Menggunakan GroupDocs.Editor untuk .NET API Anda dapat membuka, melihat, dan mengedit dokumen XML. API pengeditan kami menawarkan dukungan khusus dan pengenalan tag XML, atribut beserta nilainya, deklarasi XML, bagian CDATA, definisi DOCTYPE, dan entitas khusus XML lainnya. Anda dapat menyesuaikan pengaturan font dan warna untuk setiap entitas berbeda dalam struktur XML.",
      "content4-2": "Fitur XML Converter cukup pintar untuk menampilkan kesalahan dalam file XML dan cara memperbaikinya. Mekanisme URI dan pengenal email memindai atribut XML dan mewakili URI dan alamat email yang terdeteksi di dalam tag A sebagai tautan sehingga dapat diedit sebagai tautan, bukan sebagai teks dalam file HTML yang dihasilkan."
    }
  },
  "Solutions": {
    "title": "GroupDocs.Editor menawarkan API pengeditan dokumen untuk lingkungan pengembangan populer lainnya"
  }
}