{
  "head": {
    "title": "C# .NET Document Editor API | Word Excel PowerPoint Web XML bi HTML-ê biguherîne",
    "description": "Edîtorê belgeya C# .NET API-ya ku Microsoft Word, Excel, PowerPoint, PDF, XML, web û formatên pelê nivîsê di nav HTML-ê de bar dike, manîpule dike û vedigerîne forma orjînal."
  },
  "header": {
    "title": ".NET API ji bo Guherandina Belgeyên Bi HTML-ê",
    "description": "Serlêdanên .NET pêşve bibin, da ku bi Edîtorê HTML-ê re tevbigerin, Belgeya Piştgiriyê bistînin, Biguherînin û Biguherînin Forma Orjînal."
  },
  "Submenu": {
    "middle": {
      "button_overview": {
        "text": "Têgihiştinî"
      },
      "button_features": {
        "text": "Features"
      },
      "button_support": {
        "text": "Alîkarî"
      },
      "button_livedemo": {
        "text": "Demo Bijî"
      },
      "button_pricing": {
        "text": "Pricing"
      }
    }
  },
  "Overview": {
    "content": "GroupDocs.Editor ji bo .NET API ji we re dibe alîkar ku hûn bikar bînin C#, ASP.NET, û serîlêdanên din ên .NET yên sade û hêsan ên ku bi hêsanî bi edîtorên HTML-ê yên populer (hem çavkaniya vekirî û hem jî drav) re yek dibin da ku hûn belgeyên biguherînin, biguherînin û manîpule bikin. formatên pelan ên populer. API-ya meya Edîtorê .NET dihêle hûn belgeyê bar bikin, wê biguherînin HTML-ê, HTML-ê berbi Edîtorê HTML-ê yê derveyî vekêşînin, û gava ku manîpulasyon pêk hat, HTML-ê di forma pelê ya orjînal de hilîne. Her weha hûn dikarin çavkaniyên ku bi her belgeyê ve girêdayî ne veqetînin. Ew bi her cûre belgeyan re dixebite, wek mînak ji bo Microsoft Word, Excel, PowerPoint, PDF, XPS, OpenDocument, Text, Web, Email, e-Pirtûk û hêj bêtir.",
    "tab1": {
      "description": "Li jêr nihêrînek GroupDocs.Editor ji bo .NET heye",
      "title": "Bi karanîna HTML-ê manîpule bikin",
      "content1": "Belgeya Piştgiriya Barkirin",
      "content2": "Bi HTML-ê naverok biguherîne",
      "content3": "Biguherîne Şêweyên Têkildar",
      "content4": "Veguherînin Forma Orjînal"
    },
    "tab2": {
      "description": "GroupDocs.Editor ji bo .NET [formatên pelan] yên jêrîn piştgirî dike (https://docs.groupdocs.com/editor/java/supported-document-formats/)",
      "title": "Malbatên formatên din",
      "content1": "Formatên OpenDocument",
      "content2": "Formatên Fixed-layout",
      "content3": "Formatên Webê",
      "content4": "Formatên pirtûka elektronîkî (e-Pirtûk)."
    },
    "tab3": {
      "description": "GroupDocs.Editor ji bo .NET piştgirî dide Pergalên Xebatê, Çarçove û Rêvebirên Pakêtê yên jêrîn",
      "title_os": "Pergalên Xebatê",
      "title_frameworks": "Çarçoveyên Piştgirî",
      "title_packman": "Rêveberên Pakêtê",
      "title_devenv": "Jîngehên Pêşveçûn"
    }
  },
  "Features": {
    "title": "GroupDocs.Editor ji bo Taybetmendiyên .NET",
    "feature_loop": {
      "1": "Bi her edîtorek HTML re yekbûnek hêsan",
      "2": "Belgeyê veguherînin HTML DOM",
      "3": "Naveroka HTML-ê ji Document Stream bistînin",
      "4": "Naveroka HTML û Çavkaniyên wê yên Tevnekirî bistînin",
      "5": "Naveroka HTML Tag Body ji Belgeyê bistînin",
      "6": "Şêwazên CSS-ê yên Belgeya HTML-ê bistînin",
      "7": "Naveroka HTML-ê derbas bikin û Çavkaniyên wê hilînin",
      "8": "HTML DOM-ê ji Naveroka String bistînin û Veguhezînin Belgeyê",
      "9": "HTML DOM digel Veguheztina Çavkaniyan",
      "10": "Di HTML-ê de Belgeyên Cûda Formên Biguherînin",
      "11": "Guhertina Rast",
      "12": "Li Belgeya Encamê Parastina Xwendin û / an Nivîsandinê bicîh bikin",
      "13": "Belgeyên Pêvajoya Peyvê rûpelan bikin û di Her Edîtorên WYSIWYG de biguherînin",
      "14": "Database (DB) & Navrûya Bikarhêner (UI) Agnostic",
      "15": "Taybetmendiyên Pêvajoya XML ya Hêzdar",
      "16": "Ji Belgeyên Ketinê OTF (Fontên Tîpa Vekirî) bistînin û ji Belgeya Encamê re derxînin",
      "17": "Wêneyên Raster û Vektorê Di hundurê Formên Belgeya Ketinê yên Piştevan de Pêvajo Bikin",
      "18": "Naveroka Rûpelê Xebatê ya Guherandinî li ser Helwestek Xwestî têxe nav Bernameya Orjînal",
      "19": "Slides biguherînin û wan têxin nav Spreadsheet encam",
      "20": "Di dema tomarkirinê de Fontan di Belgeya Pêvajoya Peyva Encamê de bicîh bikin"
    },
    "more_features_loop": {
      "title1": "Veguheztina Rastîn ji û ji HTML DOM",
      "content1": "GroupDocs.Editor ji bo .NET API rê dide serîlêdanên we yên .NET ku belgeyek bi formata piştgirî bistînin û wê veguhezînin modelek HTML Document Object (DOM) ligel derxistina çavkaniyên pêvekirî, wek CSS. Dûv re hûn dikarin bi karanîna Edîtorê HTML-a xweya bijare guherandinan li HTML-ê bikin. Piştî ku we guherandinê qediya, GroupDocs.Editor ji bo .NET API destûrê dide we ku hûn vê HTML DOM-ê bi duristî vegerînin pelê orîjînal.",
      "title2": "Çavkaniyên Derve Barkirin & Derxînin",
      "content2": "GroupDocs.Editor ji bo .NET API dikare çavkaniyên derveyî yên ku bi belgeyên piştgirîkirî ve girêdayî ne, wekî wêne, font, CSS û hêj bêtir bigire. Dûv re çavkaniyên ku hatine hilanîn dikarin werin barkirin, veguheztin û ji belgeya encam a HTML-ê cuda werin hilanîn. Ev ji we re hilberek hêsantir bi rêve dibe.",
      "title3": "Di nav Formên Pelên Pêvajoya Peyv de Bandorên Nivîsarê bicîh bikin",
      "content3": "Edîtorê belgeya GroupDocs API dihêle ku bandorên nivîsê yên tevlihev (Shadow, bandora 3D, Outline, Glow, Engrave, Emboss) lê zêde bike dema ku bi formatên hilberandina belgeyên Microsoft Word-ê yên piştgirî re dixebite. Ev taybetmendî bixwe-çalak e ku dema ku belgeya ku bi bandorên nivîsê yên weha tête hilberandin dikare were dîtin.",
      "title4": "Taybetmendiyên Manîpulasyona XML ya Hêzdar",
      "content4-1": "Bi karanîna GroupDocs.Editor ji bo .NET API hûn dikarin belgeyên XML vekin, bibînin û biguherînin. API-ya meya guherandinê piştgirî û naskirina tagên XML, taybetmendî digel nirxên wan, danezanên XML, beşên CDATA, pênaseyên DOCTYPE, û saziyên din ên taybetî yên XML-ê pêşkêşî dike. Hûn dikarin mîhengên font û rengan ji bo her hebûnek cihêreng di avahiya XML de xweş bikin.",
      "content4-2": "Taybetmendiya XML Converter têra xwe jîr e ku xeletiyên di pelê XML de nîşan bide û meriv wan çawa rast bike. Mekanîzmaya naskerê URI û e-nameyê taybetmendiyên XML dişoxilîne û URI-yên naskirî û navnîşanên e-nameyê yên di hundurê etîketa A-yê de wekî lînkan nîşan dide da ku ew wekî lînk, ne wekî metnek di hundurê pelê HTML-a encam de bêne guheztin."
    }
  },
  "Solutions": {
    "title": "GroupDocs.Editor ji bo hawîrdorên din ên pêşkeftina populer API-ên guherandina belgeyan pêşkêşî dike"
  }
}